// УстановитьОтбор
//
Процедура УстановитьОтбор(КомпоновщикНастроек, ИмяПараметра, ЗначениеПараметра, ВидСравнения)
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПараметра);
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ЗначениеПараметра;	
		ЭлементОтбора.ВидСравнения = ВидСравнения;
	Иначе
		ЭлементОтбора.Использование = Ложь;
	КонецЕсли;
КонецПроцедуры

// УстановитьПараметр
//
Процедура УстановитьПараметр(КомпоновщикНастроек, ИмяПараметра, ЗначениеПараметра)
	ПараметрДанныхТекущий = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	ПараметрДанныхТекущий.Значение = ЗначениеПараметра;
	ПараметрДанныхТекущий.Использование = Истина;
КонецПроцедуры

Процедура УстановитьПараметрыОтборы()
	УстановитьПараметр(КомпоновщикНастроек, "ДатаОстатков", ДатаОстатков);
	КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	Если ТолькоПросроченные Тогда
		УстановитьОтбор(КомпоновщикНастроек, "Просрочено", Истина, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
КонецПроцедуры

Процедура ДатаОстатковПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(ДатаОстатков) Тогда ДатаОстатков = ТекущаяДата(); КонецЕсли;
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура ПриОткрытии()
	Если Не ЗначениеЗаполнено(ДатаОстатков) Тогда ДатаОстатков = ТекущаяДата(); КонецЕсли;
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура ТолькоПросроченныеПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(ДатаОстатков) Тогда ДатаОстатков = ТекущаяДата(); КонецЕсли;
	УстановитьПараметрыОтборы();
КонецПроцедуры
