Процедура ПрочитатьОплаты() Экспорт
	лЗапрос = Новый Запрос;
	лЗапрос.УстановитьПараметр("НалоговаяНакладная", НалоговаяНакладная);
	лЗапрос.Текст =
	"ВЫБРАТЬ
	|	Рег.ДоговорКонтрагента,
	|	Рег.ПлатежноеПоручение,
	|	Рег.Сумма
	|ИЗ
	|	Документ.РегистрацияВходящегоНалоговогоДокумента.Оплаты КАК Рег
	|ГДЕ
	|	Рег.Ссылка = &НалоговаяНакладная";
	
	лтзРез = лЗапрос.Выполнить().Выгрузить();
	
	Оплаты.Загрузить( лтзРез );
КонецПроцедуры

Функция ЗаписатьОплаты() Экспорт
	
	Если Не ЗначениеЗаполнено(НалоговаяНакладная) Тогда Возврат Ложь; КонецЕсли;
	
	лОбъект = НалоговаяНакладная.ПолучитьОбъект();
	лОбъект.ОбменДанными.Загрузка = Истина;
	лОбъект.Оплаты.Загрузить( Оплаты.Выгрузить() );
	
	Попытка
		лОбъект.Записать( РежимЗаписиДокумента.Запись );
	Исключение
		#Если Клиент Тогда
			Предупреждение("Не удалось записать оплаты НН : " + НалоговаяНакладная + Символы.ПС + ОписаниеОшибки());
		#КонецЕсли
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
