
Процедура КнопкаСформироватьНажатие(Кнопка)
	
	_УИД = Строка(Новый УникальныйИдентификатор());
	МассивРезультатов = Новый Массив;
	
	
	_Пользователь = "ua551103";
	_Пароль = "9653H5";
	_Адрес = "";
	КомментарийКСообщению = "";
	
	
	Попытка
		ФайлСообщения = ПроверкаКонтрагента( _УИД, КодКонтрагента, _Адрес, КомментарийКСообщению, _Пользователь, _Пароль);
		//МассивРезультатов.Добавить(ОбработкаФайлаСообщения(ФайлСообщения,"контрагента",_СсылкаНаОбъект.Контрагент));
		МассивРезультатов.Добавить(ОбработкаФайлаСообщения(ФайлСообщения,"контрагента",));
	Исключение
		//МассивРезультатов.Добавить(Новый Структура("ПроверкаПрошла, РезультатПроверки, Отказ, Владелец", Ложь, "Не смогли получить результат проверки Контрагента ", ЛОЖЬ,_СсылкаНаОбъект.Контрагент));
		МассивРезультатов.Добавить(Новый Структура("ПроверкаПрошла, РезультатПроверки, Отказ, Владелец", Ложь, "Не смогли получить результат проверки Контрагента ", ЛОЖЬ,));
	КонецПопытки;
	
	
	
	
КонецПроцедуры

Функция  ПроверкаКонтрагента(_УИД,_КодКонтрагента,_Адрес,КомментарийКСообщению, _Пользователь, _Пароль)
	МассивСозданногоXML = СоздатьXMLФайл();
	ФайлСообщения = МассивСозданногоXML[1];
	ЗаписьXML = МассивСозданногоXML[0];
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("soap12:Envelope");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsd", "http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:soap12", "http://www.w3.org/2003/05/soap-envelope");
	ЗаписьXML.ЗаписатьНачалоЭлемента("soap12:Body");
	//ЗаписьXML.ЗаписатьНачалоЭлемента("CheckFirmReason"); // Chaeck
	ЗаписьXML.ЗаписатьНачалоЭлемента("GetCompanyInfo"); // Chaeck
	ЗаписьXML.ЗаписатьАтрибут("xmlns", "https://s02.agglomerated.info/Terrabank/");
	ЗаписьXML.ЗаписатьНачалоЭлемента("login");
	ЗаписьXML.ЗаписатьТекст(СокрЛП(_Пользователь));
	ЗаписьXML.ЗаписатьКонецЭлемента(); // login
	ЗаписьXML.ЗаписатьНачалоЭлемента("password");
	ЗаписьXML.ЗаписатьТекст(СокрЛП(_Пароль));
	ЗаписьXML.ЗаписатьКонецЭлемента(); // password
	ЗаписьXML.ЗаписатьНачалоЭлемента("emailInfo");
	ЗаписьXML.ЗаписатьТекст(_Адрес);
	ЗаписьXML.ЗаписатьКонецЭлемента(); // emailInfo
	ЗаписьXML.ЗаписатьНачалоЭлемента("requestId");
	ЗаписьXML.ЗаписатьТекст(_УИД);
	ЗаписьXML.ЗаписатьКонецЭлемента(); // requestId
	ЗаписьXML.ЗаписатьНачалоЭлемента("code");
	ЗаписьXML.ЗаписатьТекст(_КодКонтрагента);
	ЗаписьXML.ЗаписатьКонецЭлемента(); // code
	ЗаписьXML.ЗаписатьНачалоЭлемента("reason");
	ЗаписьXML.ЗаписатьТекст(КомментарийКСообщению);
	ЗаписьXML.ЗаписатьКонецЭлемента(); // reason
	ЗаписьXML.ЗаписатьКонецЭлемента(); // ChaeckFirm
	ЗаписьXML.ЗаписатьКонецЭлемента(); // soap12:Body
	ЗаписьXML.ЗаписатьКонецЭлемента(); // soap12:Envelope
	ЗаписьXML.Закрыть();
	Возврат ФайлСообщения;
КонецФункции // ПроверкаКонтрагента

Функция ОбработкаФайлаСообщения(ФайлСообщения, КогоПроверяли, ссылкаОб)
	
	Файл = Новый Файл(ФайлСообщения);
	ФайлРезультата = ПолучитьИмяВременногоФайла("xml");
	_Заголовки = "Content-Type: application/soap+xml; charset=utf-8" + Символы.ВК + Символы.ПС + "Content-length: " + Формат(Файл.Размер(), "ЧГ=0");
	_ТекстРезультат = "";                 
	Попытка
		
		ПроксиСервер = Новый ИнтернетПрокси;
		//ПроксиСервер.Установить("http","10.104.10.60",8080);
		//ПроксиСервер.Установить("https","10.104.10.60",8080);
		//_Соединение = Новый HTTPСоединение("s02.agglomerated.info",,,, ПроксиСервер, , Истина);
		_Соединение = Новый HTTPСоединение("s02.agglomerated.info",,,, ПроксиСервер, , Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(СпособВыбораСертификатаWindows.Авто), Новый СертификатыУдостоверяющихЦентровWindows()));
		_Соединение.ОтправитьДляОбработки(ФайлСообщения, "/Terrabank/TerrabankService.asmx", ФайлРезультата, _Заголовки);
		
	Исключение
		_ТекстРезультат = ОписаниеОшибки();
	КонецПопытки;
	УдалитьФайлы(ФайлСообщения);
	лТэг1 = 0;
	лТэг2 = 0;
	лТэг3 = "";
	Если ПустаяСтрока(_ТекстРезультат) Тогда
		_Чтение = Новый ЧтениеXML();
		_Чтение.ОткрытьФайл(ФайлРезультата);
		_Счетчик = 0;
		Пока _Чтение.Прочитать() Цикл
			Если (_Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента) И (НРег(_Чтение.Имя) = "string") Тогда
				_Счетчик = _Счетчик + 1;
				Если _Счетчик = 1 Тогда
					// -1 - неправильный логин\пароль, 0 - предупреждений не найдено, 1 - найдены предупреждения
					_Чтение.Прочитать();
					Если _Чтение.ТипУзла = ТипУзлаXML.Текст Тогда
						_ЗначениеПроверки = Число(_Чтение.Значение);
						лТэг1 = _ЗначениеПроверки;
						Если _ЗначениеПроверки = 0 Тогда
							_ТекстРезультат = "ОК";
							Прервать;
						ИначеЕсли _ЗначениеПроверки = -1 Тогда
							_ТекстРезультат = "Неправильный логин\пароль";
							Прервать;
						КонецЕсли;
					КонецЕсли;
					
				ИначеЕсли _Счетчик = 2 Тогда
					// Код первого найденного предупреждения             
					//1, Некорректный ИНН.
					//2, Найдено предупреждение.
					//3, Найдена информация о судимости.
					//4, Найдена информация об утере паспорта.
					//5, Найдены предупреждения по связанным структурам/лицам.
					//6, ИНН не соответствует ФИО.
					//7, Недавнозарегистрированное предприятие с признаками фиктивности.
					_Чтение.Прочитать();
					Если _Чтение.ТипУзла = ТипУзлаXML.Текст Тогда
						лТэг2 = СокрЛП(_Чтение.Значение);
					КонецЕсли;
				ИначеЕсли _Счетчик = 3 Тогда
					// Текстовое описание первого найденного предупреждения         
					_Чтение.Прочитать();
					Если (_Чтение.ТипУзла = ТипУзлаXML.Текст) Тогда
						_ТекстРезультат = _Чтение.Значение;
					Иначе
						_ТекстРезультат = "";
					КонецЕсли;
					лТэг3 = _ТекстРезультат;
					Прервать;
				ИначеЕсли _Счетчик = 4 Тогда              
					// Код запроса (который был передан в качестве параметра запроса)
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		_Чтение.Закрыть();
		Если _Счетчик = 0 Тогда
			_ТД = Новый ТекстовыйДокумент();
			_ТД.Прочитать(ФайлРезультата, "UTF-8");
			_ТекстРезультат = _ТД.ПолучитьТекст();
		КонецЕсли;
		УдалитьФайлы(ФайлРезультата);
	КонецЕсли;
	
	ПредварительныйРезультат = _ТекстРезультат;	
	_ТекстРезультат = "Результат проверки " + КогоПроверяли+ " "+ СсылкаОб+": "+_ТекстРезультат;
	
	Возврат Новый Структура("ПроверкаПрошла, РезультатПроверки, Отказ, Владелец, Тэг1, Тэг2, Тэг3", (ПредварительныйРезультат="ОК"), _ТекстРезультат, ЛОЖЬ, ссылкаОб, лТэг1, лТэг2, лТэг3);
	
КонецФункции // ОбработкаФайлаСообщения

// СоздатьXMLФайл
//
Функция СоздатьXMLФайл()
	
	ФайлСообщения = ПолучитьИмяВременногоФайла("xml");
	ФайлСообщенияУИД = Новый Файл(ФайлСообщения);
	УИДФайлаСообщения = Строка(Новый УникальныйИдентификатор);
	ФайлСообщения = ФайлСообщенияУИД.Путь + УИДФайлаСообщения + ФайлСообщенияУИД.Имя;
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(ФайлСообщения);
	МассивВозврата = Новый Массив;
	МассивВозврата.Добавить(ЗаписьXML);
	МассивВозврата.Добавить(ФайлСообщения) ;
	
	Возврат МассивВозврата;
	
КонецФункции // СоздатьXMLФайл
