Функция УстановитьПол(ОтчествоРаботника)

	Если Прав(ОтчествоРаботника, 2) = "ич" ИЛИ Прав(ОтчествоРаботника, 2) = "ИЧ" ИЛИ Прав(ОтчествоРаботника, 2) = "ич" ИЛИ Прав(ОтчествоРаботника, 2) = "ИЧ" Тогда
		Пол = "M";
	ИначеЕсли Прав(ОтчествоРаботника, 2) = "на" ИЛИ Прав(ОтчествоРаботника, 2) = "НА" ИЛИ Прав(ОтчествоРаботника, 2) = "на" ИЛИ Прав(ОтчествоРаботника, 2) = "НА" Тогда
		Пол = "F";
	Иначе
		Пол = "";
	КонецЕсли; 

	Возврат Пол;
	
КонецФункции

Функция локЕстьНеЦифрыВСтроке(Знач СтрокаПроверки)
	
	Для а = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, а, 1));
		Если НЕ (КодСимвола >= 48 И КодСимвола <= 57) Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЦикла; 

	Возврат Ложь;
	
КонецФункции

Функция СформироватьМассивСтрок(ИсходнаяСтрока)
	
	МассивСтрок = Новый Массив();
	ПозицияПослПробела = 500;
	Буфер = СокрЛ(ИсходнаяСтрока);
	Пока ПозицияПослПробела > 0 Цикл
		ПозицияПослПробела = Найти(Буфер, " ");
		
		Если ПозицияПослПробела = 0 Тогда
			Если ЗначениеЗаполнено(Буфер) Тогда
				МассивСтрок.Добавить(СокрЛП(Буфер));
			КонецЕсли;	
			Прервать;
		Иначе
			МассивСтрок.Добавить(СокрЛП(Лев(Буфер, ПозицияПослПробела)));
			Буфер  = СокрЛП(Сред(Буфер, ПозицияПослПробела + 1));
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСтрок;
	
КонецФункции

Функция УбратьЛишнее(ФИО)
	
	ФИО = СтрЗаменить(ФИО,"."," ");
	ФИО = СтрЗаменить(ФИО,","," ");
	ФИО = СтрЗаменить(ФИО,""""," "); 
	ФИО = СтрЗаменить(ФИО,"ФІЗИЧНА ОСОБА-ПІДПРИЄМЕЦЬ","");
	ФИО = СтрЗаменить(ФИО,"приватний нотаріус","");
	ФИО = СтрЗаменить(ФИО,"ФО СПД","");            
	ФИО = СтрЗаменить(ФИО,"ФО СПД","");            
	ФИО = СтрЗаменить(ФИО,"СПД-ФО","");  
	ФИО = СтрЗаменить(ФИО,"ФЛ-П","");
	
	Если Прав(ФИО,3) = " ЧП"  ИЛИ Лев(ФИО,3) = "ЧП " Тогда
		ФИО = СтрЗаменить(ФИО,"ЧП","");
	ИначеЕсли Прав(ФИО,3) = " ПП" ИЛИ Лев(ФИО,3) = "ПП " Тогда
		ФИО = СтрЗаменить(ФИО,"ПП","");
	ИначеЕсли Прав(ФИО,3) = " ФО" ИЛИ Лев(ФИО,3) = "ФО " Тогда
		ФИО = СтрЗаменить(ФИО,"ФО","");
	ИначеЕсли Прав(ФИО,3) = " ПН" ИЛИ Лев(ФИО,3) = "ПН " Тогда
		ФИО = СтрЗаменить(ФИО,"ПН","");
	ИначеЕсли Прав(ФИО,4) = " ФОП" ИЛИ Лев(ФИО,4) = "ФОП " Тогда
		ФИО = СтрЗаменить(ФИО,"ФОП","");
	ИначеЕсли Прав(ФИО,4) = " ФЛП" ИЛИ Лев(ФИО,4) = "ФЛП " Тогда
		ФИО = СтрЗаменить(ФИО,"ФЛП","");
	ИначеЕсли Прав(ФИО,4) = " СПД" ИЛИ Лев(ФИО,4) = "СПД " Тогда
		ФИО = СтрЗаменить(ФИО,"СПД",""); 
	КонецЕсли;	
	
	Возврат ФИО;
	
КонецФункции

Процедура Отработать(ВТаблицу = Ложь, ВФайл = Истина, ВыбКаталог = "G:\1C\other\Screening\Out") Экспорт	
	
	ТаблицаБаз = ПолучитьТаблицуИзМакета();
	
	ТаблБух = ИнициироватьТаблицуЗначений();
	ТаблТрейд = ИнициироватьТаблицуЗначений();
	
	Для каждого СтрокаТаблицы Из ТаблицаБаз Цикл
		
		Путь = СтрокаТаблицы.Путь;
		Платформа = СтрокаТаблицы.Платформа;
  		Состояние("Рабочая база " + Путь);
		БазаКом = Новый COMObject("V8"+СтрокаТаблицы.Платформа+".COMConnector"); 
		Кавычка = Символ(34);
		Префикс = СокрЛП(СтрокаТаблицы.Префикс);
        Компания = СтрокаТаблицы.Элеватор;
		ИспользоватьИсключения = Ложь;
		Если Компания = "OEK" Тогда
			Логин = "Dima";
			Пароль = "koza";
		ИначеЕсли Компания = "Kolos" ИЛИ Компания = "AT"  Тогда
			Логин = "Козенко Дмитрий";
			Пароль = "koza";
		ИначеЕсли Компания = "GGU_trade" ИЛИ Компания = "GGU_buh" Тогда
			Логин = "Козенко Дмитрий";
			Пароль = "koza1424";
		ИначеЕсли Компания = "Balta" ИЛИ Компания = "Lubashevka" Тогда
			Логин = "Kozenko";
			Пароль = "koza";
		КонецЕсли;	
		Попытка 
			Соединение = БазаКом.Connect(Путь + ";Usr=" +Кавычка + Логин + Кавычка + ";Pwd="+ Кавычка + Пароль + Кавычка);
		Исключение 
			Сообщить("База данных не открыта!!! " + Путь); 
			Продолжить;
		КонецПопытки;
	
		Если Не (Компания = "GGU_trade" ИЛИ Компания = "GGU_buh") Тогда
			Если ВТаблицу Тогда
				ТабДок = Новый ТабличныйДокумент;
				
				Макет = ПолучитьМакет("Отчет");
				ОбластьНачало = Макет.ПолучитьОбласть("Шапка");
				ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
				
				ТабДок.Вывести(ОбластьНачало);
				
			КонецЕсли;
			
			Если ВФайл Тогда
				ИмяФайла = "Combined_" + Формат(Год(ТекущаяДата()),"ЧГ=") + Формат(Месяц(ТекущаяДата()),"ЧЦ=2; ЧВН=") + Формат(День(ТекущаяДата()),"ЧЦ=2; ЧВН=") + "_" + Компания + ".txt";
				Если Прав(ВыбКаталог,1) = "\" Тогда
					ЗпТекста = Новый ЗаписьТекста(ВыбКаталог + ИмяФайла, КодировкаТекста.UTF8);
				Иначе
					ЗпТекста = Новый ЗаписьТекста(ВыбКаталог + "\" + ИмяФайла, КодировкаТекста.UTF8);
				КонецЕсли;	
				//ЗпТекста.ЗаписатьСтроку("First Name" 		+ Символы.Таб +
				//                "Unique Code" 		+ Символы.Таб +
				//                "Optional Column 1" + Символы.Таб +
				//                "Optional Column 2" + Символы.Таб +
				//                "Optional Column 3" + Символы.Таб +
				//                "Optional Column 4" + Символы.Таб +
				//                "Optional Column 5" + Символы.Таб +
				//                "Optional Column 6" + Символы.Таб +
				//                "Optional Column 7" + Символы.Таб +
				//                "Optional Column 8" + Символы.Таб +
				//                "Last name" 		+ Символы.Таб +
				//                "Customer Type" 	+ Символы.Таб +
				//                "Address field 13" 	+ Символы.Таб +
				//                "Address field 14" 	+ Символы.Таб +
				//                "Address field 15" 	+ Символы.Таб +
				//                "Address field 16" 	+ Символы.Таб +
				//                "Address field 17" 	+ Символы.Таб +
				//                "Address field 18" 	+ Символы.Таб +
				//                "Address field 19" 	+ Символы.Таб +
				//                "Post Code" 		+ Символы.Таб +
				//                "Nationality" 		+ Символы.Таб +
				//                "Nat Name" 			+ Символы.Таб +
				//                "Residency" 		+ Символы.Таб +
				//                "Residency Name" 	+ Символы.Таб +
				//                "DOB" 				+ Символы.Таб +
				//                "Gender" 			+ Символы.Таб +
				//                "Feed Source Name" 	+ Символы.Таб +
				//                "Feed Source Key" 	+ Символы.Таб +
				//                "Risk Score" 		+ Символы.Таб +
				//                "Cust status" );
		
			КонецЕсли;	               
	    КонецЕсли;
		Состояние("Выполняется запрос к базе " + Путь);
		
		Запрос = Соединение.NewObject("Запрос");
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблКонтрагентов.Контрагент КАК Ссылка,
		|	ТаблКонтрагентов.Контрагент.Наименование КАК Наименование,
		|	ВЫРАЗИТЬ(ТаблКонтрагентов.Контрагент.НаименованиеПолное КАК СТРОКА(250)) КАК НаименованиеПолное,
		|	ТаблКонтрагентов.Контрагент.Код КАК Код,
		|	ТаблКонтрагентов.Контрагент.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
		|	ТаблКонтрагентов.Контрагент.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА ТаблКонтрагентов.Контрагент.ГоловнойКонтрагент = ТаблКонтрагентов.Контрагент
		|			ТОГДА """"
		|		ИНАЧЕ ВЫРАЗИТЬ(ТаблКонтрагентов.Контрагент.ГоловнойКонтрагент.НаименованиеПолное КАК СТРОКА(250))
		|	КОНЕЦ КАК ГоловнойКонтрагент,
		|	ТаблКонтрагентов.Контрагент.НеЯвляетсяРезидентом КАК НеЯвляетсяРезидентом";
		Если Компания = "GGU_trade" Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ТаблКонтрагентов.Контрагент.Подразделение.Наименование КАК Подразделение";			
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ПОМЕСТИТЬ тблКонтрагенты
		|ИЗ
		|	(ВЫБРАТЬ
		|		Контрагенты.Ссылка КАК Контрагент
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты";
		Если Компания = "Balta" ИЛИ Компания = "Lubashevka" Тогда
			Запрос.Текст = Запрос.Текст + "
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКонтрагентов КАК СтатусыКонтрагентов
			|			ПО Контрагенты.КодПоЕДРПОУ = СтатусыКонтрагентов.Код";			
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|	ГДЕ
		|		Контрагенты.ПометкаУдаления = ЛОЖЬ
		|	    И Контрагенты.ЭтоГруппа = ЛОЖЬ";
		Если Компания = "Balta" ИЛИ Компания = "Lubashevka" Тогда
			Запрос.Текст = Запрос.Текст + "
			|   	И СтатусыКонтрагентов.Статус = &Статус
			|   	И СтатусыКонтрагентов.Код <> """"";
		ИначеЕсли Компания = "GGU_buh" ИЛИ Компания = "OEK" ИЛИ Компания = "AT"  Тогда
			Запрос.Текст = Запрос.Текст + "
			|	    И Контрагенты.СтатусКонтрагента = &Статус";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|	    И Контрагенты.Статус = &Статус";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|	) КАК ТаблКонтрагентов
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблКонтрагентов.Контрагент,
		|	ТаблКонтрагентов.Контрагент.Наименование,
		|	ВЫРАЗИТЬ(ТаблКонтрагентов.Контрагент.НаименованиеПолное КАК СТРОКА(250)),
		|	ТаблКонтрагентов.Контрагент.Код,
		|	ТаблКонтрагентов.Контрагент.КодПоЕДРПОУ,
		|	ТаблКонтрагентов.Контрагент.ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА ТаблКонтрагентов.Контрагент.ГоловнойКонтрагент = ТаблКонтрагентов.Контрагент
		|			ТОГДА """"
		|		ИНАЧЕ ВЫРАЗИТЬ(ТаблКонтрагентов.Контрагент.ГоловнойКонтрагент.НаименованиеПолное КАК СТРОКА(250))
		|	КОНЕЦ,
		|	ТаблКонтрагентов.Контрагент.НеЯвляетсяРезидентом";
		Если Компания = "GGU_trade" Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	ТаблКонтрагентов.Контрагент.Подразделение";			
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тблКонтрагенты.Ссылка,
		|	тблКонтрагенты.Наименование,
		|	тблКонтрагенты.НаименованиеПолное,
		|	тблКонтрагенты.Код,
		|	тблКонтрагенты.КодПоЕДРПОУ,
		|	тблКонтрагенты.ЮрФизЛицо,
		|	тблКонтрагенты.ГоловнойКонтрагент,
		|	тблКонтрагенты.НеЯвляетсяРезидентом,";
		Если Компания = "GGU_trade" Тогда
			Запрос.Текст = Запрос.Текст + "
			|	тблКонтрагенты.Подразделение,";			
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
		|				ТОГДА КонтактнаяИнформация.Вид
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Вид_Юр,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
		|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(500))
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Представление_Юр,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
		|				ТОГДА КонтактнаяИнформация.Поле1
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле1_Юр,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
		|				ТОГДА КонтактнаяИнформация.Поле2
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле2_Юр,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
		|				ТОГДА КонтактнаяИнформация.Поле3
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле3_Юр,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
		|				ТОГДА КонтактнаяИнформация.Поле4
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле4_Юр,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
		|				ТОГДА КонтактнаяИнформация.Поле5
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле5_Юр,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
		|				ТОГДА КонтактнаяИнформация.Поле6
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле6_Юр,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
		|				ТОГДА КонтактнаяИнформация.Поле7
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле7_Юр,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
		|				ТОГДА КонтактнаяИнформация.Поле8
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле8_Юр,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
		|				ТОГДА КонтактнаяИнформация.Поле9
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле9_Юр,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
		|				ТОГДА КонтактнаяИнформация.Поле10
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле10_Юр,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
		|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Комментарий КАК СТРОКА(500))
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Комментарий_Юр,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
		|				ТОГДА КонтактнаяИнформация.Вид
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Вид_Факт,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
		|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(500))
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Представление_Факт,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
		|				ТОГДА КонтактнаяИнформация.Поле1
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле1_Факт,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
		|				ТОГДА КонтактнаяИнформация.Поле2
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле2_Факт,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
		|				ТОГДА КонтактнаяИнформация.Поле3
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле3_Факт,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
		|				ТОГДА КонтактнаяИнформация.Поле4
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле4_Факт,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
		|				ТОГДА КонтактнаяИнформация.Поле5
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле5_Факт,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
		|				ТОГДА КонтактнаяИнформация.Поле6
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле6_Факт,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
		|				ТОГДА КонтактнаяИнформация.Поле7
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле7_Факт,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
		|				ТОГДА КонтактнаяИнформация.Поле8
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле8_Факт,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
		|				ТОГДА КонтактнаяИнформация.Поле9
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле9_Факт,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
		|				ТОГДА КонтактнаяИнформация.Поле10
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле10_Факт,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
		|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Комментарий КАК СТРОКА(500))
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Комментарий_Факт,";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|	МАКСИМУМ( """" ) КАК Вид_Дост,
			|	МАКСИМУМ( """" ) КАК Представление_Дост,
			|	МАКСИМУМ( """" ) КАК Поле1_Дост,
			|	МАКСИМУМ( """" ) КАК Поле2_Дост,
			|	МАКСИМУМ( """" ) КАК Поле3_Дост,
			|	МАКСИМУМ( """" ) КАК Поле4_Дост,
			|	МАКСИМУМ( """" ) КАК Поле5_Дост,
			|	МАКСИМУМ( """" ) КАК Поле6_Дост,
			|	МАКСИМУМ( """" ) КАК Поле7_Дост,
			|	МАКСИМУМ( """" ) КАК Поле8_Дост,
			|	МАКСИМУМ( """" ) КАК Поле9_Дост,
			|	МАКСИМУМ( """" ) КАК Поле10_Дост,
			|	МАКСИМУМ( """" ) КАК Комментарий_Дост,";
		Иначе	
			Запрос.Текст = Запрос.Текст + "
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
			|				ТОГДА КонтактнаяИнформация.Вид
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК Вид_Дост,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
			|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(500))
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК Представление_Дост,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
			|				ТОГДА КонтактнаяИнформация.Поле1
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК Поле1_Дост,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
			|				ТОГДА КонтактнаяИнформация.Поле2
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК Поле2_Дост,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
			|				ТОГДА КонтактнаяИнформация.Поле3
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК Поле3_Дост,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
			|				ТОГДА КонтактнаяИнформация.Поле4
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК Поле4_Дост,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
			|				ТОГДА КонтактнаяИнформация.Поле5
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК Поле5_Дост,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
			|				ТОГДА КонтактнаяИнформация.Поле6
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК Поле6_Дост,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
			|				ТОГДА КонтактнаяИнформация.Поле7
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК Поле7_Дост,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
			|				ТОГДА КонтактнаяИнформация.Поле8
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК Поле8_Дост,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
			|				ТОГДА КонтактнаяИнформация.Поле9
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК Поле9_Дост,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
			|				ТОГДА КонтактнаяИнформация.Поле10
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК Поле10_Дост,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
			|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Комментарий КАК СТРОКА(500))
			|			ИНАЧЕ """"
			|		КОНЕЦ) КАК Комментарий_Дост,";
		КонецЕсли;	
		Если Компания = "GGU_trade" ИЛИ Компания = "GGU_buh" Тогда
			Запрос.Текст = Запрос.Текст + "
			|	МАКСИМУМ( ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
			|				ТОГДА КонтактнаяИнформация.Вид
			|			ИНАЧЕ """"
			|		КОНЕЦ ) КАК Вид_Англ,
			|	МАКСИМУМ( ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
			|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(500))
			|			ИНАЧЕ """"
			|		КОНЕЦ ) КАК Представление_Англ,
			|	МАКСИМУМ( ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
			|				ТОГДА КонтактнаяИнформация.Поле1
			|			ИНАЧЕ """"
			|		КОНЕЦ ) КАК Поле1_Англ,
			|	МАКСИМУМ( ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
			|				ТОГДА КонтактнаяИнформация.Поле2
			|			ИНАЧЕ """"
			|		КОНЕЦ ) КАК Поле2_Англ,
			|	МАКСИМУМ( ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
			|				ТОГДА КонтактнаяИнформация.Поле3
			|			ИНАЧЕ """"
			|		КОНЕЦ ) КАК Поле3_Англ,
			|	МАКСИМУМ( ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
			|				ТОГДА КонтактнаяИнформация.Поле4
			|			ИНАЧЕ """"
			|		КОНЕЦ ) КАК Поле4_Англ,
			|	МАКСИМУМ( ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
			|				ТОГДА КонтактнаяИнформация.Поле5
			|			ИНАЧЕ """"
			|		КОНЕЦ ) КАК Поле5_Англ,
			|	МАКСИМУМ( ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
			|				ТОГДА КонтактнаяИнформация.Поле6
			|			ИНАЧЕ """"
			|		КОНЕЦ ) КАК Поле6_Англ,
			|	МАКСИМУМ( ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
			|				ТОГДА КонтактнаяИнформация.Поле7
			|			ИНАЧЕ """"
			|		КОНЕЦ ) КАК Поле7_Англ,
			|	МАКСИМУМ( ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
			|				ТОГДА КонтактнаяИнформация.Поле8
			|			ИНАЧЕ """"
			|		КОНЕЦ ) КАК Поле8_Англ,
			|	МАКСИМУМ( ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
			|				ТОГДА КонтактнаяИнформация.Поле9
			|			ИНАЧЕ """"
			|		КОНЕЦ ) КАК Поле9_Англ,
			|	МАКСИМУМ( ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
			|				ТОГДА КонтактнаяИнформация.Поле10
			|			ИНАЧЕ """"
			|		КОНЕЦ ) КАК Поле10_Англ,
			|	МАКСИМУМ( ВЫБОР
			|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
			|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Комментарий КАК СТРОКА(500))
			|			ИНАЧЕ """"
			|		КОНЕЦ ) КАК Комментарий_Англ";
			
		Иначе	
			Запрос.Текст = Запрос.Текст + "
			|	МАКСИМУМ( """" ) КАК Вид_Англ,
			|	МАКСИМУМ( """" ) КАК Представление_Англ,
			|	МАКСИМУМ( """" ) КАК Поле1_Англ,
			|	МАКСИМУМ( """" ) КАК Поле2_Англ,
			|	МАКСИМУМ( """" ) КАК Поле3_Англ,
			|	МАКСИМУМ( """" ) КАК Поле4_Англ,
			|	МАКСИМУМ( """" ) КАК Поле5_Англ,
			|	МАКСИМУМ( """" ) КАК Поле6_Англ,
			|	МАКСИМУМ( """" ) КАК Поле7_Англ,
			|	МАКСИМУМ( """" ) КАК Поле8_Англ,
			|	МАКСИМУМ( """" ) КАК Поле9_Англ,
			|	МАКСИМУМ( """" ) КАК Поле10_Англ,
			|	МАКСИМУМ( """" ) КАК Комментарий_Англ";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	тблКонтрагенты КАК тблКонтрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО тблКонтрагенты.Ссылка = КонтактнаяИнформация.Объект
		|			И (КонтактнаяИнформация.Тип = &Адрес)
		|
		|СГРУППИРОВАТЬ ПО
		|	тблКонтрагенты.Ссылка,
		|	тблКонтрагенты.Наименование,
		|	тблКонтрагенты.НаименованиеПолное,
		|	тблКонтрагенты.Код,
		|	тблКонтрагенты.КодПоЕДРПОУ,
		|	тблКонтрагенты.ЮрФизЛицо,
		|	тблКонтрагенты.ГоловнойКонтрагент,
		|	тблКонтрагенты.НеЯвляетсяРезидентом";
		Если Компания = "GGU_trade" Тогда
			Запрос.Текст = Запрос.Текст + ",
			|	тблКонтрагенты.Подразделение";			
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.Ссылка,
		|	Данные.Наименование,
		|	Данные.НаименованиеПолное КАК Name,
		|	Данные.Код,
		|	Данные.КодПоЕДРПОУ КАК ЕДРПОУ,
		|	Данные.ЮрФизЛицо,
		|	ВЫБОР
		|		КОГДА Данные.ЮрФизЛицо = &ЮрЛицо
		|			ТОГДА ""ORGANISATION""
		|		ИНАЧЕ ""INDIVIDUAL""
		|	КОНЕЦ КАК CustomerType,
		|	""Active"" КАК Cust_status,
		|	Данные.ГоловнойКонтрагент,
		|	Данные.НеЯвляетсяРезидентом,";
		Если Компания = "GGU_trade" Тогда
			Запрос.Текст = Запрос.Текст + "
			|	Данные.Подразделение,";			
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Вид_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Вид_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Вид_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Вид_Дост
			|						ИНАЧЕ Данные.Вид_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ КАК ВидАдреса,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Представление_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Представление_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Представление_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Представление_Дост
			|						ИНАЧЕ Данные.Представление_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ КАК ПредстАдреса,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле1_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле1_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле1_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле1_Дост
			|						ИНАЧЕ Данные.Поле1_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ КАК Поле1,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле2_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле2_Факт
		|				ИНАЧЕ ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле2_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле2_Дост
			|						ИНАЧЕ Данные.Поле2_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ КАК Поле2,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле3_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле3_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле3_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле3_Дост
			|						ИНАЧЕ Данные.Поле3_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ КАК Поле3,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле4_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле4_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле4_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле4_Дост
			|						ИНАЧЕ Данные.Поле4_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ КАК Поле4,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле5_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле5_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле5_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле5_Дост
			|						ИНАЧЕ Данные.Поле5_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ КАК Поле5,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле6_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле6_Факт
		|				ИНАЧЕ ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле6_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле6_Дост
			|						ИНАЧЕ Данные.Поле6_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ КАК Поле6,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле7_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле7_Факт
		|				ИНАЧЕ ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле7_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле7_Дост
			|						ИНАЧЕ Данные.Поле7_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ КАК Поле7,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле8_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле8_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле8_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле8_Дост
			|						ИНАЧЕ Данные.Поле8_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ КАК Поле8,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле9_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле9_Факт
		|				ИНАЧЕ ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле9_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле9_Дост
			|						ИНАЧЕ Данные.Поле9_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ КАК Поле9,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле10_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле10_Факт
		|				ИНАЧЕ ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле10_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле10_Дост
			|						ИНАЧЕ Данные.Поле10_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ КАК Поле10,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Комментарий_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Комментарий_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Комментарий_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Комментарий_Дост
			|						ИНАЧЕ Данные.Комментарий_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + " 
		|			КОНЕЦ
		|	КОНЕЦ КАК КомментАдреса
		|ИЗ
		|	Данные КАК Данные
		|
		|СГРУППИРОВАТЬ ПО
		|	Данные.Ссылка,
		|	Данные.Наименование,
		|	Данные.НаименованиеПолное,
		|	Данные.Код,
		|	Данные.КодПоЕДРПОУ,
		|	Данные.ЮрФизЛицо,
		|	Данные.ГоловнойКонтрагент,
		|	Данные.НеЯвляетсяРезидентом,";
		Если Компания = "GGU_trade" Тогда
			Запрос.Текст = Запрос.Текст + "
			|	Данные.Подразделение,";			
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|	ВЫБОР
		|		КОГДА Данные.ЮрФизЛицо = &ЮрЛицо
		|			ТОГДА ""ORGANISATION""
		|		ИНАЧЕ ""INDIVIDUAL""
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Вид_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Вид_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Вид_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Вид_Дост
			|						ИНАЧЕ Данные.Вид_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Представление_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Представление_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Представление_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Представление_Дост
			|						ИНАЧЕ Данные.Представление_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле1_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле1_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле1_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле1_Дост
			|						ИНАЧЕ Данные.Поле1_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле2_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле2_Факт
		|				ИНАЧЕ ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле2_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле2_Дост
			|						ИНАЧЕ Данные.Поле2_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле3_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле3_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле3_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле3_Дост
			|						ИНАЧЕ Данные.Поле3_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле4_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле4_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле4_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле4_Дост
			|						ИНАЧЕ Данные.Поле4_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле5_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле5_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле5_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле5_Дост
			|						ИНАЧЕ Данные.Поле5_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле6_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле6_Факт
		|				ИНАЧЕ ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле6_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле6_Дост
			|						ИНАЧЕ Данные.Поле6_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле7_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле7_Факт
		|				ИНАЧЕ ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле7_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле7_Дост
			|						ИНАЧЕ Данные.Поле7_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле8_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле8_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле8_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле8_Дост
			|						ИНАЧЕ Данные.Поле8_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле9_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле9_Факт
		|				ИНАЧЕ ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле9_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле9_Дост
			|						ИНАЧЕ Данные.Поле9_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Поле10_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Поле10_Факт
		|				ИНАЧЕ ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Поле10_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Поле10_Дост
			|						ИНАЧЕ Данные.Поле10_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + "
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Данные.Вид_Юр = &ЮрАдрес
		|			ТОГДА Данные.Комментарий_Юр
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Данные.Вид_Факт = &ФактАдрес
		|					ТОГДА Данные.Комментарий_Факт
		|				ИНАЧЕ";
		Если Компания = "AT" ИЛИ Компания = "Kolos" Тогда
			Запрос.Текст = Запрос.Текст + "
			|					Данные.Комментарий_Дост";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|					ВЫБОР
			|						КОГДА Данные.Вид_Дост = &ДостАдрес
			|							ТОГДА Данные.Комментарий_Дост
			|						ИНАЧЕ Данные.Комментарий_Англ
			|					КОНЕЦ";
		КонецЕсли;	
		Запрос.Текст = Запрос.Текст + " 
		|			КОНЕЦ
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЕДРПОУ";
		
		
		ПарамДатаС = НачалоДня(ДатаС);
		ПарамДатаПо = КонецДня(ДатаПо);
	
		Запрос.УстановитьПараметр("ДатаС",ПарамДатаС);
		Запрос.УстановитьПараметр("ДатаПо",ПарамДатаПо);
		Запрос.УстановитьПараметр("ДатаПоМинусМесяц", ДобавитьМесяц(ПарамДатаПо,-1));
		Запрос.УстановитьПараметр("ПереводНаДругойСчет", Соединение.Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет);
		Запрос.УстановитьПараметр("ПустКонтрагент", Соединение.Справочники.Контрагенты.ПустаяСсылка());
		Запрос.УстановитьПараметр("Организация", Соединение.Константы.ОсновнаяОрганизация.Получить());
		Запрос.УстановитьПараметр("Адрес", Соединение.Перечисления.ТипыКонтактнойИнформации.Адрес);
		Запрос.УстановитьПараметр("ЮрАдрес", Соединение.Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		Запрос.УстановитьПараметр("ФактАдрес", Соединение.Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
		Запрос.УстановитьПараметр("ЮрЛицо", Соединение.Перечисления.ЮрФизЛицо.ЮрЛицо);
		Если Компания = "GGU_trade" Тогда
			Запрос.УстановитьПараметр("ДостАдрес", Соединение.Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
			Запрос.УстановитьПараметр("АдресАнгл", Соединение.Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("000000034"));
			Запрос.УстановитьПараметр("Группа", Соединение.глЗначениеПеременной("КонтрагентыGroup"));
			Запрос.УстановитьПараметр("Статус", Соединение.глЗначениеПеременной("СтатусыКонтрагентыПодтвержденный"));
		ИначеЕсли Компания = "GGU_buh" Тогда
			Запрос.УстановитьПараметр("ДостАдрес", Соединение.Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("000000015"));
			Запрос.УстановитьПараметр("АдресАнгл", Соединение.Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("000000034"));
			Запрос.УстановитьПараметр("Группа", Соединение.Справочники.Контрагенты.НайтиПоКоду("000006882"));
			Запрос.УстановитьПараметр("АвансовыеОтчеты", Соединение.Справочники.Контрагенты.НайтиПоКоду("000000002"));
			Запрос.УстановитьПараметр("Статус", Соединение.Перечисления.СтатусКонтрагента.Подтвержденный);
			
			СпАдминПрочее = Соединение.NewObject("СписокЗначений");
			СпАдминПрочее.Добавить(Соединение.Перечисления.ТипДоговора.Административные);
			СпАдминПрочее.Добавить(Соединение.Перечисления.ТипДоговора.Прочие);
			Запрос.УстановитьПараметр("СпАдминПрочее", СпАдминПрочее);
		ИначеЕсли Компания = "Kolos" Тогда
			Запрос.УстановитьПараметр("Группа", Соединение.Справочники.Контрагенты.НайтиПоКоду("000001015"));
			Запрос.УстановитьПараметр("ГруппаСотрудники", Соединение.Справочники.Контрагенты.НайтиПоКоду("000001558"));
		ИначеЕсли Компания = "AT" Тогда
			Запрос.УстановитьПараметр("Группа", Соединение.Справочники.Контрагенты.КомпанииГруппы);
			Запрос.УстановитьПараметр("Статус", Соединение.Перечисления.СтатусКонтрагента.Подтвержденный);
		ИначеЕсли Компания = "OEK" Тогда
			Запрос.УстановитьПараметр("ДостАдрес", Соединение.Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
			Запрос.УстановитьПараметр("Группа", Соединение.Справочники.Контрагенты.НайтиПоКоду("000001235"));
			Запрос.УстановитьПараметр("Статус", Соединение.Перечисления.СтатусКонтрагента.Подтвержденный);
		Иначе	
			Запрос.УстановитьПараметр("ДостАдрес", Соединение.Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
			Запрос.УстановитьПараметр("Группа", Соединение.Справочники.Контрагенты.НайтиПоКоду("000000001"));
			Запрос.УстановитьПараметр("Статус", Соединение.Перечисления.СтатусыПроверки.Подтвержденный);
			Запрос.УстановитьПараметр("ПустСтрока", "");
		КонецЕсли;
	
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий()Цикл
			
			Код_ = Префикс + "_" + СокрЛП(Выборка.Код);
			ЕДРПОУ_ = СокрЛП(Выборка.ЕДРПОУ);
			ГоловнойКонтрагент_ = Выборка.ГоловнойКонтрагент;
			CustomerType_ = Выборка.CustomerType;
			Cust_status_ = Выборка.Cust_status;
			Область_ 	= СокрЛП(СтрЗаменить(Выборка.Поле2,","," "));
			Район_ 		= СокрЛП(СтрЗаменить(Выборка.Поле3,","," "));
			Улица_ 		= СокрЛП(СтрЗаменить(Выборка.Поле6,","," "));
			Дом_ 		= СокрЛП(СтрЗаменить(Выборка.Поле7,","," "));
			Корпус_ 	= СокрЛП(СтрЗаменить(Выборка.Поле8,","," "));
			Квартира_ 	= СокрЛП(СтрЗаменить(Выборка.Поле9,","," "));
			Город_ 		= СокрЛП(?(ЗначениеЗаполнено(Выборка.Поле5), СтрЗаменить(Выборка.Поле5,","," "), СтрЗаменить(Выборка.Поле4,","," ")));
			Name_ = "";
			Фамилия_ = "";
			Сокр_Национальность_ = "";
			Национальность_ = "";
			Дата_Рожд_ = "";
			Gender_ = "";
			
			Если Выборка.CustomerType = "INDIVIDUAL" Тогда
				
				ФИО = СокрЛП(Выборка.Name);
				ФИО = УбратьЛишнее(ФИО);
				МассивСтрок = СформироватьМассивСтрок(ФИО);
				КоличествоСтрок = МассивСтрок.Количество();
			
				Если КоличествоСтрок > 2 Тогда
					Фамилия  = МассивСтрок[КоличествоСтрок -3];
					Имя      = МассивСтрок[КоличествоСтрок -2];
					Отчество = МассивСтрок[КоличествоСтрок -1];
				ИначеЕсли КоличествоСтрок = 2 Тогда
					Фамилия  = МассивСтрок[КоличествоСтрок -2];
					Имя      = МассивСтрок[КоличествоСтрок -1];
					Отчество = "";
				Иначе
					Фамилия  = "";
					Имя      = СокрЛП(?(ЗначениеЗаполнено(Выборка.Name),Выборка.Name,Выборка.Наименование));
					Отчество = "";
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Отчество) Тогда
					Пол = УстановитьПол(Отчество);
				Иначе
					Пол = "";
				КонецЕсли; 
				Name_ = СокрЛП(?(ЗначениеЗаполнено(Имя),СокрЛП(Имя),"") + ?(ЗначениеЗаполнено(Отчество), " " + СокрЛП(Отчество),""));
				Фамилия_ = СокрЛП(Фамилия);
				Gender_ = Пол;
				Если Не Выборка.НеЯвляетсяРезидентом Тогда
					Сокр_Национальность_ = "UKR";
					Национальность_ = "Ukraine";
				КонецЕсли;	
			Иначе
				Name_ = Выборка.Name;
			КонецЕсли;
			
			Если Выборка.НеЯвляетсяРезидентом Тогда
				
				Сокр_Residency_ = "";
				Residency_ = СокрЛП(Выборка.Поле10);				
				
				Если Компания = "GGU_trade" Тогда
					СтранаНаименование = Выборка.Поле1;
					Если ЗначениеЗаполнено(СтранаНаименование) Тогда
						ТекСтрана = Соединение.Справочники.КлассификаторСтранМира.НайтиПоНаименованию(СтранаНаименование);
						Если Не ТекСтрана = Соединение.Справочники.КлассификаторСтранМира.ПустаяСсылка() Тогда
							Сокр_Residency_ = СокрЛП(ТекСтрана.Код);
							Residency_ = СокрЛП(ТекСтрана.НаименованиеАнгл);
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли Компания = "GGU_buh" Тогда
					СтранаНаименование = Выборка.Поле10;
					Если ЗначениеЗаполнено(СтранаНаименование) Тогда
						ТекСтрана = Соединение.Справочники.КлассификаторСтранМира.НайтиПоНаименованию(СтранаНаименование);
						Если Не ТекСтрана = Соединение.Справочники.КлассификаторСтранМира.ПустаяСсылка() Тогда
							Сокр_Residency_ = СокрЛП(ТекСтрана.Код);
							Residency_ = СокрЛП(ТекСтрана.Наименование);
						КонецЕсли;
					КонецЕсли;

				КонецЕсли;
				
			Иначе
				Сокр_Residency_ = "UKR";
				Residency_ = "Ukraine";
			КонецЕсли;	
			
			//Теперь поработаем с адресом
			Если ЗначениеЗаполнено(Выборка.Поле1) Тогда
				//Заполнен либо индекс либо страна
				Если локЕстьНеЦифрыВСтроке(СокрЛП(Выборка.Поле1)) Тогда
					ПочтКод_ = "";
				Иначе	
					ПочтКод_ = СокрЛП(Выборка.Поле1);
				КонецЕсли;
			Иначе
				//Индекс пустой - все равно, что выводить.
				ПочтКод_ = "";
			КонецЕсли;
			
			Если Компания = "GGU_buh" Тогда
				НовСтрока = ТаблБух.Добавить();
				НовСтрока.Name 				= Name_;
				НовСтрока.Код 				= Код_;
				НовСтрока.ЕДРПОУ 			= ЕДРПОУ_;
				НовСтрока.ГоловнойКонтрагент = ГоловнойКонтрагент_;
				НовСтрока.Фамилия 			= Фамилия_;
				НовСтрока.CustomerType 		= CustomerType_;
				НовСтрока.Область 			= Область_;
				НовСтрока.Район 			= Район_;
				НовСтрока.Улица 			= Улица_;
				НовСтрока.Дом 				= Дом_;
				НовСтрока.Корпус 			= Корпус_;
				НовСтрока.Квартира			= Квартира_;
				НовСтрока.Город 			= Город_;
				НовСтрока.ПочтКод 			= ПочтКод_;
				НовСтрока.Сокр_Национальность = Сокр_Национальность_;
				НовСтрока.Национальность 	= Национальность_;
				НовСтрока.Сокр_Residency 	= Сокр_Residency_;
				НовСтрока.Residency 		= Residency_;
				НовСтрока.Дата_Рожд 		= Дата_Рожд_;
				НовСтрока.Gender 			= Gender_;
				НовСтрока.Cust_status 		= Cust_status_;
				
			ИначеЕсли Компания = "GGU_trade" Тогда
				НовСтрока = ТаблТрейд.Добавить();
				НовСтрока.Name 				= Name_;
				НовСтрока.Код 				= Код_;
				НовСтрока.ЕДРПОУ 			= ЕДРПОУ_;
				НовСтрока.ГоловнойКонтрагент = ГоловнойКонтрагент_;
				НовСтрока.Фамилия 			= Фамилия_;
				НовСтрока.CustomerType 		= CustomerType_;
				НовСтрока.Область 			= Область_;
				НовСтрока.Район 			= Район_;
				НовСтрока.Улица 			= Улица_;
				НовСтрока.Дом 				= Дом_;
				НовСтрока.Корпус 			= Корпус_;
				НовСтрока.Квартира			= Квартира_;
				НовСтрока.Город 			= Город_;
				НовСтрока.ПочтКод 			= ПочтКод_;
				НовСтрока.Сокр_Национальность = Сокр_Национальность_;
				НовСтрока.Национальность 	= Национальность_;
				НовСтрока.Сокр_Residency 	= Сокр_Residency_;
				НовСтрока.Residency 		= Residency_;
				НовСтрока.Дата_Рожд 		= Дата_Рожд_;
				НовСтрока.Gender 			= Gender_;
				НовСтрока.Cust_status 		= Cust_status_;
				НовСтрока.Подразделение		= Выборка.Подразделение;
			Иначе
				
				Если ВТаблицу Тогда
					ОбластьСтрока.Параметры.Name = Name_;
					ОбластьСтрока.Параметры.Код = Код_;
					ОбластьСтрока.Параметры.ЕДРПОУ = ЕДРПОУ_;
					ОбластьСтрока.Параметры.ГоловнойКонтрагент = ГоловнойКонтрагент_;
					ОбластьСтрока.Параметры.Фамилия = Фамилия_;
					ОбластьСтрока.Параметры.CustomerType = CustomerType_;
					ОбластьСтрока.Параметры.Область = Область_;
					ОбластьСтрока.Параметры.Район 	= Район_;
					ОбластьСтрока.Параметры.Улица 	= Улица_;
					ОбластьСтрока.Параметры.Дом 	= Дом_;
					ОбластьСтрока.Параметры.Корпус 	= Корпус_;
					ОбластьСтрока.Параметры.Квартира= Квартира_;
					ОбластьСтрока.Параметры.Город 	= Город_;
					ОбластьСтрока.Параметры.ПочтКод = ПочтКод_;
					ОбластьСтрока.Параметры.Сокр_Национальность = Сокр_Национальность_;
					ОбластьСтрока.Параметры.Национальность = Национальность_;
					ОбластьСтрока.Параметры.Сокр_Residency = Сокр_Residency_;
					ОбластьСтрока.Параметры.Residency = Residency_;
					ОбластьСтрока.Параметры.Дата_Рожд = Дата_Рожд_;
					ОбластьСтрока.Параметры.Gender = Gender_;
					ОбластьСтрока.Параметры.NONSTANDARD  = "NONSTANDARD";
					ОбластьСтрока.Параметры.Cust_status = Cust_status_;
					
					ТабДок.Вывести(ОбластьСтрока);
				КонецЕсли;
				
				Если ВФайл Тогда
					ЗпТекста.ЗаписатьСтроку(Name_ 				+ Символы.Таб +
				    	                    Код_ 				+ Символы.Таб +
				        	                ЕДРПОУ_ 			+ Символы.Таб +
				            	            ГоловнойКонтрагент_ + Символы.Таб +
				                	        "" 					+ Символы.Таб +
				                    	    "" 					+ Символы.Таб +
				                        	"" 					+ Символы.Таб +
					                        "" 					+ Символы.Таб +
					                        ""		 			+ Символы.Таб +
					                        "" 					+ Символы.Таб +
					                        Фамилия_ 			+ Символы.Таб +
				    	                    CustomerType_ 		+ Символы.Таб +
					                        Квартира_ 			+ Символы.Таб +
				                        	Корпус_ 			+ Символы.Таб +
				                    	    Дом_ 				+ Символы.Таб +
				                	        Улица_ 				+ Символы.Таб +
					                        Город_ 				+ Символы.Таб +
				            	            Район_ 				+ Символы.Таб +
				        	                Область_ 			+ Символы.Таб +
					                        ПочтКод_ 			+ Символы.Таб +
					                        Сокр_Национальность_+ Символы.Таб +
				    	                    Национальность_ 	+ Символы.Таб +
				        	                Сокр_Residency_ 	+ Символы.Таб +
				            	            Residency_ 			+ Символы.Таб +
				                	        Дата_Рожд_ 			+ Символы.Таб +
				                    	    Gender_ 			+ Символы.Таб +
				                        	"NONSTANDARD" 		+ Символы.Таб +
					                        "NONSTANDARD" 		+ Символы.Таб +
					                        "" 					+ Символы.Таб +
					                        Cust_status_ );
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		
		Соединение = Null;
		БазаКом = Null;
		Запрос = Null;
		Выборка = Null;
		
		Если Компания = "GGU_buh" Или Компания = "GGU_trade" Тогда
			Продолжить;
		Иначе
			Если ВФайл Тогда
				ЗпТекста.Закрыть();
			КонецЕсли;
		
			Если ВТаблицу Тогда
				ТабДок.ТолькоПросмотр = Истина;
				ТабДок.ФиксацияСверху = 1;
				ТабДок.Показать(Компания);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	//Теперь попробуем объединить две таблицы Бух и Трейд
	
	ЗапросОбъединение = Новый Запрос;
	ЗапросОбъединение.УстановитьПараметр("ТаблБух", ТаблБух);
	ЗапросОбъединение.УстановитьПараметр("ТаблТрейд", ТаблТрейд);
	//ЗапросОбъединение.УстановитьПараметр("ПустСтрока", "");
	//ЗапросОбъединение.УстановитьПараметр("Пробел", " ");
	ЗапросОбъединение.Текст = 
	"ВЫБРАТЬ
	|	ТаблБух.Name,
	|	ТаблБух.Код,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблБух.ЕДРПОУ, """") = """"
	|			ТОГДА "" ""
	|		ИНАЧЕ ТаблБух.ЕДРПОУ
	|	КОНЕЦ КАК ЕДРПОУ,
	|	ТаблБух.ГоловнойКонтрагент,
	|	ТаблБух.Фамилия,
	|	ТаблБух.CustomerType,
	|	ТаблБух.Область,
	|	ТаблБух.Район,
	|	ТаблБух.Улица,
	|	ТаблБух.Дом,
	|	ТаблБух.Корпус,
	|	ТаблБух.Квартира,
	|	ТаблБух.Город,
	|	ТаблБух.ПочтКод,
	|	ТаблБух.Сокр_Национальность,
	|	ТаблБух.Национальность,
	|	ТаблБух.Сокр_Residency,
	|	ТаблБух.Residency,
	|	ТаблБух.Дата_Рожд,
	|	ТаблБух.Gender,
	|	ТаблБух.Cust_status
	|ПОМЕСТИТЬ ТаблБух
	|ИЗ
	|	&ТаблБух КАК ТаблБух
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблТрейд.Name,
	|	ТаблТрейд.Код,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.ЕДРПОУ, """") = """"
	|			ТОГДА "" ""
	|		ИНАЧЕ ТаблТрейд.ЕДРПОУ
	|	КОНЕЦ КАК ЕДРПОУ,
	|	ТаблТрейд.ГоловнойКонтрагент,
	|	ТаблТрейд.Фамилия,
	|	ТаблТрейд.CustomerType,
	|	ТаблТрейд.Область,
	|	ТаблТрейд.Район,
	|	ТаблТрейд.Улица,
	|	ТаблТрейд.Дом,
	|	ТаблТрейд.Корпус,
	|	ТаблТрейд.Квартира,
	|	ТаблТрейд.Город,
	|	ТаблТрейд.ПочтКод,
	|	ТаблТрейд.Сокр_Национальность,
	|	ТаблТрейд.Национальность,
	|	ТаблТрейд.Сокр_Residency,
	|	ТаблТрейд.Residency,
	|	ТаблТрейд.Дата_Рожд,
	|	ТаблТрейд.Gender,
	|	ТаблТрейд.Cust_status,
	|	ТаблТрейд.Подразделение
	|ПОМЕСТИТЬ ТаблТрейд
	|ИЗ
	|	&ТаблТрейд КАК ТаблТрейд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Name, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Name, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Name, """")
	|	КОНЕЦ КАК Name,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Код, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Код, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Код, """")
	|	КОНЕЦ КАК Код,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.ЕДРПОУ, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.ЕДРПОУ, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.ЕДРПОУ, """")
	|	КОНЕЦ КАК ЕДРПОУ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.ГоловнойКонтрагент, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.ГоловнойКонтрагент, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.ГоловнойКонтрагент, """")
	|	КОНЕЦ КАК ГоловнойКонтрагент,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Фамилия, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Фамилия, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Фамилия, """")
	|	КОНЕЦ КАК Фамилия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.CustomerType, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.CustomerType, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.CustomerType, """")
	|	КОНЕЦ КАК CustomerType,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Область, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Область, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Область, """")
	|	КОНЕЦ КАК Область,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Район, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Район, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Район, """")
	|	КОНЕЦ КАК Район,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Улица, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Улица, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Улица, """")
	|	КОНЕЦ КАК Улица,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Дом, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Дом, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Дом, """")
	|	КОНЕЦ КАК Дом,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Корпус, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Корпус, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Корпус, """")
	|	КОНЕЦ КАК Корпус,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Квартира, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Квартира, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Квартира, """")
	|	КОНЕЦ КАК Квартира,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Город, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Город, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Город, """")
	|	КОНЕЦ КАК Город,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.ПочтКод, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.ПочтКод, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.ПочтКод, """")
	|	КОНЕЦ КАК ПочтКод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Сокр_Национальность, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Сокр_Национальность, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Сокр_Национальность, """")
	|	КОНЕЦ КАК Сокр_Национальность,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Национальность, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Национальность, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Национальность, """")
	|	КОНЕЦ КАК Национальность,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Сокр_Residency, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Сокр_Residency, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Сокр_Residency, """")
	|	КОНЕЦ КАК Сокр_Residency,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Residency, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Residency, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Residency, """")
	|	КОНЕЦ КАК Residency,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Дата_Рожд, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Дата_Рожд, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Дата_Рожд, """")
	|	КОНЕЦ КАК Дата_Рожд,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Gender, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Gender, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Gender, """")
	|	КОНЕЦ КАК Gender,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Cust_status, """") = """"
	|			ТОГДА ЕСТЬNULL(ТаблБух.Cust_status, """")
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Cust_status, """")
	|	КОНЕЦ КАК Cust_status,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблТрейд.Подразделение, """") = """"
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(ТаблТрейд.Подразделение, """")
	|	КОНЕЦ КАК Подразделение
	|ПОМЕСТИТЬ ОбщиеКонтрагенты
	|ИЗ
	|	ТаблТрейд КАК ТаблТрейд
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблБух КАК ТаблБух
	|		ПО ТаблТрейд.ЕДРПОУ = ТаблБух.ЕДРПОУ
	|ГДЕ
	|	НЕ ЕСТЬNULL(ТаблТрейд.ЕДРПОУ, """") = """"
	|	И НЕ ЕСТЬNULL(ТаблБух.ЕДРПОУ, """") = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблТрейд.Name,
	|	ТаблТрейд.Код,
	|	ТаблТрейд.ЕДРПОУ,
	|	ТаблТрейд.ГоловнойКонтрагент,
	|	ТаблТрейд.Фамилия,
	|	ТаблТрейд.CustomerType,
	|	ТаблТрейд.Область,
	|	ТаблТрейд.Район,
	|	ТаблТрейд.Улица,
	|	ТаблТрейд.Дом,
	|	ТаблТрейд.Корпус,
	|	ТаблТрейд.Квартира,
	|	ТаблТрейд.Город,
	|	ТаблТрейд.ПочтКод,
	|	ТаблТрейд.Сокр_Национальность,
	|	ТаблТрейд.Национальность,
	|	ТаблТрейд.Сокр_Residency,
	|	ТаблТрейд.Residency,
	|	ТаблТрейд.Дата_Рожд,
	|	ТаблТрейд.Gender,
	|	ТаблТрейд.Cust_status,
	|	ТаблТрейд.Подразделение
	|ПОМЕСТИТЬ ТолькоТрейд
	|ИЗ
	|	ТаблТрейд КАК ТаблТрейд
	|ГДЕ
	|	НЕ ТаблТрейд.ЕДРПОУ В
	|				(ВЫБРАТЬ
	|					ОбщиеКонтрагенты.ЕДРПОУ
	|				ИЗ
	|					ОбщиеКонтрагенты КАК ОбщиеКонтрагенты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблБух.Name,
	|	ТаблБух.Код,
	|	ТаблБух.ЕДРПОУ,
	|	ТаблБух.ГоловнойКонтрагент,
	|	ТаблБух.Фамилия,
	|	ТаблБух.CustomerType,
	|	ТаблБух.Область,
	|	ТаблБух.Район,
	|	ТаблБух.Улица,
	|	ТаблБух.Дом,
	|	ТаблБух.Корпус,
	|	ТаблБух.Квартира,
	|	ТаблБух.Город,
	|	ТаблБух.ПочтКод,
	|	ТаблБух.Сокр_Национальность,
	|	ТаблБух.Национальность,
	|	ТаблБух.Сокр_Residency,
	|	ТаблБух.Residency,
	|	ТаблБух.Дата_Рожд,
	|	ТаблБух.Gender,
	|	ТаблБух.Cust_status
	|ПОМЕСТИТЬ ТолькоБух
	|ИЗ
	|	ТаблБух КАК ТаблБух
	|ГДЕ
	|	НЕ ТаблБух.ЕДРПОУ В
	|				(ВЫБРАТЬ
	|					ОбщиеКонтрагенты.ЕДРПОУ
	|				ИЗ
	|					ОбщиеКонтрагенты КАК ОбщиеКонтрагенты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщиеКонтрагенты.Name,
	|	ОбщиеКонтрагенты.Код,
	|	ОбщиеКонтрагенты.ЕДРПОУ,
	|	ОбщиеКонтрагенты.ГоловнойКонтрагент,
	|	ОбщиеКонтрагенты.Фамилия,
	|	ОбщиеКонтрагенты.CustomerType,
	|	ОбщиеКонтрагенты.Область,
	|	ОбщиеКонтрагенты.Район,
	|	ОбщиеКонтрагенты.Улица,
	|	ОбщиеКонтрагенты.Дом,
	|	ОбщиеКонтрагенты.Корпус,
	|	ОбщиеКонтрагенты.Квартира,
	|	ОбщиеКонтрагенты.Город,
	|	ОбщиеКонтрагенты.ПочтКод,
	|	ОбщиеКонтрагенты.Сокр_Национальность,
	|	ОбщиеКонтрагенты.Национальность,
	|	ОбщиеКонтрагенты.Сокр_Residency,
	|	ОбщиеКонтрагенты.Residency,
	|	ОбщиеКонтрагенты.Дата_Рожд,
	|	ОбщиеКонтрагенты.Gender,
	|	ОбщиеКонтрагенты.Cust_status,
	|	ОбщиеКонтрагенты.Подразделение,
	|	""Общие"" КАК Признак
	|ИЗ
	|	ОбщиеКонтрагенты КАК ОбщиеКонтрагенты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТолькоТрейд.Name,
	|	ТолькоТрейд.Код,
	|	ТолькоТрейд.ЕДРПОУ,
	|	ТолькоТрейд.ГоловнойКонтрагент,
	|	ТолькоТрейд.Фамилия,
	|	ТолькоТрейд.CustomerType,
	|	ТолькоТрейд.Область,
	|	ТолькоТрейд.Район,
	|	ТолькоТрейд.Улица,
	|	ТолькоТрейд.Дом,
	|	ТолькоТрейд.Корпус,
	|	ТолькоТрейд.Квартира,
	|	ТолькоТрейд.Город,
	|	ТолькоТрейд.ПочтКод,
	|	ТолькоТрейд.Сокр_Национальность,
	|	ТолькоТрейд.Национальность,
	|	ТолькоТрейд.Сокр_Residency,
	|	ТолькоТрейд.Residency,
	|	ТолькоТрейд.Дата_Рожд,
	|	ТолькоТрейд.Gender,
	|	ТолькоТрейд.Cust_status,
	|	ТолькоТрейд.Подразделение,
	|	""Только трейд""
	|ИЗ
	|	ТолькоТрейд КАК ТолькоТрейд
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТолькоБух.Name,
	|	ТолькоБух.Код,
	|	ТолькоБух.ЕДРПОУ,
	|	ТолькоБух.ГоловнойКонтрагент,
	|	ТолькоБух.Фамилия,
	|	ТолькоБух.CustomerType,
	|	ТолькоБух.Область,
	|	ТолькоБух.Район,
	|	ТолькоБух.Улица,
	|	ТолькоБух.Дом,
	|	ТолькоБух.Корпус,
	|	ТолькоБух.Квартира,
	|	ТолькоБух.Город,
	|	ТолькоБух.ПочтКод,
	|	ТолькоБух.Сокр_Национальность,
	|	ТолькоБух.Национальность,
	|	ТолькоБух.Сокр_Residency,
	|	ТолькоБух.Residency,
	|	ТолькоБух.Дата_Рожд,
	|	ТолькоБух.Gender,
	|	ТолькоБух.Cust_status,
	|	"""",
	|	""Только бухгалтерия""
	|ИЗ
	|	ТолькоБух КАК ТолькоБух";
				
	Выборка = ЗапросОбъединение.Выполнить().Выбрать();
	
	Если ВТаблицу Тогда
		ТабДок = Новый ТабличныйДокумент;
		
		Макет = ПолучитьМакет("Отчет");
		ОбластьНачало = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		
		ТабДок.Вывести(ОбластьНачало);
		
	КонецЕсли;
	
	Если ВФайл Тогда
		ИмяФайла = "Combined_" + Формат(Год(ТекущаяДата()),"ЧГ=") + Формат(Месяц(ТекущаяДата()),"ЧЦ=2; ЧВН=") + Формат(День(ТекущаяДата()),"ЧЦ=2; ЧВН=") + "_" + "GAU" + ".txt";
		Если Прав(ВыбКаталог,1) = "\" Тогда
			ЗпТекста = Новый ЗаписьТекста(ВыбКаталог + ИмяФайла, КодировкаТекста.UTF8);
		Иначе
			ЗпТекста = Новый ЗаписьТекста(ВыбКаталог + "\" + ИмяФайла, КодировкаТекста.UTF8);
		КонецЕсли;	
		//ЗпТекста.ЗаписатьСтроку("First Name" 		+ Символы.Таб +
		//"Unique Code" 		+ Символы.Таб +
		//"Optional Column 1" + Символы.Таб +
		//"Optional Column 2" + Символы.Таб +
		//"Optional Column 3" + Символы.Таб +
		//"Optional Column 4" + Символы.Таб +
		//"Optional Column 5" + Символы.Таб +
		//"Optional Column 6" + Символы.Таб +
		//"Optional Column 7" + Символы.Таб +
		//"Optional Column 8" + Символы.Таб +
		//"Last name" 		+ Символы.Таб +
		//"Customer Type" 	+ Символы.Таб +
		//"Address field 13" 	+ Символы.Таб +
		//"Address field 14" 	+ Символы.Таб +
		//"Address field 15" 	+ Символы.Таб +
		//"Address field 16" 	+ Символы.Таб +
		//"Address field 17" 	+ Символы.Таб +
		//"Address field 18" 	+ Символы.Таб +
		//"Address field 19" 	+ Символы.Таб +
		//"Post Code" 		+ Символы.Таб +
		//"Nationality" 		+ Символы.Таб +
		//"Nat Name" 			+ Символы.Таб +
		//"Residency" 		+ Символы.Таб +
		//"Residency Name" 	+ Символы.Таб +
		//"DOB" 				+ Символы.Таб +
		//"Gender" 			+ Символы.Таб +
		//"Feed Source Name" 	+ Символы.Таб +
		//"Feed Source Key" 	+ Символы.Таб +
		//"Risk Score" 		+ Символы.Таб +
		//"Cust status" );
		
	КонецЕсли;	               
	
	
	Пока Выборка.Следующий() Цикл
		Если ВФайл Тогда
			ЗпТекста.ЗаписатьСтроку(Выборка.Name 				+ Символы.Таб +
				    	            Выборка.Код 				+ Символы.Таб +
				        	        Выборка.ЕДРПОУ 				+ Символы.Таб +
				            	    Выборка.ГоловнойКонтрагент 	+ Символы.Таб +
				                	"" 							+ Символы.Таб +
				                    "" 							+ Символы.Таб +
				                    "" 							+ Символы.Таб +
					                "" 							+ Символы.Таб +
					                ""		 					+ Символы.Таб +
					                "" 							+ Символы.Таб +
					                Выборка.Фамилия 			+ Символы.Таб +
				    	            Выборка.CustomerType 		+ Символы.Таб +
					                Выборка.Квартира 			+ Символы.Таб +
				                    Выборка.Корпус 				+ Символы.Таб +
				                    Выборка.Дом 				+ Символы.Таб +
				                	Выборка.Улица 				+ Символы.Таб +
					                Выборка.Город 				+ Символы.Таб +
				            	    Выборка.Район 				+ Символы.Таб +
				        	        Выборка.Область 			+ Символы.Таб +
					                Выборка.ПочтКод 			+ Символы.Таб +
					                Выборка.Сокр_Национальность	+ Символы.Таб +
				    	            Выборка.Национальность 		+ Символы.Таб +
				        	        Выборка.Сокр_Residency 		+ Символы.Таб +
				            	    Выборка.Residency 			+ Символы.Таб +
				                	Выборка.Дата_Рожд 			+ Символы.Таб +
				                    Выборка.Gender 				+ Символы.Таб +
				                    "NONSTANDARD" 				+ Символы.Таб +
					                "NONSTANDARD" 				+ Символы.Таб +
					                "" 							+ Символы.Таб +
					                Выборка.Cust_status );
		КонецЕсли;
		
		Если ВТаблицу Тогда
			ОбластьСтрока.Параметры.Name 			= Выборка.Name;
			ОбластьСтрока.Параметры.Код 			= Выборка.Код;
			ОбластьСтрока.Параметры.ЕДРПОУ 			= Выборка.ЕДРПОУ;
			ОбластьСтрока.Параметры.ГоловнойКонтрагент = Выборка.ГоловнойКонтрагент;
			ОбластьСтрока.Параметры.Фамилия 		= Выборка.Фамилия;
			ОбластьСтрока.Параметры.CustomerType 	= Выборка.CustomerType;
			ОбластьСтрока.Параметры.Область 		= Выборка.Область;
			ОбластьСтрока.Параметры.Район 			= Выборка.Район;
			ОбластьСтрока.Параметры.Улица 			= Выборка.Улица;
			ОбластьСтрока.Параметры.Дом 			= Выборка.Дом;
			ОбластьСтрока.Параметры.Корпус 			= Выборка.Корпус;
			ОбластьСтрока.Параметры.Квартира		= Выборка.Квартира;
			ОбластьСтрока.Параметры.Город 			= Выборка.Город;
			ОбластьСтрока.Параметры.ПочтКод 		= Выборка.ПочтКод;
			ОбластьСтрока.Параметры.Сокр_Национальность = Выборка.Сокр_Национальность;
			ОбластьСтрока.Параметры.Национальность 	= Выборка.Национальность;
			ОбластьСтрока.Параметры.Сокр_Residency 	= Выборка.Сокр_Residency;
			ОбластьСтрока.Параметры.Residency 		= Выборка.Residency;
			ОбластьСтрока.Параметры.Дата_Рожд 		= Выборка.Дата_Рожд;
			ОбластьСтрока.Параметры.Gender 			= Выборка.Gender;
			ОбластьСтрока.Параметры.NONSTANDARD		= "NONSTANDARD";
			ОбластьСтрока.Параметры.Cust_status 	= Выборка.Cust_status;
			ОбластьСтрока.Параметры.Подразделение 	= Выборка.Подразделение;
			
			ТабДок.Вывести(ОбластьСтрока);
			
			Если Выборка.Признак = "Только трейд" Тогда
				Сообщить("Контрагент подтвержден/существует только в трейде: ЕДРПОУ " + Выборка.ЕДРПОУ + ",  код " + Выборка.Код + ",  " + СокрЛП(Выборка.Фамилия + " " + Выборка.Name));
			ИначеЕсли Выборка.Признак = "Только бухгалтерия" Тогда
				Сообщить("Контрагент подтвержден/существует только в бухгалтерии: ЕДРПОУ " + Выборка.ЕДРПОУ + ",  код " + Выборка.Код + ",  " + СокрЛП(Выборка.Фамилия + " " + Выборка.Name));
			КонецЕсли;	
		КонецЕсли;
		
		
	КонецЦикла;	
	
	Если ВФайл Тогда
		ЗпТекста.Закрыть();
	КонецЕсли;
			
	Если ВТаблицу Тогда
		ТабДок.ТолькоПросмотр = Истина;
		ТабДок.ФиксацияСверху = 1;
		ТабДок.Показать("GAU");
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьТаблицуИзМакета()
	
	МакетПараметров =  ПолучитьМакет("Макет");
	// ВысотаМакета = 3;
	ВысотаМакета = МакетПараметров.ВысотаТаблицы;
	//ШиринаМакета = МакетПараметров.ШиринаТаблицы;
	ШиринаМакета = 4;
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	Для Ширина_ = 1 По ШиринаМакета Цикл
		НайденнаяОбласть = МакетПараметров.ПолучитьОбласть("R1" + "C"+ Ширина_);
		ТаблицаЗначений.Колонки.Добавить(НайденнаяОбласть.ТекущаяОбласть.Текст, Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	КонецЦикла;
	
	Для Счетчик = 2 По ВысотаМакета Цикл
		ТаблицаЗначений.Добавить();
	КонецЦикла;
	
	Для Высота_ = 2 По ВысотаМакета Цикл
		Для Ширина_ = 1 По ШиринаМакета Цикл
			НайденнаяОбласть = МакетПараметров.ПолучитьОбласть("R" + Высота_ + "C"+ Ширина_);
			ТаблицаЗначений[Высота_ - 2][Ширина_ - 1] = НайденнаяОбласть.ТекущаяОбласть.Текст;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаЗначений;
	
КонецФункции

Функция ИнициироватьТаблицуЗначений()
	
	//Массив = Новый Массив;
	//Массив.Добавить(Тип("Строка"));
	ТипСтрока = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(250));
	
	ТаблЗнач = Новый ТаблицаЗначений;
	ТаблЗнач.Колонки.Добавить("Name", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Код", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("ЕДРПОУ", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("ГоловнойКонтрагент", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Фамилия", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("CustomerType", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Область", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Район", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Улица", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Дом", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Корпус", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Квартира", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Город", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("ПочтКод", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Сокр_Национальность", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Национальность", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Сокр_Residency", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Residency", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Дата_Рожд", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Gender", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Cust_status", ТипСтрока);
	ТаблЗнач.Колонки.Добавить("Подразделение", ТипСтрока);
	
	Возврат ТаблЗнач;
	
КонецФункции;	
