
Функция GetHTTP(прХост, прФайл = 0)
	лпФайл = 0;
	Попытка  
		Состояние("Получение информации..: " + прХост); 
		
		лпКаталог = КаталогВременныхФайлов();
		лпФайл = лпКаталог + "site.dmp";
		Если прФайл <> 0 Тогда
			лпФайл = прФайл;
		КонецЕсли;	
           
		WinHttp = Новый COMObject("WinHttp.WinHttpRequest.5.1");  
		WinHttp.Open("GET", прХост, 0);
		WinHttp.setRequestHeader("Content-Type","application/x-www-form-urlencoded"); 
		WinHttp.Send();
		Состояние("! Получено:..." + прХост);
		лпТекст = Новый ТекстовыйДокумент;
		лпТекст.ДобавитьСтроку(СокрЛП(WinHttp.ResponseText()));
		лпТекст.Записать(лпФайл);
		Возврат лпФайл;
	Исключение 
		Сообщить("Ошибка получения информации: " + прХост);
	КонецПопытки;
	Возврат лпФайл;
КонецФункции


Функция ПолучитьДатуИзНормальногоФормата(ДатаВОбычномФормате, Параметр = 0) // Павлышин Саша
	Попытка
		Если Параметр = 0 Тогда
			ДатаВ1СФормате = Дата(Прав(ДатаВОбычномФормате, 4), Сред(ДатаВОбычномФормате, 4, 2), Лев(ДатаВОбычномФормате, 2));
		ИначеЕсли Параметр = 1 Тогда
			ДатаВ1СФормате = Дата("20"+Прав(ДатаВОбычномФормате, 2), Сред(ДатаВОбычномФормате, 4, 2), Лев(ДатаВОбычномФормате, 2));
		КонецЕсли;
		Возврат ДатаВ1СФормате;
	Исключение
		Сообщить("При получении даты из ["+ДатаВОбычномФормате+"] произошла ошибка. Дата в неверном формате!", СтатусСообщения.Важное);
		Возврат ЛОжь;
	КонецПопытки;	
КонецФункции


Функция ДобавитьДень(прДата, прКолДней)
	лпВозв = прДата;
	Если прКолДней = 0 Тогда
		Возврат лпВозв;
	КонецЕсли;
	лпКолДнейДобавить = прКолДней * 24 * 60 * 60; 
	Возврат прДата + лпКолДнейДобавить;
КонецФункции









/////// НБУ



Функция ПолучитьТаблицуКурсов(прТекст, прКодВалюты = "")
	лпКодВалюты = СокрЛП(прКодВалюты);
	
	лпТаблВозврат = Новый ТаблицаЗначений;
	лпТаблВозврат.Колонки.Добавить("КодВалюты", 	Новый ОписаниеТипов("Строка"), "Код валюты", 6);
	лпТаблВозврат.Колонки.Добавить("Условно", 		Новый ОписаниеТипов("Строка"), "Условно", 4);
	лпТаблВозврат.Колонки.Добавить("Кратность", 	Новый ОписаниеТипов("Число"), "Кратность", 5);
	лпТаблВозврат.Колонки.Добавить("Курс", 			Новый ОписаниеТипов("Число"), "Курс", 12);
	лпТаблВозврат.Колонки.Добавить("СтрокаВалюта", 	Новый ОписаниеТипов("Строка"), "Наименование", 20);

	лпСтрокаПоискаНачало = "<td class=""cell_c"">";
	лпСтрокаПоискаАббр = "<td class=""cell"">";
	лпСтрокаПоискаКонец = "</td>"; 
	лпСтрокаПоискВалюта = лпСтрокаПоискаНачало;
	Если НЕ ЗначениеЗаполнено(лпКодВалюты) = 0 Тогда
		лпСтрокаПоискВалюта = лпСтрокаПоискаНачало + лпКодВалюты + лпСтрокаПоискаКонец;
	КонецЕсли;	
	
	лпРазмер = прТекст.КоличествоСтрок();
	Если лпРазмер = 0 Тогда
		Возврат лпТаблВозврат;
	КонецЕсли; 

	лпТекст = прТекст;

	лпСчСтрок = 0;
	Для лпИндекс = 1 По лпРазмер Цикл
		лпСчСтрок = лпСчСтрок + 1;
		лпСтрока = СокрЛП(лпТекст.ПолучитьСтроку(лпСчСтрок));	

		лпСтрокаНачало = Найти(СокрЛП(лпСтрока), лпСтрокаПоискВалюта);
		Если лпСтрокаНачало = 0 Тогда
			Продолжить;
		КонецЕсли;   
		
		лпНоваяСтрока = лпТаблВозврат.Добавить();
		Для лпСч = 0 По 5 Цикл 
			
			лпСтрока = СокрЛП(прТекст.ПолучитьСтроку(лпСчСтрок));
			лпСтрока = СтрЗаменить(лпСтрока, лпСтрокаПоискаНачало, "");
			лпСтрока = СтрЗаменить(лпСтрока, лпСтрокаПоискаКонец, "");
			лпСтрока = СтрЗаменить(лпСтрока, лпСтрокаПоискаАббр, ""); 
			лпСчСтрок = лпСчСтрок + 1;
			Если НЕ ЗначениеЗаполнено(лпСтрока) = 1 Тогда
				Продолжить;
			КонецЕсли;
			
			Если лпСч = 0 Тогда
				лпНоваяСтрока.КодВалюты = СокрЛП(лпСтрока);
			ИначеЕсли лпСч = 1 Тогда	
				лпНоваяСтрока.Условно = СокрЛП(лпСтрока);
			ИначеЕсли лпСч = 2 Тогда	
				лпНоваяСтрока.Кратность = Число(СокрЛП(лпСтрока));
			ИначеЕсли лпСч = 3 Тогда	
				лпНоваяСтрока.СтрокаВалюта = СокрЛП(лпСтрока);
			ИначеЕсли лпСч = 4 Тогда	
				Продолжить;
			ИначеЕсли лпСч = 5 Тогда	
				лпНоваяСтрока.Курс = Число(СокрЛП(лпСтрока));
			КонецЕсли;
			
		КонецЦикла; 
	КонецЦикла;
	Возврат лпТаблВозврат;
КонецФункции


Функция ДатьКурсыЗаДень(прДата, прКодВалюты = "")  
	лпТаблВозврат = Новый ТаблицаЗначений;
	лпДата = Формат(прДата, "ДЛФ=Д");  
	лпСсылка = "http://www.bank.gov.ua/control/uk/curmetal/currency/search?formType=searchFormDate&time_step=daily&date=" + лпДата + "&execute=%D0%92%D0%B8%D0%BA%D0%BE%D0%BD%D0%B0%D1%82%D0%B8";
	лпФайл = GetHTTP(лпСсылка, 0);
	
	лпТекст = Новый ТекстовыйДокумент;
	Попытка
		лпТекст.Прочитать(лпФайл);
		УдалитьФайлы(лпФайл);
		лпТаблВозврат = ПолучитьТаблицуКурсов(лпТекст, прКодВалюты);
	Исключение	
	КонецПопытки;
	Возврат лпТаблВозврат;
КонецФункции


Функция ПолучитьТаблицуКурсовЗаПериод(прТекст)
	
	лпТаблВозврат = Новый ТаблицаЗначений;
	лпТаблВозврат.Колонки.Добавить("Дата", 			Новый ОписаниеТипов("Дата"), 	"Дата", 12);
	лпТаблВозврат.Колонки.Добавить("Время",			Новый ОписаниеТипов("Строка"), 	"Время", 5);
	лпТаблВозврат.Колонки.Добавить("Кратность", 	Новый ОписаниеТипов("Число"), 	"Кратность", 5);
	лпТаблВозврат.Колонки.Добавить("Курс", 			Новый ОписаниеТипов("Число"), 	"Курс", 12);
	
	//лпСтрокаПоискаНачало = "<td class=""cell_c"" width=""33%"">";
	лпСтрокаПоискаНачало = "<td class=""cell_c"" width=""25%"">";
	лпСтрокаПоискаКонец = "</td>"; 
	лпСтрокаПоискВалюта = лпСтрокаПоискаНачало;
	
	лпРазмер = прТекст.КоличествоСтрок();
	Если лпРазмер = 0 Тогда
		Возврат лпТаблВозврат;
	КонецЕсли; 

	лпТекст = прТекст;

	лпСчСтрок = 0;
	Для лпИндекс = 1 По лпРазмер Цикл
		лпСчСтрок = лпСчСтрок + 1;
		лпСтрока = СокрЛП(лпТекст.ПолучитьСтроку(лпСчСтрок));	

		лпСтрокаНачало = Найти(СокрЛП(лпСтрока), лпСтрокаПоискВалюта);
		Если лпСтрокаНачало = 0 Тогда
			Продолжить;
		КонецЕсли;   
		
		лпНоваяСтрока = лпТаблВозврат.Добавить();
		//Для лпСч = 0 По 2 Цикл 
		Для лпСч = 0 По 3 Цикл 	
			
			лпСтрока = СокрЛП(прТекст.ПолучитьСтроку(лпСчСтрок));
			лпСтрока = СтрЗаменить(лпСтрока, лпСтрокаПоискаНачало, "");
			лпСтрока = СтрЗаменить(лпСтрока, лпСтрокаПоискаКонец, "");
			лпСчСтрок = лпСчСтрок + 1;
			Если НЕ ЗначениеЗаполнено(лпСтрока) Тогда
				Продолжить;
			КонецЕсли;
			
			//Если лпСч = 0 Тогда
			//	лпНоваяСтрока.Дата = ПолучитьДатуИзНормальногоФормата(лпСтрока);
			//ИначеЕсли лпСч = 1 Тогда	
			//	лпНоваяСтрока.Кратность = Число(СокрЛП(лпСтрока));
			//ИначеЕсли лпСч = 2 Тогда	
			//	лпНоваяСтрока.Курс = Число(СокрЛП(лпСтрока));
			//КонецЕсли;
			Если лпСч = 0 Тогда
				лпНоваяСтрока.Дата = ПолучитьДатуИзНормальногоФормата(лпСтрока);
			ИначеЕсли лпСч = 1 Тогда
				лпНоваяСтрока.Время = СокрЛП(лпСтрока);
			ИначеЕсли лпСч = 2 Тогда	
				лпНоваяСтрока.Кратность = Число(СокрЛП(лпСтрока));
			ИначеЕсли лпСч = 3 Тогда	
				лпНоваяСтрока.Курс = Число(СокрЛП(лпСтрока));
			КонецЕсли;
			
			
		КонецЦикла; 
	КонецЦикла;
	Возврат лпТаблВозврат;
КонецФункции


Функция ДатьКурсЗаПериод(прНачДата, прКонДата, прКодПоНБУ)
	лпТаблВозврат = Новый ТаблицаЗначений;
	лпДатаНач = Формат(прНачДата, "ДЛФ=Д");
	лпДатаКон = Формат(прКонДата, "ДЛФ=Д"); 
	лпСтрокаПериод = "http://www.bank.gov.ua/control/uk/curmetal/currency/search?formType=searchPeriodForm&time_step=daily&currency=" + прКодПоНБУ + "&periodStartTime=" + лпДатаНач + "&periodEndTime=" + лпДатаКон + "&outer=table&execute=%D0%92%D0%B8%D0%BA%D0%BE%D0%BD%D0%B0%D1%82%D0%B8";
	лпФайл = GetHTTP(лпСтрокаПериод, 0);
	лпТекст = Новый ТекстовыйДокумент;
	Попытка
		лпТекст.Прочитать(лпФайл);
		УдалитьФайлы(лпФайл);
		лпТаблВозврат = ПолучитьТаблицуКурсовЗаПериод(лпТекст);
	Исключение	
	КонецПопытки;
	Возврат лпТаблВозврат;
КонецФункции


Процедура ДобавитьМенюКоманднойПанели(прТекст)   // Геннадий Ванин (Новосибирск) переделано 
	лпКнопкиКоманднойПанели = ЭлементыФормы.ОсновныеДействияФормы.Кнопки;
	лпИндекс = лпКнопкиКоманднойПанели.Индекс(лпКнопкиКоманднойПанели.Найти(прТекст));
	Если лпИндекс = -1 Тогда
		лпИндекс = 0;
	Иначе 
		лпКнопкиКоманднойПанели.Удалить(лпИндекс);
	КонецЕсли;
	лпИмя = СтрЗаменить(прТекст, "_", " ");
	лпКнопкаМеню 	= лпКнопкиКоманднойПанели.Вставить(лпИндекс, лпИмя, ТипКнопкиКоманднойПанели.Подменю, прТекст); 
	лпПодМеню 		= лпКнопкаМеню.Кнопки.Добавить("кнПодменю1",   	//имя
		 			ТипКнопкиКоманднойПанели.Действие, 				//ТипКнопки - разделитель, подменю, действие
		 			"На дату" ,  									// ТекстКнопки
		 			Новый Действие("ПолучитьНаДату"));				//Действие
					
	//лпКнопкаМеню.Кнопки.Добавить( ,								//имя
	//				ТипКнопкиКоманднойПанели.Разделитель			//ТипКнопки - разделитель, подменю, действие
	//								);								//Действие
  
	лпКнопкаМеню.Кнопки.Добавить("кнПодменю2",  					//имя
		  			ТипКнопкиКоманднойПанели.Действие, 				//ТипКнопки - разделитель, подменю, действие
		  			"За период",  									// ТекстКнопки
		  			Новый Действие("ПолучитьЗаПериод"));			//Действие
КонецПроцедуры


Функция ПолучитьНаДату()
	лпТаблВозврат = Новый ТаблицаЗначений;
	Если Не ЗначениеЗаполнено(ВыбКонПериодаНБУ) Тогда
		ВыбДатаКон = ТекущаяДата();
	КонецЕсли;	
	лпТаблВозврат = ДатьКурсыЗаДень(ВыбКонПериодаНБУ, );
	Если фПечать Тогда
		ПечатьТаблЗнач(лпТаблВозврат,, "Курсы валют на : " + Формат(ВыбКонПериодаНБУ, "ДЛФ=Д"), Ложь);
	Иначе
		Если ВладелецФормы = Неопределено Тогда
			лпТаблВозврат.ВыбратьСтроку();
		КонецЕсли;
	КонецЕсли;	
	Возврат лпТаблВозврат;
КонецФункции


Процедура ПриОткрытии()


	
КонецПроцедуры	


Функция ДатьКодНБУ(прКодВалюты, прСписокСоответствие)
	лпВозв = "";
	Если НЕ ЗначениеЗаполнено(прКодВалюты) Тогда
		Возврат лпВозв;
	КонецЕсли;
	Если НЕ ТипЗнч(прСписокСоответствие)= Тип("СписокЗначений")  Тогда
		Возврат лпВозв;
	КонецЕсли;     
	лпРазмер = прСписокСоответствие.Количество();
	Если лпРазмер < 1  Тогда
		Возврат лпВозв;
	КонецЕсли;
	
	Для Каждого лпЭлемент Из прСписокСоответствие Цикл
		Если Найти(лпЭлемент.Представление, прКодВалюты) > 0 Тогда
			лпВозв = лпЭлемент.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат лпВозв;	
КонецФункции


Функция ДатьСписокСоответствияКодов()
	лпСписокСоответствие = Новый СписокЗначений;
	лпСписокСоответствие.Добавить(169, "Доллар (840)"); 
	лпСписокСоответствие.Добавить(196, "Евро (978)");
	лпСписокСоответствие.Добавить(209, "Росс. рубль (643)"); 	
	Возврат лпСписокСоответствие;	
КонецФункции	


Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
    ДобавитьМенюКоманднойПанели("Получить курсы");
	
	ВыбКонПериодаНБУ = ТекущаяДата();
	ВыбКонПериодаЦБР = ТекущаяДата();
	
	лпСписокСоответствие = ДатьСписокСоответствияКодов();
	ЭлементыФормы.спВалюты.СписокВыбора = лпСписокСоответствие;
	ЭлементыФормы.спВалюты.Значение = ЭлементыФормы.спВалюты.СписокВыбора[0].Значение;
КонецПроцедуры		


Функция ПолучитьЗаПериод(прКодВалНБУ = Неопределено)
	лпТаблВозврат = Новый ТаблицаЗначений;
	Если Не ЗначениеЗаполнено(ВыбКонПериодаНБУ) Тогда
		ВыбКонПериодаНБУ = ТекущаяДата();
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(ВыбНачПериодаНБУ) Тогда
		ВыбНачПериодаНБУ = ДобавитьДень(ВыбКонПериодаНБУ, -8);
	КонецЕсли;	
	лпКод = ?(НЕ ТипЗнч(прКодВалНБУ) = Тип("Строка"), Строка(ЭлементыФормы.спВалюты.Значение), прКодВалНБУ);
	лпКод = ?(ЗначениеЗаполнено(ЭтаФорма.КодВалюты), прКодВалНБУ, лпКод);
	лпТаблВозврат = ДатьКурсЗаПериод(ВыбНачПериодаНБУ, ВыбКонПериодаНБУ, лпКод);
	
	
	
	Если фПечать Тогда
		лпСписок = ДатьСписокСоответствияКодов();
		Попытка
			лпКод = Число(лпКод);
		Исключение
			лпКод = 0;
		КонецПопытки;	
		лпПредставление = лпСписок.НайтиПоЗначению(лпКод);
		лпПредставление = ?(лпПредставление = Неопределено, "", лпПредставление);
		ПечатьТаблЗнач(лпТаблВозврат,, "Курс " + лпПредставление + " за период : " + Формат(ВыбНачПериодаНБУ, "ДЛФ=Д") + " - " + Формат(ВыбКонПериодаНБУ, "ДЛФ=Д"), Ложь);
	Иначе
		Если ВладелецФормы = Неопределено Тогда
			лпТаблВозврат.ВыбратьСтроку();
		КонецЕсли;
	КонецЕсли;	
	Возврат лпТаблВозврат;
	
	
	
КонецФункции


Процедура ПечатьТаблЗнач(прТаблЗнач, прИмяМакет = "Макет", прЗаголовок = "Отчет", прВыводитьИтоги = Истина)
	Если НЕ ТипЗнч(прТаблЗнач) = Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	Если прТаблЗнач.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	лпТаблица = Новый ТабличныйДокумент;
	лпМакет = ПолучитьМакет(прИмяМакет);
    лпМакет.КодЯзыкаМакета = "ru";
	
	лпЛинияСплошная = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	лпЛинияНетЛинии = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);

	лпКолонкиТабл = прТаблЗнач.Колонки; 
	лпКолКолонок = лпКолонкиТабл.Количество();

	лпОбластьМакета = лпМакет.ПолучитьОбласть("Заголовок"); 	
	лпОбластьМакета.Параметры.лпЗаголовок = прЗаголовок;
	лпТаблица.Вывести(лпОбластьМакета);
	
	лпОбластьМакета = лпМакет.ПолучитьОбласть("ШапкаСтрока|Шапка");
	лпОбластьМакета.ТекущаяОбласть.Обвести(лпЛинияНетЛинии, лпЛинияНетЛинии, лпЛинияСплошная, лпЛинияНетЛинии);
	лпТаблица.Вывести(лпОбластьМакета);
	
	лпШапкаЗнач = "№ п/п";
	лпОбластьМакета = лпМакет.ПолучитьОбласть("ШапкаСтрока|Шапка");
	лпОбластьМакета.Параметры.лпШапкаЗнач = лпШапкаЗнач;
	лпТаблица.Присоединить(лпОбластьМакета);
	
	Для Каждого лпКолонка Из лпКолонкиТабл Цикл
		лпОбластьМакета = лпМакет.ПолучитьОбласть("ШапкаСтрока|Шапка");
        лпШапкаЗнач = лпКолонка.Заголовок;
		лпОбластьМакета.Параметры.лпШапкаЗнач = лпШапкаЗнач;
		лпТаблица.Присоединить(лпОбластьМакета);
	КонецЦикла;  
	
	лпОбластьМакета = лпМакет.ПолучитьОбласть("СтрокаСтрока|Шапка");
	лпОбластьМакета.ТекущаяОбласть.Обвести(лпЛинияНетЛинии, лпЛинияНетЛинии, лпЛинияСплошная, лпЛинияНетЛинии);
	лпТаблица.Вывести(лпОбластьМакета);
	
	Для Каждого лпСтрока Из прТаблЗнач Цикл
		лпОбластьМакета = лпМакет.ПолучитьОбласть("СтрокаСтрока|Шапка");
		лпСтрокаЗнач = прТаблЗнач.Индекс(лпСтрока) + 1;
		Состояние("Вывод таблицы: " + Строка(лпСтрокаЗнач));
		лпОбластьМакета.Параметры.лпСтрокаЗнач = лпСтрокаЗнач;
		лпТаблица.Присоединить(лпОбластьМакета);
		Для Каждого лпКолонка Из лпКолонкиТабл Цикл
			лпСтрокаЗнач = лпСтрока[лпКолонка.Имя];
			лпОбластьМакета.Параметры.лпСтрокаЗнач = лпСтрокаЗнач;
			лпТаблица.Присоединить(лпОбластьМакета);
		КонецЦикла;
		лпОбластьМакета = лпМакет.ПолучитьОбласть("СтрокаСтрока|Шапка");
		лпОбластьМакета.ТекущаяОбласть.Обвести(лпЛинияНетЛинии, лпЛинияНетЛинии, лпЛинияНетЛинии, лпЛинияНетЛинии);
		лпТаблица.Вывести(лпОбластьМакета);
	КонецЦикла;	

	Если прВыводитьИтоги Тогда
		лпСтрокаИтог = "";
		лпОбластьМакета = лпМакет.ПолучитьОбласть("СтрокаИтог|Шапка");
		лпОбластьМакета.ТекущаяОбласть.Обвести(лпЛинияНетЛинии, лпЛинияНетЛинии, лпЛинияСплошная, лпЛинияНетЛинии);
		лпТаблица.Вывести(лпОбластьМакета);
		
		лпСтрокаИтог = прТаблЗнач.Количество();
		лпОбластьМакета = лпМакет.ПолучитьОбласть("СтрокаИтог|Шапка");
		лпОбластьМакета.Параметры.лпСтрокаИтог = лпСтрокаИтог;
		лпТаблица.Присоединить(лпОбластьМакета);
		
		Для Каждого лпКолонка Из лпКолонкиТабл Цикл
			лпТип = Тип(лпКолонка.ТипЗначения);
			лпСтрокаИтог = "";
			Если лпТип = Тип("Число") Тогда
				лпСтрокаИтог = Окр(прТаблЗнач.Итог(лпКолонка),2);
			КонецЕсли;
			лпОбластьМакета = лпМакет.ПолучитьОбласть("СтрокаИтог|Шапка");
			лпОбластьМакета.Параметры.лпСтрокаИтог = лпСтрокаИтог;
			лпТаблица.Присоединить(лпОбластьМакета);
		КонецЦикла;  
	КонецЕсли;
	лпТаблица.ОтображатьСетку 		= Ложь;
	лпТаблица.Защита 				= Ложь;
	лпТаблица.ТолькоПросмотр 		= Истина;
	лпТаблица.ОтображатьЗаголовки 	= Ложь;
	лпТаблица.Показать();
КонецПроцедуры	


Процедура ПолучитьАвтомат() Экспорт
	Если ЭтаФорма.Режим = "День" Тогда
		ТаблРезультат = ПолучитьНаДату().Скопировать();
	Иначе
		лпСписокСоответствие = ДатьСписокСоответствияКодов();
		ТаблРезультат = ПолучитьЗаПериод(ДатьКодНБУ(ЭтаФорма.КодВалюты, лпСписокСоответствие)).Скопировать();
	КонецЕсли;
КонецПроцедуры	










///////////   ЦБР





Функция ПолучитьТаблицуКурсовЦБР(прТекст, прДата, прКодВалюты = "")
	лпКодВалюты = СокрЛП(прКодВалюты);
	
	лпТаблВозврат = Новый ТаблицаЗначений;
	лпТаблВозврат.Колонки.Добавить("Дата",		 	Новый ОписаниеТипов("Дата"), "Дата курса", 10);
	лпТаблВозврат.Колонки.Добавить("КодВалюты", 	Новый ОписаниеТипов("Строка"), "Код валюты", 6);
	лпТаблВозврат.Колонки.Добавить("Условно", 		Новый ОписаниеТипов("Строка"), "Условно", 4);
	лпТаблВозврат.Колонки.Добавить("Кратность", 	Новый ОписаниеТипов("Число"), "Кратность", 5);
	лпТаблВозврат.Колонки.Добавить("Курс", 			Новый ОписаниеТипов("Число"), "Курс", 12);
	лпТаблВозврат.Колонки.Добавить("СтрокаВалюта", 	Новый ОписаниеТипов("Строка"), "Наименование", 20);

	//лпСтрокаНачалоТаблицы = "<table class=""CBRTBL"">";	//2013
	лпСтрокаНачалоТаблицы = "<table class=""data"">";		//2014
	
	//лпСтрокаПоискаНачало = "<td class=""cell_c"">";
	лпСтрокаПоискаНачало = "<tr><td align=""right"">";		//2013
	лпСтрокаПоискаНачало = "<tr><td>";						//2014
	
	
	лпСтрокаПоискаНачалоПраво = "<td align=""right"">";
	лпСтрокаПоискаНачалоЛево = "<td align=""left"">";
	лпСтрокаПоискаНачалоД = "<td>";
	
	лпСтрокаПоискаАббр = "<td class=""cell"">";
	лпСтрокаПоискаКонец = "</td>";                    	
	лпСтрокаПоискаКонецСтрока = "</tr>";
	
	лпСтрокаПоискВалюта = лпСтрокаПоискаНачало;
	Если ЗначениеЗаполнено(лпКодВалюты) Тогда
		лпСтрокаПоискВалюта = лпСтрокаПоискаНачало + лпКодВалюты + лпСтрокаПоискаКонец;
	КонецЕсли;	
	
	лпРазмер = прТекст.КоличествоСтрок();
	Если лпРазмер = 0 Тогда
		Возврат лпТаблВозврат;
	КонецЕсли; 

	лпТекст = прТекст;

	лпНачалоНайдено = Ложь;
	
	лпСчСтрок = 0;
	Для лпИндекс = 1 По лпРазмер Цикл
		лпСчСтрок = лпСчСтрок + 1;
		лпСтрока = СокрЛП(лпТекст.ПолучитьСтроку(лпСчСтрок));	

		Если НЕ лпНачалоНайдено Тогда
			//лпСтрокаНачало = Найти(СокрЛП(лпСтрока), лпСтрокаПоискВалюта);
			лпСтрокаНачало = Найти(СокрЛП(лпСтрока), лпСтрокаНачалоТаблицы);
			Если лпСтрокаНачало = 0 Тогда
				Продолжить;
			КонецЕсли;   
			
			лпНачалоНайдено = Истина;
			лпСчСтрок = лпСчСтрок + 1;
			лпСтрока = СокрЛП(лпТекст.ПолучитьСтроку(лпСчСтрок));			
		КонецЕсли; 
		
		лпСтрокаНачало = Найти(СокрЛП(лпСтрока), лпСтрокаПоискВалюта);
		Если лпСтрокаНачало = 0 Тогда
			Продолжить;
		КонецЕсли;   

		лпНоваяСтрока 		= лпТаблВозврат.Добавить();
		лпНоваяСтрока.Дата 	= прДата;
		Для лпСч = 0 По 4 Цикл 
			
			лпСтрока = СокрЛП(прТекст.ПолучитьСтроку(лпСчСтрок));
			лпСтрока = СтрЗаменить(лпСтрока, "&nbsp;", "");
			лпСтрока = СтрЗаменить(лпСтрока, лпСтрокаПоискаНачало, "");
			лпСтрока = СтрЗаменить(лпСтрока, лпСтрокаПоискаНачалоПраво, "");
			лпСтрока = СтрЗаменить(лпСтрока, лпСтрокаПоискаНачалоЛево, "");
			лпСтрока = СтрЗаменить(лпСтрока, лпСтрокаПоискаКонец, "");
			лпСтрока = СтрЗаменить(лпСтрока, лпСтрокаПоискаКонецСтрока, "");
			лпСтрока = СтрЗаменить(лпСтрока, лпСтрокаПоискаАббр, ""); 
			лпСтрока = СтрЗаменить(лпСтрока, лпСтрокаПоискаНачалоД, "");
			лпСчСтрок = лпСчСтрок + 1;
			Если НЕ ЗначениеЗаполнено(лпСтрока) = 1 Тогда
				Продолжить;
			КонецЕсли;
			
			Если лпСч = 0 Тогда
				лпНоваяСтрока.КодВалюты = СокрЛП(лпСтрока);
			ИначеЕсли лпСч = 1 Тогда	
				лпНоваяСтрока.Условно = СокрЛП(лпСтрока);
			ИначеЕсли лпСч = 2 Тогда	
				лпНоваяСтрока.Кратность = Число(СокрЛП(лпСтрока));
			ИначеЕсли лпСч = 3 Тогда	
				лпНоваяСтрока.СтрокаВалюта = СокрЛП(лпСтрока);
			ИначеЕсли лпСч = 5 Тогда	
				Продолжить;
			ИначеЕсли лпСч = 4 Тогда	
				лпНоваяСтрока.Курс = Число(СокрЛП(лпСтрока));
			КонецЕсли;
			
		КонецЦикла; 
	КонецЦикла;
	Возврат лпТаблВозврат;
КонецФункции




Функция ЗагрузитьЦБР(прНачПериода, прКонПериода, прКодВалюты) Экспорт
	лпТаблВозврат = Новый ТаблицаЗначений;
    лпНачПериодаЦБР = прНачПериода;
	Если НЕ ЗначениеЗаполнено(прНачПериода) Тогда
		лпНачПериодаЦБР = прКонПериода;
		Если НЕ ЗначениеЗаполнено(прКонПериода) Тогда
			ПоказатьОповещениеПользователя("ОТМЕНА", , "Не заполнены даты!");	
			Возврат лпТаблВозврат;
		КонецЕсли;
	КонецЕсли;
	
	лпКодВалюты = СокрЛП(прКодВалюты);
	Если НЕ ЗначениеЗаполнено(лпКодВалюты) Тогда
		лпОтвет = Вопрос("Загрузить курсы по всем валютам?", РежимДиалогаВопрос.ДаНет);
		Если лпОтвет = КодВозвратаДиалога.Нет Тогда
			Возврат лпТаблВозврат;
		КонецЕсли;
	КонецЕсли;
	
	лпДень = лпНачПериодаЦБР;
	Пока лпДень <= прКонПериода Цикл;
		
		лпСсылка = "http://cbr.ru/currency_base/daily.aspx?C_month=" + Месяц(лпДень) + "&C_year=" + Формат(Год(лпДень),"ЧГ=0") + "&date_req=" + Формат(лпДень,"ДЛФ=Д");
		//лпСсылка = "http://cbr.ru/currency_base/daily.aspx?C_month=10&C_year=2013&date_req=01.10.2013";
		лпФайл = GetHTTP(лпСсылка, 0);
		лпТекст = Новый ТекстовыйДокумент;
		
		Попытка
			лпТекст.Прочитать(лпФайл);
			УдалитьФайлы(лпФайл);
			лпТаблКурс = ПолучитьТаблицуКурсовЦБР(лпТекст, лпДень, лпКодВалюты);  //, "840"
			Если лпТаблВозврат.Количество() = 0 Тогда
				лпТаблВозврат = лпТаблКурс.Скопировать();
			Иначе
				Для каждого СтрокаТЗ Из лпТаблКурс Цикл
					ЗаполнитьЗначенияСвойств(лпТаблВозврат.Добавить(), СтрокаТЗ)
				КонецЦикла; 
			КонецЕсли;
		Исключение	
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		лпДень = КонецДня(лпДень) + 1;
	КонецЦикла;
	Возврат лпТаблВозврат;
КонецФункции // ЗагрузитьЦБР()
 


Процедура ОсновныеДействияФормы1ЗагрузитьЦБР(Кнопка)
	лпТаблВозврат = ЗагрузитьЦБР(ВыбНачПериодаЦБР, ВыбКонПериодаЦБР, ВыбВалютаЦБР.Код);
	ЭлементыФормы.ТабличноеПолеЦБР.Значение = лпТаблВозврат.Скопировать();
	ЭлементыФормы.ТабличноеПолеЦБР.СоздатьКолонки();
    //лпТаблВозврат.ВыбратьСтроку();
КонецПроцедуры



Процедура ЗаписатьЦБР(прТаблЗнач) 
	Если НЕ ТипЗнч(прТаблЗнач) = Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	Если прТаблЗнач.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	лпРубльДоллар = Справочники.Валюты.НайтиПоКоду("111");
	Если лпРубльДоллар = Справочники.Валюты.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;

	
	лпКурс = РегистрыСведений.КурсыВалют;
	лпЗаписьКурса = лпКурс.СоздатьМенеджерЗаписи();
	
	Для каждого лпСтрока Из прТаблЗнач Цикл
		Если НЕ ЗначениеЗаполнено(лпСтрока.Дата) Тогда
			ПРодолжить;
		КонецЕсли;
		Если лпСтрока.Кратность = 0 Тогда
			ПРодолжить;
		КонецЕсли;
		Если лпСтрока.Курс = 0 Тогда
			ПРодолжить;
		КонецЕсли;
		Состояние("Запись на: " + Строка(лпСтрока.Дата));
		лпЗаписьКурса.Валюта = лпРубльДоллар;
		лпЗаписьКурса.Период = лпСтрока.Дата;
		лпЗаписьКурса.Прочитать();
		Если (лпЗаписьКурса.Кратность > 0) и (лпЗаписьКурса.Курс > 0) Тогда
			Продолжить;
		КонецЕсли;
		лпЗаписьКурса.Валюта    = лпРубльДоллар;
		лпЗаписьКурса.Период    = лпСтрока.Дата;
		лпЗаписьКурса.Курс      = лпСтрока.Курс;
		лпЗаписьКурса.Кратность = лпСтрока.Кратность;
		лпЗаписьКурса.Записать();
	КонецЦикла; 
	
КонецПроцедуры // ЗаписатьЦБР()
 

Процедура ЭкспортЦБР() Экспорт
	ТаблРезультат = ЗагрузитьЦБР(ВыбНачПериодаЦБР, ВыбКонПериодаЦБР, ВыбВалютаЦБР.Код);
КонецПроцедуры // ЭкспортЦБР()
 

Процедура ОбновитьЦБР(Кнопка) Экспорт
	лпКодОтвета = Вопрос("Обновить курс валют?", РежимДиалогаВопрос.ДаНет,,,"Запись курсов");
	Если лпКодОтвета = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	лпТаблВозврат = ЗагрузитьЦБР(ВыбНачПериодаЦБР, ВыбКонПериодаЦБР, ВыбВалютаЦБР.Код);
	
	ЗаписатьЦБР(лпТаблВозврат);	
КонецПроцедуры









		