Перем ССС;
Перем Обработка;

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ЕстьОшибки = Ложь;

	Для Каждого СтрокаОтбора Из Обработка.ПостроительОтчета.Отбор Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаОтбора.ПутьКДанным) Тогда
			Предупреждение("В отборе не должно быть пустых полей!", 30);
			ЕстьОшибки = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	Обработка.Параметры.Настройки = ПостроительОтчета1.ПолучитьНастройки(Истина, Ложь, Ложь, Ложь, Ложь);
    Обработка.Параметры.Пар = 1;
	Закрыть(Обработка.Параметры);
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Заголовок = "Отбор по регситру "+ Обработка.Параметры.ИмяРегистра;
	ЗначениеУсловий = Обработка.Параметры.Настройки;
	ПостроительОтчета1 = Обработка.Параметры.ПостроительОтчета;
	Если ТипЗнч(ЗначениеУсловий) = Тип("НастройкиПостроителяОтчета") Тогда
		ПостроительОтчета1.УстановитьНастройки(ЗначениеУсловий, Истина, Ложь, Ложь, Ложь, Ложь);
	КонецЕсли;
КонецПроцедуры

Обработка = Этаформа.ВладелецФормы.Обработка;
