
Процедура КнопкаСформироватьНажатие(Кнопка)
	
	Если Не (ВТаблицу ИЛИ ВФайл) Тогда
		Сообщить("Не выбран способ формирования отчета (в таблицу и/или в файл)!");
		Возврат;
	КонецЕсли;	
	
	Отработать(ВТаблицу, ВФайл, ВыбКаталог);
	
КонецПроцедуры

Процедура Кнопка1Нажатие(Элемент)
	
	НастрПер = Новый НастройкаПериода;
	НастрПер.УстановитьПериод(ДатаС,ДатаПо);
	Если НастрПер.Редактировать() Тогда
		ДатаС = НастрПер.ПолучитьДатуНачала();
		ДатаПо = НастрПер.ПолучитьДатуОкончания();
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СохранитьЗначение("Overnight_screening_ДатаС",ДатаС);
	СохранитьЗначение("Overnight_screening_ДатаПо",ДатаПо);
КонецПроцедуры

Процедура ПриОткрытии()
	
	//Отработать(); 					//Закоментирвать для отладки
	//ЗавершитьРаботуСистемы(Ложь);   //Закоментирвать для отладки
	
	УстановитьВидимость();
		
КонецПроцедуры

Процедура ВыбКаталогНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите папку для выгрузки";
	Если Диалог.Выбрать() = Истина Тогда
		ВыбКаталог = Диалог.Каталог;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьВидимость()
	
	ЭлементыФормы.ВыбКаталог.Видимость = ВФайл;
	ЭлементыФормы.ВыбКаталог.Доступность = ВФайл;
	ЭлементыФормы.НадписьВыбКаталог.Видимость = ВФайл;
	
КонецПроцедуры	

Процедура ВФайлПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

