
Процедура КнопкаСформироватьНажатие(Кнопка)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Отчет");
	ОбластьНачало = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьНачало);
	
	ПарамДатаС = НачалоДня(ДатаС);
	ПарамДатаПо = КонецДня(ДатаПо);
	
	ТекОрганизация = Константы.ОсновнаяОрганизация.Получить();
	ТекКомпания = ТекОрганизация.Наименование;
	
	Если ТекКомпания = "ПрАТ ""Арцизьке ХПП""" Тогда
		Компания = "Arciz";
		Префикс = "ART";
	ИначеЕсли ТекКомпания = "Балтське хлібоприймальне підприємство, ПрАТ" Тогда
		Компания = "Balta";
		Префикс = "BLT";
	ИначеЕсли ТекКомпания = "Дергачі-Агро, ТОВ" Тогда
		Компания = "Dergachi";
		Префикс = "DER";
	ИначеЕсли ТекКомпания = "Кулевчанський КХП ПРАТ" Тогда
		Компания = "Kulevcha";
		Префикс = "KLC";
	ИначеЕсли ТекКомпания = "Лебединське ХПП  ПАТ" Тогда
		Компания = "Lebedin";
		Префикс = "LBN";
	ИначеЕсли ТекКомпания = "Любашівський елеватор" Тогда	
		Компания = "Lubashevka";
		Префикс = "LYN";
	ИначеЕсли ТекКомпания = "Підприємство з іноземними інвестиціями ""ОЕК""" Тогда	
		Компания = "OEK";
		Префикс = "OEK";
	ИначеЕсли ТекКомпания = "Аграрні технології, ТОВ" Тогда	
		Компания = "АТ";
		Префикс = "ATE";
	ИначеЕсли ТекКомпания = "ПрАТ ""КОЛОС.""" Тогда
		Компания = "Kolos";
		Префикс = "PMZ";
	ИначеЕсли ТекКомпания = "ПІІ ""ГЛЕНКОР АГРІКАЛЧЕР УКРАЇНА""" Тогда
		Компания = "GGU_trade";
		Префикс = "GAUT";
	ИначеЕсли ТекКомпания = "ПІІ ГЛЕНКОР АГРІКАЛЧЕР УКРАЇНА" Тогда
		Компания = "GGU_buh";
		Префикс = "GAUB";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблКонтрагентов.Контрагент КАК Ссылка,
	|	ТаблКонтрагентов.Контрагент.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(ТаблКонтрагентов.Контрагент.НаименованиеПолное КАК СТРОКА(250)) КАК НаименованиеПолное,
	|	ТаблКонтрагентов.Контрагент.Код КАК Код,
	|	ТаблКонтрагентов.Контрагент.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
	|	ТаблКонтрагентов.Контрагент.ЮрФизЛицо КАК ЮрФизЛицо,
	|	ВЫБОР
	|		КОГДА ТаблКонтрагентов.Контрагент.ГоловнойКонтрагент = ТаблКонтрагентов.Контрагент
	|			ТОГДА """"
	|		ИНАЧЕ ВЫРАЗИТЬ(ТаблКонтрагентов.Контрагент.ГоловнойКонтрагент.НаименованиеПолное КАК СТРОКА(250))
	|	КОНЕЦ КАК ГоловнойКонтрагент,
	|	ТаблКонтрагентов.Контрагент.НеЯвляетсяРезидентом КАК НеЯвляетсяРезидентом
	|ПОМЕСТИТЬ тблКонтрагенты
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПлатежноеПоручениеВходящее.Контрагент КАК Контрагент
	|	ИЗ
	|		Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
	|	ГДЕ";
	Если Компания = "АТ" ИЛИ Компания = "Kolos" ИЛИ Компания = "GGU_buh"  Тогда
		Запрос.Текст = Запрос.Текст + "
		|		ПлатежноеПоручениеВходящее.Дата МЕЖДУ &ДатаС И &ДатаПо";
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|		ПлатежноеПоручениеВходящее.ДатаОплаты МЕЖДУ &ДатаС И &ДатаПо";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|		И НЕ ПлатежноеПоручениеВходящее.Контрагент = &ПустКонтрагент
	|		И Не ПлатежноеПоручениеВходящее.Контрагент В Иерархии (&Группа)";
	Если Компания = "Kolos" Тогда
		Запрос.Текст = Запрос.Текст + "
		|		И Не ПлатежноеПоручениеВходящее.Контрагент В Иерархии (&ГруппаСотрудники)";
	ИначеЕсли Компания = "GGU_buh" Тогда
		Запрос.Текст = Запрос.Текст + "
		|		И Не ПлатежноеПоручениеВходящее.Контрагент В Иерархии (&АвансовыеОтчеты)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|		И ПлатежноеПоручениеВходящее.Проведен = ИСТИНА
	|		И ПлатежноеПоручениеВходящее.ПометкаУдаления = ЛОЖЬ
	|		И ПлатежноеПоручениеВходящее.Организация = &Организация";
	Если Компания = "GGU_buh" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ПлатежноеПоручениеВходящее.ДоговорКонтрагента.ТипДоговора В (&СпАдминПрочее)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПлатежноеПоручениеВходящее.Контрагент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПлатежноеПоручениеИсходящее.Контрагент
	|	ИЗ
	|		Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручениеИсходящее
	|	ГДЕ";
	Если Компания = "АТ" ИЛИ Компания = "Kolos" ИЛИ Компания = "GGU_buh" Тогда
		Запрос.Текст = Запрос.Текст + "
		|		ПлатежноеПоручениеИсходящее.Дата МЕЖДУ &ДатаС И &ДатаПо";
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|		ПлатежноеПоручениеИсходящее.ДатаОплаты МЕЖДУ &ДатаС И &ДатаПо";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|		И ПлатежноеПоручениеИсходящее.Проведен = ИСТИНА
	|		И ПлатежноеПоручениеИсходящее.ПометкаУдаления = ЛОЖЬ
	|		И НЕ ПлатежноеПоручениеИсходящее.Контрагент = &ПустКонтрагент
	|		И Не ПлатежноеПоручениеИсходящее.Контрагент В Иерархии (&Группа)";
	Если Компания = "Kolos" Тогда
		Запрос.Текст = Запрос.Текст + "
		|		И Не ПлатежноеПоручениеИсходящее.Контрагент В Иерархии (&ГруппаСотрудники)";
	ИначеЕсли Компания = "GGU_buh" Тогда
		Запрос.Текст = Запрос.Текст + "
		|		И Не ПлатежноеПоручениеИсходящее.Контрагент В Иерархии (&АвансовыеОтчеты)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|		И ПлатежноеПоручениеИсходящее.Организация = &Организация";
	Если Компания = "GGU_buh" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ПлатежноеПоручениеИсходящее.ДоговорКонтрагента.ТипДоговора В (&СпАдминПрочее)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПлатежноеПоручениеИсходящее.Контрагент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеТоваровУслуг.Контрагент
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|	ГДЕ
	|		ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаС И &ДатаПо
	|		И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|		И ПоступлениеТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|		И Не ПоступлениеТоваровУслуг.Контрагент В Иерархии (&Группа)";
	Если Компания = "Kolos" Тогда
		Запрос.Текст = Запрос.Текст + "
		|		И Не ПоступлениеТоваровУслуг.Контрагент В Иерархии (&ГруппаСотрудники)";
	ИначеЕсли Компания = "GGU_buh" Тогда
		Запрос.Текст = Запрос.Текст + "
		|		И Не ПоступлениеТоваровУслуг.Контрагент В Иерархии (&АвансовыеОтчеты)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|		И ПоступлениеТоваровУслуг.Организация = &Организация";
	Если Компания = "GGU_buh" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ПоступлениеТоваровУслуг.ДоговорКонтрагента.ТипДоговора В (&СпАдминПрочее)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПоступлениеТоваровУслуг.Контрагент";
	Если Компания = "GGU_trade" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПоступлениеУслуг.Контрагент
		|	ИЗ
		|		Документ.ггуПоступлениеУслуг КАК ПоступлениеУслуг
		|	ГДЕ
		|		ПоступлениеУслуг.Дата МЕЖДУ &ДатаС И &ДатаПо
		|		И ПоступлениеУслуг.Проведен = ИСТИНА
		|		И ПоступлениеУслуг.ПометкаУдаления = ЛОЖЬ
		|		И Не ПоступлениеУслуг.Контрагент В Иерархии (&Группа)
		|		И ПоступлениеУслуг.Организация = &Организация
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПоступлениеУслуг.Контрагент";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслуг.Контрагент
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|	ГДЕ
	|		РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаС И &ДатаПо
	|		И РеализацияТоваровУслуг.Проведен = ИСТИНА
	|		И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|		И Не РеализацияТоваровУслуг.Контрагент В Иерархии (&Группа)";
	Если Компания = "Kolos" Тогда
		Запрос.Текст = Запрос.Текст + "
		|		И Не РеализацияТоваровУслуг.Контрагент В Иерархии (&ГруппаСотрудники)";
	ИначеЕсли Компания = "GGU_buh" Тогда
		Запрос.Текст = Запрос.Текст + "
		|		И Не РеализацияТоваровУслуг.Контрагент В Иерархии (&АвансовыеОтчеты)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|		И РеализацияТоваровУслуг.Организация = &Организация";
	Если Компания = "GGU_buh" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И РеализацияТоваровУслуг.ДоговорКонтрагента.ТипДоговора В (&СпАдминПрочее)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РеализацияТоваровУслуг.Контрагент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДоговорыКонтрагентов.Владелец";
	Если Компания = "АТ"  Тогда
		Запрос.Текст = Запрос.Текст + "
		|	ИЗ
		|		Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|	ГДЕ
		|		ДоговорыКонтрагентов.Дата >= ДатаВремя(2019,01,01)";
	ИначеЕсли Компания = "Kolos" Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	ИЗ
		|		Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|	ГДЕ
		|		ДоговорыКонтрагентов.Дата >= ДатаВремя(2019,01,01)
		|		И ДоговорыКонтрагентов.Владелец.Активен = ИСТИНА";
	ИначеЕсли Компания = "OEK" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	ИЗ
		|		Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|	ГДЕ
		|		ДоговорыКонтрагентов.Дата <= &ДатаС
		|		И ДоговорыКонтрагентов.СрокДействия >= &ДатаПо";
	ИначеЕсли Компания = "GGU_trade" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	ИЗ
		|		Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|	ГДЕ
		|		ДоговорыКонтрагентов.ДатаНачала <= &ДатаС
		|		И ДоговорыКонтрагентов.СрокДействия >= &ДатаПо
		|		И ДоговорыКонтрагентов.Владелец.Статус = &Статус";
	ИначеЕсли Компания = "GGU_buh" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	ИЗ
		|		Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|	ГДЕ
		|		ДоговорыКонтрагентов.Дата >= &ДатаПоМинусМесяц
		|		И Не ДоговорыКонтрагентов.Владелец В Иерархии (&АвансовыеОтчеты)
		|		И ДоговорыКонтрагентов.ТипДоговора В (&СпАдминПрочее)";
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|	ИЗ
		|		Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКонтрагентов.СрезПоследних(&ДатаПо, ) КАК СтатусыКонтрагентовСрезПоследних
		|			ПО ДоговорыКонтрагентов.Владелец.КодПоЕДРПОУ = СтатусыКонтрагентовСрезПоследних.Код
		|	ГДЕ
		|		ДоговорыКонтрагентов.Дата <= &ДатаС
		|		И ДоговорыКонтрагентов.СрокДействия >= &ДатаПо
		|		И СтатусыКонтрагентовСрезПоследних.Статус = &Статус";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|		И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|		И Не ДоговорыКонтрагентов.Владелец В Иерархии (&Группа)
	|		И ДоговорыКонтрагентов.Организация = &Организация
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДоговорыКонтрагентов.Владелец) КАК ТаблКонтрагентов
	|ГДЕ
	|	ТаблКонтрагентов.Контрагент <> &ПустКонтрагент
	|	И ТаблКонтрагентов.Контрагент.ЭтоГруппа = ЛОЖЬ
	|	И ТаблКонтрагентов.Контрагент.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблКонтрагентов.Контрагент,
	|	ВЫРАЗИТЬ(ТаблКонтрагентов.Контрагент.НаименованиеПолное КАК СТРОКА(250)),
	|	ВЫБОР
	|		КОГДА ТаблКонтрагентов.Контрагент.ГоловнойКонтрагент = ТаблКонтрагентов.Контрагент
	|			ТОГДА """"
	|		ИНАЧЕ ВЫРАЗИТЬ(ТаблКонтрагентов.Контрагент.ГоловнойКонтрагент.НаименованиеПолное КАК СТРОКА(250))
	|	КОНЕЦ,
	|	ТаблКонтрагентов.Контрагент.Наименование,
	|	ТаблКонтрагентов.Контрагент.Код,
	|	ТаблКонтрагентов.Контрагент.КодПоЕДРПОУ,
	|	ТаблКонтрагентов.Контрагент.ЮрФизЛицо,
	|	ТаблКонтрагентов.Контрагент.НеЯвляетсяРезидентом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тблКонтрагенты.Ссылка,
	|	тблКонтрагенты.Наименование,
	|	тблКонтрагенты.НаименованиеПолное,
	|	тблКонтрагенты.Код,
	|	тблКонтрагенты.КодПоЕДРПОУ,
	|	тблКонтрагенты.ЮрФизЛицо,
	|	тблКонтрагенты.ГоловнойКонтрагент,
	|	тблКонтрагенты.НеЯвляетсяРезидентом,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
	|				ТОГДА КонтактнаяИнформация.Вид
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Вид_Юр,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
	|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(500))
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Представление_Юр,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
	|				ТОГДА КонтактнаяИнформация.Поле1
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле1_Юр,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
	|				ТОГДА КонтактнаяИнформация.Поле2
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле2_Юр,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
	|				ТОГДА КонтактнаяИнформация.Поле3
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле3_Юр,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
	|				ТОГДА КонтактнаяИнформация.Поле4
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле4_Юр,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
	|				ТОГДА КонтактнаяИнформация.Поле5
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле5_Юр,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
	|				ТОГДА КонтактнаяИнформация.Поле6
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле6_Юр,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
	|				ТОГДА КонтактнаяИнформация.Поле7
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле7_Юр,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
	|				ТОГДА КонтактнаяИнформация.Поле8
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле8_Юр,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
	|				ТОГДА КонтактнаяИнформация.Поле9
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле9_Юр,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
	|				ТОГДА КонтактнаяИнформация.Поле10
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле10_Юр,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ЮрАдрес
	|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Комментарий КАК СТРОКА(500))
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Комментарий_Юр,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
	|				ТОГДА КонтактнаяИнформация.Вид
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Вид_Факт,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
	|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(500))
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Представление_Факт,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
	|				ТОГДА КонтактнаяИнформация.Поле1
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле1_Факт,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
	|				ТОГДА КонтактнаяИнформация.Поле2
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле2_Факт,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
	|				ТОГДА КонтактнаяИнформация.Поле3
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле3_Факт,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
	|				ТОГДА КонтактнаяИнформация.Поле4
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле4_Факт,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
	|				ТОГДА КонтактнаяИнформация.Поле5
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле5_Факт,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
	|				ТОГДА КонтактнаяИнформация.Поле6
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле6_Факт,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
	|				ТОГДА КонтактнаяИнформация.Поле7
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле7_Факт,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
	|				ТОГДА КонтактнаяИнформация.Поле8
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле8_Факт,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
	|				ТОГДА КонтактнаяИнформация.Поле9
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле9_Факт,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
	|				ТОГДА КонтактнаяИнформация.Поле10
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Поле10_Факт,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонтактнаяИнформация.Вид = &ФактАдрес
	|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Комментарий КАК СТРОКА(500))
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Комментарий_Факт,";
	Если Компания = "АТ" ИЛИ Компания = "Kolos" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	МАКСИМУМ( """" ) КАК Вид_Дост,
		|	МАКСИМУМ( """" ) КАК Представление_Дост,
		|	МАКСИМУМ( """" ) КАК Поле1_Дост,
		|	МАКСИМУМ( """" ) КАК Поле2_Дост,
		|	МАКСИМУМ( """" ) КАК Поле3_Дост,
		|	МАКСИМУМ( """" ) КАК Поле4_Дост,
		|	МАКСИМУМ( """" ) КАК Поле5_Дост,
		|	МАКСИМУМ( """" ) КАК Поле6_Дост,
		|	МАКСИМУМ( """" ) КАК Поле7_Дост,
		|	МАКСИМУМ( """" ) КАК Поле8_Дост,
		|	МАКСИМУМ( """" ) КАК Поле9_Дост,
		|	МАКСИМУМ( """" ) КАК Поле10_Дост,
		|	МАКСИМУМ( """" ) КАК Комментарий_Дост,";
	Иначе	
		Запрос.Текст = Запрос.Текст + "
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
		|				ТОГДА КонтактнаяИнформация.Вид
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Вид_Дост,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
		|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(500))
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Представление_Дост,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
		|				ТОГДА КонтактнаяИнформация.Поле1
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле1_Дост,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
		|				ТОГДА КонтактнаяИнформация.Поле2
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле2_Дост,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
		|				ТОГДА КонтактнаяИнформация.Поле3
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле3_Дост,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
		|				ТОГДА КонтактнаяИнформация.Поле4
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле4_Дост,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
		|				ТОГДА КонтактнаяИнформация.Поле5
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле5_Дост,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
		|				ТОГДА КонтактнаяИнформация.Поле6
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле6_Дост,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
		|				ТОГДА КонтактнаяИнформация.Поле7
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле7_Дост,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
		|				ТОГДА КонтактнаяИнформация.Поле8
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле8_Дост,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
		|				ТОГДА КонтактнаяИнформация.Поле9
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле9_Дост,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
		|				ТОГДА КонтактнаяИнформация.Поле10
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Поле10_Дост,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &ДостАдрес
		|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Комментарий КАК СТРОКА(500))
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК Комментарий_Дост,";
	КонецЕсли;	
	Если Компания = "GGU_trade" ИЛИ Компания = "GGU_buh" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	МАКСИМУМ( ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
		|				ТОГДА КонтактнаяИнформация.Вид
		|			ИНАЧЕ """"
		|		КОНЕЦ ) КАК Вид_Англ,
		|	МАКСИМУМ( ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
		|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(500))
		|			ИНАЧЕ """"
		|		КОНЕЦ ) КАК Представление_Англ,
		|	МАКСИМУМ( ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
		|				ТОГДА КонтактнаяИнформация.Поле1
		|			ИНАЧЕ """"
		|		КОНЕЦ ) КАК Поле1_Англ,
		|	МАКСИМУМ( ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
		|				ТОГДА КонтактнаяИнформация.Поле2
		|			ИНАЧЕ """"
		|		КОНЕЦ ) КАК Поле2_Англ,
		|	МАКСИМУМ( ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
		|				ТОГДА КонтактнаяИнформация.Поле3
		|			ИНАЧЕ """"
		|		КОНЕЦ ) КАК Поле3_Англ,
		|	МАКСИМУМ( ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
		|				ТОГДА КонтактнаяИнформация.Поле4
		|			ИНАЧЕ """"
		|		КОНЕЦ ) КАК Поле4_Англ,
		|	МАКСИМУМ( ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
		|				ТОГДА КонтактнаяИнформация.Поле5
		|			ИНАЧЕ """"
		|		КОНЕЦ ) КАК Поле5_Англ,
		|	МАКСИМУМ( ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
		|				ТОГДА КонтактнаяИнформация.Поле6
		|			ИНАЧЕ """"
		|		КОНЕЦ ) КАК Поле6_Англ,
		|	МАКСИМУМ( ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
		|				ТОГДА КонтактнаяИнформация.Поле7
		|			ИНАЧЕ """"
		|		КОНЕЦ ) КАК Поле7_Англ,
		|	МАКСИМУМ( ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
		|				ТОГДА КонтактнаяИнформация.Поле8
		|			ИНАЧЕ """"
		|		КОНЕЦ ) КАК Поле8_Англ,
		|	МАКСИМУМ( ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
		|				ТОГДА КонтактнаяИнформация.Поле9
		|			ИНАЧЕ """"
		|		КОНЕЦ ) КАК Поле9_Англ,
		|	МАКСИМУМ( ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
		|				ТОГДА КонтактнаяИнформация.Поле10
		|			ИНАЧЕ """"
		|		КОНЕЦ ) КАК Поле10_Англ,
		|	МАКСИМУМ( ВЫБОР
		|			КОГДА КонтактнаяИнформация.Вид = &АдресАнгл
		|				ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.Комментарий КАК СТРОКА(500))
		|			ИНАЧЕ """"
		|		КОНЕЦ ) КАК Комментарий_Англ";
		
	Иначе	
		Запрос.Текст = Запрос.Текст + "
		|	МАКСИМУМ( """" ) КАК Вид_Англ,
		|	МАКСИМУМ( """" ) КАК Представление_Англ,
		|	МАКСИМУМ( """" ) КАК Поле1_Англ,
		|	МАКСИМУМ( """" ) КАК Поле2_Англ,
		|	МАКСИМУМ( """" ) КАК Поле3_Англ,
		|	МАКСИМУМ( """" ) КАК Поле4_Англ,
		|	МАКСИМУМ( """" ) КАК Поле5_Англ,
		|	МАКСИМУМ( """" ) КАК Поле6_Англ,
		|	МАКСИМУМ( """" ) КАК Поле7_Англ,
		|	МАКСИМУМ( """" ) КАК Поле8_Англ,
		|	МАКСИМУМ( """" ) КАК Поле9_Англ,
		|	МАКСИМУМ( """" ) КАК Поле10_Англ,
		|	МАКСИМУМ( """" ) КАК Комментарий_Англ";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "

	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	тблКонтрагенты КАК тблКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО тблКонтрагенты.Ссылка = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = &Адрес)
	|
	|СГРУППИРОВАТЬ ПО
	|	тблКонтрагенты.Ссылка,
	|	тблКонтрагенты.Наименование,
	|	тблКонтрагенты.НаименованиеПолное,
	|	тблКонтрагенты.Код,
	|	тблКонтрагенты.КодПоЕДРПОУ,
	|	тблКонтрагенты.ЮрФизЛицо,
	|	тблКонтрагенты.ГоловнойКонтрагент,
	|	тблКонтрагенты.НеЯвляетсяРезидентом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Ссылка,
	|	Данные.Наименование,
	|	Данные.НаименованиеПолное КАК Name,
	|	Данные.Код,
	|	Данные.КодПоЕДРПОУ КАК ЕДРПОУ,
	|	Данные.ЮрФизЛицо,
	|	ВЫБОР
	|		КОГДА Данные.ЮрФизЛицо = &ЮрЛицо
	|			ТОГДА ""ORGANISATION""
	|		ИНАЧЕ ""INDIVIDUAL""
	|	КОНЕЦ КАК CustomerType,
	|	""Active"" КАК Cust_status,
	|	Данные.ГоловнойКонтрагент,
	|	Данные.НеЯвляетсяРезидентом,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Вид_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Вид_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Вид_Дост
	|						ИНАЧЕ Данные.Вид_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидАдреса,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Представление_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Представление_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Представление_Дост
	|						ИНАЧЕ Данные.Представление_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ПредстАдреса,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле1_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле1_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле1_Дост
	|						ИНАЧЕ Данные.Поле1_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Поле1,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле2_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле2_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле2_Дост
	|						ИНАЧЕ Данные.Поле2_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Поле2,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле3_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле3_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле3_Дост
	|						ИНАЧЕ Данные.Поле3_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Поле3,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле4_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле4_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле4_Дост
	|						ИНАЧЕ Данные.Поле4_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Поле4,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле5_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле5_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле5_Дост
	|						ИНАЧЕ Данные.Поле5_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Поле5,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле6_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле6_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле6_Дост
	|						ИНАЧЕ Данные.Поле6_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Поле6,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле7_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле7_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле7_Дост
	|						ИНАЧЕ Данные.Поле7_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Поле7,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле8_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле8_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле8_Дост
	|						ИНАЧЕ Данные.Поле8_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Поле8,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле9_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле9_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле9_Дост
	|						ИНАЧЕ Данные.Поле9_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Поле9,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле10_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле10_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле10_Дост
	|						ИНАЧЕ Данные.Поле10_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Поле10,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Комментарий_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Комментарий_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Комментарий_Дост
	|						ИНАЧЕ Данные.Комментарий_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КомментАдреса
	|ИЗ
	|	Данные КАК Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.Ссылка,
	|	Данные.Наименование,
	|	Данные.НаименованиеПолное,
	|	Данные.Код,
	|	Данные.КодПоЕДРПОУ,
	|	Данные.ЮрФизЛицо,
	|	Данные.ГоловнойКонтрагент,
	|	Данные.НеЯвляетсяРезидентом,
	|	ВЫБОР
	|		КОГДА Данные.ЮрФизЛицо = &ЮрЛицо
	|			ТОГДА ""ORGANISATION""
	|		ИНАЧЕ ""INDIVIDUAL""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Вид_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Вид_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Вид_Дост
	|						ИНАЧЕ Данные.Вид_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Представление_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Представление_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Представление_Дост
	|						ИНАЧЕ Данные.Представление_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле1_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле1_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле1_Дост
	|						ИНАЧЕ Данные.Поле1_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле2_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле2_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле2_Дост
	|						ИНАЧЕ Данные.Поле2_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле3_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле3_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле3_Дост
	|						ИНАЧЕ Данные.Поле3_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле4_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле4_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле4_Дост
	|						ИНАЧЕ Данные.Поле4_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле5_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле5_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле5_Дост
	|						ИНАЧЕ Данные.Поле5_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле6_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле6_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле6_Дост
	|						ИНАЧЕ Данные.Поле6_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле7_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле7_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле7_Дост
	|						ИНАЧЕ Данные.Поле7_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле8_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле8_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле8_Дост
	|						ИНАЧЕ Данные.Поле8_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле9_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле9_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле9_Дост
	|						ИНАЧЕ Данные.Поле9_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Поле10_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Поле10_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Поле10_Дост
	|						ИНАЧЕ Данные.Поле10_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Данные.Вид_Юр = &ЮрАдрес
	|			ТОГДА Данные.Комментарий_Юр
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Данные.Вид_Факт = &ФактАдрес
	|					ТОГДА Данные.Комментарий_Факт
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Данные.Вид_Дост = &ДостАдрес
	|							ТОГДА Данные.Комментарий_Дост
	|						ИНАЧЕ Данные.Комментарий_Англ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕДРПОУ";
	

	Запрос.УстановитьПараметр("ДатаС",ПарамДатаС);
	Запрос.УстановитьПараметр("ДатаПо",ПарамДатаПо);
	Запрос.УстановитьПараметр("ДатаПоМинусМесяц",ДобавитьМесяц(ПарамДатаПо,-1));
	Запрос.УстановитьПараметр("ПереводНаДругойСчет", Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет);
	Запрос.УстановитьПараметр("ПустКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("Организация", ТекОрганизация);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ЮрАдрес", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	Запрос.УстановитьПараметр("ФактАдрес", Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	Если Компания = "GGU_buh" Тогда
		Запрос.УстановитьПараметр("ДостАдрес", Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("000000015"));
	ИначеЕсли Не (Компания = "АТ" ИЛИ Компания = "Kolos") Тогда
		Запрос.УстановитьПараметр("ДостАдрес", Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	КонецЕсли;	
	Если Компания = "GGU_trade" ИЛИ Компания = "GGU_buh" Тогда
		Запрос.УстановитьПараметр("АдресАнгл", Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("000000034"));
	КонецЕсли;	
	Если Компания = "АТ" Тогда
		Запрос.УстановитьПараметр("Группа", Справочники.Контрагенты.НайтиПоКоду("00КГ-0001"));
	ИначеЕсли Компания = "Kolos" Тогда
		Запрос.УстановитьПараметр("Группа", Справочники.Контрагенты.НайтиПоКоду("000001015"));
		Запрос.УстановитьПараметр("ГруппаСотрудники", Справочники.Контрагенты.НайтиПоКоду("000001558"));
	ИначеЕсли Компания = "GGU_trade" Тогда
		Запрос.УстановитьПараметр("Группа", глЗначениеПеременной("КонтрагентыGroup"));
	ИначеЕсли Компания = "GGU_buh" Тогда
		Запрос.УстановитьПараметр("Группа", Справочники.Контрагенты.НайтиПоКоду("000006882"));
		Запрос.УстановитьПараметр("АвансовыеОтчеты", Справочники.Контрагенты.НайтиПоКоду("000000002"));
	ИначеЕсли Компания = "OEK" Тогда
		Запрос.УстановитьПараметр("Группа", Справочники.Контрагенты.НайтиПоКоду("000001235"));
	Иначе
		Запрос.УстановитьПараметр("Группа", Справочники.Контрагенты.НайтиПоКоду("000000001"));  
	КонецЕсли;	
	Запрос.УстановитьПараметр("ЮрЛицо", Перечисления.ЮрФизЛицо.ЮрЛицо);
	Если Компания = "GGU_trade" Тогда
		Запрос.УстановитьПараметр("Статус", глЗначениеПеременной("СтатусыКонтрагентыПодтвержденный"));
	ИначеЕсли Компания = "GGU_buh" Тогда
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусКонтрагента.Подтвержденный);
	Иначе
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыПроверки.Подтвержденный);
	КонецЕсли;	
	Если Компания = "GGU_buh" Тогда
		СпАдминПрочее = Новый СписокЗначений;
		СпАдминПрочее.Добавить(Перечисления.ТипДоговора.Административные);
		СпАдминПрочее.Добавить(Перечисления.ТипДоговора.Прочие);
		Запрос.УстановитьПараметр("СпАдминПрочее", СпАдминПрочее);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий()Цикл
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ОбластьСтрока.Параметры.Код = Префикс + "-" + СокрЛП(Выборка.Код);
		ОбластьСтрока.Параметры.ЕДРПОУ = СокрЛП(Выборка.ЕДРПОУ);
		ОбластьСтрока.Параметры.Компания = Компания;
		Если Выборка.CustomerType = "INDIVIDUAL" Тогда
			
			ФИО = СокрЛП(Выборка.Name);
			ФИО = УбратьЛишнее(ФИО);
			МассивСтрок = СформироватьМассивСтрок(ФИО);
			КоличествоСтрок = МассивСтрок.Количество();
			
			Если КоличествоСтрок > 2 Тогда
				Фамилия  = МассивСтрок[КоличествоСтрок -3];
				Имя      = МассивСтрок[КоличествоСтрок -2];
				Отчество = МассивСтрок[КоличествоСтрок -1];
			Иначе
				Фамилия  = "";
				Имя      = СокрЛП(?(ЗначениеЗаполнено(Выборка.Name),Выборка.Name,Выборка.Наименование));
				Отчество = "";
			КонецЕсли;	
			Если ЗначениеЗаполнено(Отчество) Тогда
				Пол = УстановитьПол(Отчество);
			Иначе
				Пол = "";
			КонецЕсли; 
			
			ОбластьСтрока.Параметры.Name = СокрЛП(?(ЗначениеЗаполнено(Имя),СокрЛП(Имя),"") + ?(ЗначениеЗаполнено(Отчество), " " + СокрЛП(Отчество),""));
			ОбластьСтрока.Параметры.Фамилия = СокрЛП(Фамилия);
			ОбластьСтрока.Параметры.Gender = Пол;
			
			Если Не Выборка.НеЯвляетсяРезидентом Тогда
				ОбластьСтрока.Параметры.Сокр_Национальность = "UA";
				ОбластьСтрока.Параметры.Национальность = "Ukraine";
			КонецЕсли;	
			
			ОбластьСтрока.Параметры.Дата_Рожд = "";
			
		Иначе
			ОбластьСтрока.Параметры.Фамилия = "";
			ОбластьСтрока.Параметры.Сокр_Национальность = "";
			ОбластьСтрока.Параметры.Национальность = "";
			ОбластьСтрока.Параметры.Gender = "";
		КонецЕсли;	
		
		Если Не Выборка.НеЯвляетсяРезидентом Тогда
			ОбластьСтрока.Параметры.Сокр_Residency = "UA";
			ОбластьСтрока.Параметры.Residency = "Ukraine";
		Иначе
			ОбластьСтрока.Параметры.Сокр_Residency = "";
			ОбластьСтрока.Параметры.Residency = СокрЛП(Выборка.Поле10);
		КонецЕсли;	
		
		//Теперь поработаем с адресом
		Если ЗначениеЗаполнено(Выборка.Поле1) Тогда
			//Заполнен либо индекс либо страна
			Если локЕстьНеЦифрыВСтроке(СокрЛП(Выборка.Поле1)) Тогда
				ОбластьСтрока.Параметры.ПочтКод = "";
			Иначе	
				ОбластьСтрока.Параметры.ПочтКод = СокрЛП(Выборка.Поле1);
			КонецЕсли;
		Иначе
			//Индекс пустой - все равно, что выводить.
			ОбластьСтрока.Параметры.ПочтКод = "";
		КонецЕсли;
		
		ОбластьСтрока.Параметры.Область = СокрЛП(Выборка.Поле2);
		ОбластьСтрока.Параметры.Район 	= СокрЛП(Выборка.Поле3);
		ОбластьСтрока.Параметры.Город 	= СокрЛП(?(ЗначениеЗаполнено(Выборка.Поле5), Выборка.Поле5, Выборка.Поле4));
		ОбластьСтрока.Параметры.Улица 	= СокрЛП(Выборка.Поле6);
		ОбластьСтрока.Параметры.Дом 	= СокрЛП(Выборка.Поле7);
		ОбластьСтрока.Параметры.Корпус 	= СокрЛП(Выборка.Поле8);
		ОбластьСтрока.Параметры.Квартира= СокрЛП(Выборка.Поле9);
		
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	
		
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ФиксацияСверху = 1;
	ТабДок.Показать();
		                      		
КонецПроцедуры

Функция УбратьЛишнее(ФИО)
	ФИО = СтрЗаменить(ФИО,"."," ");
	ФИО = СтрЗаменить(ФИО,","," ");
	//Если Прав(ФИО,2) = "ЧП" Тогда
	//	ФИО = СтрЗаменить(ФИО,"ЧП","");
	//ИначеЕсли Прав(ФИО,2) = "ПП" Тогда
	//	ФИО = СтрЗаменить(ФИО,"ПП","");
	//ИначеЕсли Прав(ФИО,2) = "ФО" Тогда
	//	ФИО = СтрЗаменить(ФИО,"ФО","");
	//ИначеЕсли Прав(ФИО,2) = "ПН" Тогда
	//	ФИО = СтрЗаменить(ФИО,"ПН","");
	//ИначеЕсли Прав(ФИО,3) = "ФОП" Тогда
	//	ФИО = СтрЗаменить(ФИО,"ФОП","");
	//ИначеЕсли Прав(ФИО,3) = "ФЛП" Тогда
	//	ФИО = СтрЗаменить(ФИО,"ФЛП","");
	//ИначеЕсли Прав(ФИО,3) = "СПД" Тогда
	//	ФИО = СтрЗаменить(ФИО,"СПД","");
	//КонецЕсли;	
	
	Возврат ФИО;
	
КонецФункции

Функция УстановитьПол(ОтчествоРаботника)

	Если Прав(ОтчествоРаботника, 2) = "ич" ИЛИ Прав(ОтчествоРаботника, 2) = "ИЧ" ИЛИ Прав(ОтчествоРаботника, 2) = "ич" ИЛИ Прав(ОтчествоРаботника, 2) = "ИЧ" Тогда
		Пол = "male";
	ИначеЕсли Прав(ОтчествоРаботника, 2) = "на" ИЛИ Прав(ОтчествоРаботника, 2) = "НА" ИЛИ Прав(ОтчествоРаботника, 2) = "на" ИЛИ Прав(ОтчествоРаботника, 2) = "НА" Тогда
		Пол = "female";
	Иначе
		Пол = "";
	КонецЕсли; 

	Возврат Пол;
	
КонецФункции

Функция СформироватьМассивСтрок(ИсходнаяСтрока)
	
	МассивСтрок = Новый Массив();
	ПозицияПослПробела = 500;
	Буфер = СокрЛ(ИсходнаяСтрока);
	Пока ПозицияПослПробела > 0 Цикл
		ПозицияПослПробела = Найти(Буфер, " ");
		
		Если ПозицияПослПробела = 0 Тогда
			Если ЗначениеЗаполнено(Буфер) Тогда
				МассивСтрок.Добавить(СокрЛП(Буфер));
			КонецЕсли;	
			Прервать;
		Иначе
			МассивСтрок.Добавить(СокрЛП(Лев(Буфер, ПозицияПослПробела)));
			Буфер  = СокрЛП(Сред(Буфер, ПозицияПослПробела + 1));
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСтрок;
	
КонецФункции

Функция локЕстьНеЦифрыВСтроке(Знач СтрокаПроверки)
	
	Для а = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, а, 1));
		Если НЕ (КодСимвола >= 48 И КодСимвола <= 57) Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЦикла; 

	Возврат Ложь;
	
КонецФункции

Функция ПолучитьТаблицуИзМакета()
	
	МакетПараметров =  ПолучитьМакет("Макет");
	// ВысотаМакета = 3;
	ВысотаМакета = МакетПараметров.ВысотаТаблицы;
	//ШиринаМакета = МакетПараметров.ШиринаТаблицы;
	ШиринаМакета = 3;
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	Для Ширина_ = 1 По ШиринаМакета Цикл
		НайденнаяОбласть = МакетПараметров.ПолучитьОбласть("R1" + "C"+ Ширина_);
		ТаблицаЗначений.Колонки.Добавить(НайденнаяОбласть.ТекущаяОбласть.Текст, Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	КонецЦикла;
	
	Для Счетчик = 2 По ВысотаМакета Цикл
		ТаблицаЗначений.Добавить();
	КонецЦикла;
	
	Для Высота_ = 2 По ВысотаМакета Цикл
		Для Ширина_ = 1 По ШиринаМакета Цикл
			НайденнаяОбласть = МакетПараметров.ПолучитьОбласть("R" + Высота_ + "C"+ Ширина_);
			ТаблицаЗначений[Высота_ - 2][Ширина_ - 1] = НайденнаяОбласть.ТекущаяОбласть.Текст;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаЗначений;
	
КонецФункции

Процедура Кнопка1Нажатие(Элемент)
	
	НастрПер = Новый НастройкаПериода;
	НастрПер.УстановитьПериод(ДатаС,ДатаПо);
	Если НастрПер.Редактировать() Тогда
		ДатаС = НастрПер.ПолучитьДатуНачала();
		ДатаПо = НастрПер.ПолучитьДатуОкончания();
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СохранитьЗначение("Overnight_screening_ДатаС",ДатаС);
	СохранитьЗначение("Overnight_screening_ДатаПо",ДатаПо);
КонецПроцедуры

Процедура ПриОткрытии()
	
	Восстановленная_ДатаС  = ВосстановитьЗначение("Overnight_screening_ДатаС");
	Если Не Восстановленная_ДатаС = Неопределено Тогда
		ДатаС = Восстановленная_ДатаС;
	КонецЕсли;	
		
	Восстановленная_ДатаПо = ВосстановитьЗначение("Overnight_screening_ДатаПо");
	Если Не Восстановленная_ДатаПо = Неопределено Тогда
		ДатаПо = Восстановленная_ДатаПо;
	КонецЕсли;	
		
КонецПроцедуры

