
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	НазваОбробки = НазваОбробки();
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.1.3.1");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Наименование = НазваОбробки;
	ПараметрыРегистрации.Версия = ПоточнаВерсіяОбробки();
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация = НСтр("ru = 'Обробка обміну з клієнт-банком'; uk = 'Обробка обміну з клієнт-банком'");
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НазваОбробки;
	Команда.Идентификатор = ІмяОбробки();
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти

#Область Функції

Функция ПоточнаВерсіяОбробки() Экспорт
	Возврат "3.5";
КонецФункции

Функция ІмяОбробки() Экспорт
	Возврат ЭтотОбъект.Метаданные().Имя;
КонецФункции

Функция НазваОбробки() Экспорт
	Возврат ЭтотОбъект.Метаданные().Синоним;
КонецФункции

#КонецОбласти

#КонецЕсли
