
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Если Вопрос("Очистить базу?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		Состояние("1. Очищаем регистр версий объектов !");
		НоваяЗапись = РегистрыСведений.гауВерсииОбъектов.СоздатьНаборЗаписей();
		НоваяЗапись.Записать();
		Состояние("2. Очистили регистр версий объектов !");
		
		Состояние("1. Очищаем регистр ReportsData !");
		НоваяЗапись = РегистрыСведений.ReportsData.СоздатьНаборЗаписей();
		НоваяЗапись.Записать();
		Состояние("2. Очистили регистр ReportsData !");
		
	КонецЕсли;
	
КонецПроцедуры
