
Процедура КоманднаяПанель1ЗаполнитьПоТаблицеЗагрузки(Кнопка)
	Если ДанныеЗагрузки.Количество() и Вопрос("Таблица данных загрузки не пустая, для продолжения требуется очистка. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		возврат;
	КонецЕсли;
	ДанныеЗагрузки.Очистить();
	Для НомерСтроки = 2 По ЭлементыФормы.ПолеТабличногоДокументаЗагрузки.ВысотаТаблицы Цикл	
		ЗначениеОбласти = ЭлементыФормы.ПолеТабличногоДокументаЗагрузки.Область(НомерСтроки, 1).Текст;
		Если Не ЗначениеЗаполнено(ЗначениеОбласти) Тогда Прервать; КонецЕсли;
		НоваяСтрока = ДанныеЗагрузки.Добавить();
		НоваяСтрока.НоменклатурнаяГруппа = СокрЛП(ЗначениеОбласти);
		НоваяСтрока.НоменклатурнаяГруппаПриведенная = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НоваяСтрока.НоменклатурнаяГруппа);
		НоваяСтрока.СтатьяЗатрат = СокрЛП(ЭлементыФормы.ПолеТабличногоДокументаЗагрузки.Область(НомерСтроки, 2).Текст);
		НоваяСтрока.СтатьяЗатратПриведенная = Справочники.СтатьиЗатрат.НайтиПоНаименованию(НоваяСтрока.СтатьяЗатрат);
		НоваяСтрока.СуммаДолл = СокрЛП(ЭлементыФормы.ПолеТабличногоДокументаЗагрузки.Область(НомерСтроки, 3).Текст);
	КонецЦикла;
КонецПроцедуры


Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Вопрос("Закрыть обработку ""Импорт данных""?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура КоманднаяПанель1Действие9(Кнопка)
	Если Не ЗначениеЗаполнено(ОперацияМСФО) Тогда
		// Надо создать новую операцию МСФО
		лОперацияОбъект = Документы.БИТ_МСФО_Операция.СоздатьДокумент();
		лОперацияОбъект.Adjustments = Ложь;
		лОперацияОбъект.БИТ_МСФО_ПланСчетов = Справочники.БИТ_МСФО_ПланыСчетов.Международный;
		лОперацияОбъект.Дата = (НачалоМесяца(ТекущаяДата())-2);
		лОперацияОбъект.Организация = глЗначениеПеременной("ОрганизацияГленкорГрейнУкраина");
		лОперацияОбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
		лОперацияОбъект.Комментарий = "Admin expenses allocation by crops";
		лОперацияОбъект.Содержание = "Admin expenses allocation by crops";
		Попытка
			лОперацияОбъект.Записать( РежимЗаписиДокумента.Запись );
		Исключение
			Сообщить("Ошибка создания операции МСФО для начисления по документу - " + ". " + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		ОперацияМСФО = лОперацияОбъект.Ссылка;
		лОперацияОбъект = Неопределено;
	КонецЕсли;
	лОперацияОбъект = ОперацияМСФО.ПолучитьОбъект();
	лНаборДвижений = РегистрыБухгалтерии.МСФО.СоздатьНаборЗаписей();
	лНаборДвижений.Отбор.Регистратор.Установить( ОперацияМСФО );
	лНаборДвижений.Прочитать();
	лтзДвижения = лНаборДвижений.Выгрузить();
	лтзДвижения.Очистить();
	
	Для Каждого лСтрока Из ДанныеЗагрузки Цикл 
		лНоваяСтрока = лтзДвижения.Добавить();	
		//лНоваяСтрока.Период = (НачалоМесяца(ТекущаяДата())-10);
		лНоваяСтрока.Период = ОперацияМСФО.Дата;
		
		лНоваяСтрока.Регистратор = лОперацияОбъект.Ссылка;
		лНоваяСтрока.Организация = глЗначениеПеременной("ОрганизацияГленкорГрейнУкраина");
		лНоваяСтрока.БИТ_МСФО_ПланСчетов = Справочники.БИТ_МСФО_ПланыСчетов.Международный;
		лНоваяСтрока.Adjustments = Перечисления.ггуAdjustments.NotAdjustments;
		лНоваяСтрока.Активность = Истина;
		лНоваяСтрока.ВалютаДт = глЗначениеПеременной("ВалютаРегламентированногоУчета"); 
		лНоваяСтрока.ВалютаКт = глЗначениеПеременной("ВалютаРегламентированногоУчета"); 
		лНоваяСтрока.СчетДт = ПланыСчетов.МСФО.НайтиПоНаименованию("Administrative Expenses Allocations");
		лНоваяСтрока.ВидСубконтоДт1 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы;
		лНоваяСтрока.СубконтоДт1 = лСтрока.НоменклатурнаяГруппаПриведенная;
		лНоваяСтрока.ВидСубконтоДт2 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат;
		лНоваяСтрока.СубконтоДт2 = лСтрока.СтатьяЗатратПриведенная;
		лНоваяСтрока.СчетКт = ПланыСчетов.МСФО.НайтиПоНаименованию("Administrative Expenses Allocations");
		лНоваяСтрока.Сумма = лСтрока.СуммаДолл;
	КонецЦикла;
	
	Если СторнироватьНаКонецСледМесяца Тогда	
		Для Каждого лСтрока Из ДанныеЗагрузки Цикл 
			лНоваяСтрока = лтзДвижения.Добавить();	
			лНоваяСтрока.Период = КонецМесяца(ДобавитьМесяц(ОперацияМСФО.Дата, 1))-2;
			
			лНоваяСтрока.Регистратор = лОперацияОбъект.Ссылка;
			лНоваяСтрока.Организация = глЗначениеПеременной("ОрганизацияГленкорГрейнУкраина");
			лНоваяСтрока.БИТ_МСФО_ПланСчетов = Справочники.БИТ_МСФО_ПланыСчетов.Международный;
			лНоваяСтрока.Adjustments = Перечисления.ггуAdjustments.NotAdjustments;
			лНоваяСтрока.Активность = Истина;
			лНоваяСтрока.ВалютаДт = глЗначениеПеременной("ВалютаРегламентированногоУчета"); 
			лНоваяСтрока.ВалютаКт = глЗначениеПеременной("ВалютаРегламентированногоУчета"); 
			лНоваяСтрока.СчетДт = ПланыСчетов.МСФО.НайтиПоНаименованию("Administrative Expenses Allocations");
			лНоваяСтрока.ВидСубконтоДт1 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы;
			лНоваяСтрока.СубконтоДт1 = лСтрока.НоменклатурнаяГруппаПриведенная;
			лНоваяСтрока.ВидСубконтоДт2 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат;
			лНоваяСтрока.СубконтоДт2 = лСтрока.СтатьяЗатратПриведенная;
			лНоваяСтрока.СчетКт = ПланыСчетов.МСФО.НайтиПоНаименованию("Administrative Expenses Allocations");
			лНоваяСтрока.Сумма = -лСтрока.СуммаДолл;
		КонецЦикла;
	КонецЕсли;
	
	лОперацияОбъект.Движения.МСФО.Очистить();
	лОперацияОбъект.Движения.МСФО.Загрузить( лтзДвижения );
	лОперацияОбъект.Движения.МСФО.Записать();
	
	Попытка
		лОперацияОбъект.СуммаОперации = ДанныеЗагрузки.Итог("СуммаДолл");
		лОперацияОбъект.Записать( РежимЗаписиДокумента.Запись );
	Исключение
		Сообщить("Ошибка создания операции МСФО для начисления по документу - " + ". " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
КонецПроцедуры

Процедура ПриОткрытии()
	СторнироватьНаКонецСледМесяца = Истина;
КонецПроцедуры
