
Процедура КнопкаСформироватьНажатие(Кнопка)
	
	СформироватьОтчет();	
	
КонецПроцедуры

Процедура ПриОткрытии()
	Если Не ЗначениеЗаполнено(Дата) Тогда Дата = ТекущаяДата(); КонецЕсли;
	Если Не ЗначениеЗаполнено(ТипОтчета) Тогда ТипОтчета = 1; КонецЕсли;
	Если Не ЗначениеЗаполнено(Глубина) Тогда Глубина = 3; КонецЕсли;
	Если Не ЗначениеЗаполнено(МинСумма) Тогда МинСумма = 10; КонецЕсли;
	Если Не ЗначениеЗаполнено(Организация) Тогда Организация = глЗначениеПеременной("ОсновнаяОрганизация"); КонецЕсли;
	
	Если СчетаУчета.Количество() = 0 Тогда 
		СтрокаСчет = СчетаУчета.Добавить();
		СтрокаСчет.Пометка = Истина;
		СтрокаСчет.Счет    = ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками;
		
		СтрокаСчет = СчетаУчета.Добавить();
		СтрокаСчет.Пометка = Истина;
		СтрокаСчет.Счет    = ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками;
		
		СтрокаСчет = СчетаУчета.Добавить();
		СтрокаСчет.Пометка = Истина;
		СтрокаСчет.Счет    = ПланыСчетов.Хозрасчетный.РасчетыПоВыданнымАвансам;
		
		СтрокаСчет = СчетаУчета.Добавить();
		СтрокаСчет.Пометка = Истина;
		СтрокаСчет.Счет    = ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным;
	КонецЕсли;
	
КонецПроцедуры
