Процедура Инициализировать(Объект, ИмяТабличнойЧасти, ТабличноеПоле) Экспорт
	
	Если Не ИмяТабличнойЧасти = "Услуги" Тогда Возврат; КонецЕсли;
	
	лТЧ = ТабличноеПоле.ТекущиеДанные;
	Если лТЧ = Неопределено Тогда Возврат; КонецЕсли;
	
	лИмяКолонки = ТабличноеПоле.ТекущаяКолонка.Имя;
	Если (Не Лев(лИмяКолонки, 9) = "Изменение") Тогда Возврат; КонецЕсли;
	
	Для каждого лСтрока Из Объект[ИмяТабличнойЧасти] Цикл лСтрока[ лИмяКолонки ] = - лСтрока[ лИмяКолонки ]; КонецЦикла;
КонецПроцедуры 