Функция Печать() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номер,
	|	Дата,
	|	ДоговорКонтрагента,
	|	ДоговорКонтрагента.Дата  		КАК ДоговорДата,
	|	ДоговорКонтрагента.Номер 		КАК ДоговорНомер,
	|	ДоговорКонтрагента.НаименованиеДляПечати КАК ДоговорНаименованиеДляПечати,
	|	ДоговорКонтрагента.ВидДоговора  КАК ВидДоговораКонтрагента,
	|	Ответственный.ФизЛицо.Наименование КАК Отпустил,
	|	Организация,
	|	Контрагент КАК Покупатель,
	|	Организация КАК Поставщик,
	|	СуммаДокумента,
	|	ВалютаДокумента,
	|	УчитыватьНДС,
// Серна - Начало
	|	ЗаказПокупателя.ПодписьРуководителя КАК ПодписьРуководителя,
    |	ЗаказПокупателя.ПодписьГлавногоБухгалтера КАК ПодписьГлавногоБухгалтера,
// Серна - Конец
	|	СуммаВключаетНДС
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК ЗаказПокупателя
	|
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПокупателя_СчетЗаказ";

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	
	ЧастьЗапросаДляВыбораСодержанияУслуг = ФормированиеПечатныхФорм.ПолучитьЧастьЗапросаДляВыбораСодержанияУслуг("ЗаказПокупателя");
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Номенклатура,
				   |	ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК Строка(1000)) КАК Товар,
				   |	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
				   |	ВложенныйЗапрос.Номенклатура.Код КАК Код,
				   |	ВложенныйЗапрос.Количество,
				   |	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ВложенныйЗапрос.Цена,
	               |	ВложенныйЗапрос.СуммаБезСкидки,
	               |	ВложенныйЗапрос.СуммаСкидки,
	               |	ВложенныйЗапрос.Сумма,
	               |	ВложенныйЗапрос.СуммаНДС,
	               |	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
				   |    1 КАК ID
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЗаказПокупателя.Номенклатура КАК Номенклатура,
	               |		ЗаказПокупателя.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
				   |		ЗаказПокупателя.Цена КАК Цена,
	               |		СУММА(ЗаказПокупателя.Количество) 		КАК Количество,
	               |		СУММА(ЗаказПокупателя.СуммаБезСкидки) 	КАК СуммаБезСкидки,
	               |		СУММА(ЗаказПокупателя.СуммаСкидки) 		КАК СуммаСкидки,
	               |		СУММА(ЗаказПокупателя.Сумма) 			КАК Сумма,
	               |		СУММА(ЗаказПокупателя.СуммаНДС) 		КАК СуммаНДС,
	               |		МИНИМУМ(ЗаказПокупателя.НомерСтроки) 	КАК НомерСтроки
	               |	ИЗ
	               |		Документ.СчетНаОплатуПокупателю.Товары КАК ЗаказПокупателя
	               |	
	               |	ГДЕ
	               |		ЗаказПокупателя.Ссылка = &ТекущийДокумент
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ЗаказПокупателя.Номенклатура,
				   |		ЗаказПокупателя.ЕдиницаИзмерения,
	               |		ЗаказПокупателя.Цена,
				   |		ЗаказПокупателя.СтавкаНДС) КАК ВложенныйЗапрос
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	" + ЧастьЗапросаДляВыбораСодержанияУслуг + ",
				   |	" + ЧастьЗапросаДляВыбораСодержанияУслуг + ",
				   |	ЗаказПокупателя.Номенклатура.Артикул КАК Артикул,
				   |	ЗаказПокупателя.Номенклатура.Код КАК Код,
				   |	ЗаказПокупателя.Количество,
	               |	ЗаказПокупателя.Номенклатура.БазоваяЕдиницаИзмерения.Наименование,
	               |	ЗаказПокупателя.Цена,
	               |	ЗаказПокупателя.СуммаБезСкидки,
	               |	ЗаказПокупателя.СуммаСкидки,
	               |	ЗаказПокупателя.Сумма,
	               |	ЗаказПокупателя.СуммаНДС,
	               |	ЗаказПокупателя.НомерСтроки,
				   |    2
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю.Услуги КАК ЗаказПокупателя
	               |
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &ТекущийДокумент
	               |
	               |УПОРЯДОЧИТЬ ПО
				   |    ID,
	               |	НомерСтроки";
    
	ЗапросТовары = Запрос.Выполнить().Выгрузить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК Строка(1000)) КАК Товар,
				   |	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
				   |	ВложенныйЗапрос.Номенклатура.Код КАК Код,
				   |	ВложенныйЗапрос.Количество,
	               |	ВложенныйЗапрос.ЕдиницаИзмерения,
	               |	ВложенныйЗапрос.Цена,
	               |	ВложенныйЗапрос.Сумма,
	               |	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЗаказПокупателя.Номенклатура КАК Номенклатура,
	               |		ЗаказПокупателя.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	               |		ЗаказПокупателя.Цена КАК Цена,
	               |		СУММА(ЗаказПокупателя.Количество) КАК Количество,
	               |		СУММА(ЗаказПокупателя.Сумма) КАК Сумма,
	               |		МИНИМУМ(ЗаказПокупателя.НомерСтроки) КАК НомерСтроки
	               |	ИЗ
	               |		Документ.СчетНаОплатуПокупателю.ВозвратнаяТара КАК ЗаказПокупателя
	               |	
	               |	ГДЕ
	               |		ЗаказПокупателя.Ссылка = &ТекущийДокумент
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ЗаказПокупателя.Номенклатура,
	               |		ЗаказПокупателя.Цена) КАК ВложенныйЗапрос
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	ЗапросТара = Запрос.Выполнить().Выгрузить();	
	
	Макет = ПолучитьМакет("СчетЗаказ");

	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	// Выводим шапку накладной
	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Покупатель, Шапка.Дата,,,КодЯзыкаПечать);
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата,,,КодЯзыкаПечать);
	
	//Если Тип = "Счет" Тогда
		ОбластьМакета       						= Макет.ПолучитьОбласть("ЗаголовокСчета");
		ОбластьМакета.Параметры.НазваниеОрганизации = СведенияОПоставщике.ПолноеНаименование;
		ОбластьМакета.Параметры.ЕДРПОУОрганизации	= УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(СведенияОПоставщике);
		Если ТипЗнч(СсылкаНаОбъект.СтруктурнаяЕдиница) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			Банк		= СсылкаНаОбъект.СтруктурнаяЕдиница.Банк;
			МФО	 		= Банк.Код;
			НомерСчета 	= СсылкаНаОбъект.СтруктурнаяЕдиница.НомерСчета;
		Иначе
			// покажем банковские реквизиты основного счета организации
			Банк		= СведенияОПоставщике.Банк;
			МФО	 		= СведенияОПоставщике.МФО;
			НомерСчета 	= СведенияОПоставщике.НомерСчета;
		КонецЕсли;
		
		ОбластьМакета.Параметры.БанкОрганизации					= Банк;
		ОбластьМакета.Параметры.МФОБанкаОрганизации	            = МФО;
		ОбластьМакета.Параметры.НомерРасчетногоСчетаОрганизации = НомерСчета;
			
		Если  НЕ Шапка.ВидДоговораКонтрагента = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером  
			И НЕ Шапка.ВалютаДокумента <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
	//КонецЕсли; 

	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	Если Шапка.ВидДоговораКонтрагента = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером  Тогда
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Список товаров на комиссию';uk='Список товарів на комісію'",КодЯзыкаПечать),КодЯзыкаПечать);
	Иначе	
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Счет на оплату';uk='Рахунок на оплату'",КодЯзыкаПечать),КодЯзыкаПечать);
	КонецЕсли; 

	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,",,КодЯзыкаПечать);	
	//Если Тип = "Счет" Тогда
// Серна - Начало
		СведенияОПоставщике.Вставить("Дата", СсылкаНаОбъект.Дата);
// Серна - Конец
		ОбластьМакета.Параметры.РеквизитыПоставщика =  НСтр("ru='Т/с ';uk='П/р '",КодЯзыкаПечать) + НомерСчета + НСтр("ru=', Банк ';uk=', Банк '",КодЯзыкаПечать) + Банк + НСтр("ru=', МФО ';uk=', МФО '",КодЯзыкаПечать) + МФО + Символы.ПС + 
													ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,Телефоны,/,КодПоЕДРПОУ,КодПоДРФО,ИНН,НомерСвидетельства,/,ИнформацияОСтатусеПлательщикаНалогов,",,КодЯзыкаПечать);
	//КонецЕсли;
    ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(Шапка);
 	ОбластьМакета.Параметры.ПредставлениеПокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,",,КодЯзыкаПечать);
// Серна - Начало
	ОбластьМакета.Параметры.РеквизитыПокупателя		= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,"КодПоЕДРПОУ,Телефоны,",,КодЯзыкаПечать);
// Серна - Конец
	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим дополнительно информацию о договоре и сделке
	СписокДополнительныхПараметров = "ДоговорНаименованиеДляПечати,";
	МассивСтруктурСтрок = ФормированиеПечатныхФорм.ДополнительнаяИнформация(Шапка,СписокДополнительныхПараметров,КодЯзыкаПечать);
	ОбластьМакета = Макет.ПолучитьОбласть("ДопИнформация");
    Для каждого СтруктураСтроки Из МассивСтруктурСтрок Цикл
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	// Вывести табличную часть
	ОбластьИтого = "Итого";
	
	ЕстьСкидки = (ЗапросТовары.Итог("СуммаСкидки") <> 0);
	
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды = Истина;
		Колонка = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды = Истина;
		Колонка = "Код";
	Иначе
		ВыводитьКоды = Ложь;
	КонецЕсли;
	
	ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
	ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
    ОбластьСкидка = Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
    
	ТабДокумент.Вывести(ОбластьНомера);
	Если ВыводитьКоды Тогда
		ОбластьКодов.Параметры.ИмяКолонкиКодов = Колонка;
		ТабДокумент.Присоединить(ОбластьКодов);
	КонецЕсли;
	
	Суффикс = "";
	Если Шапка.УчитыватьНДС Тогда
		Если Шапка.СуммаВключаетНДС Тогда
			Суффикс  = Суффикс  + НСтр("ru=' с ';uk=' з '",КодЯзыкаПечать);
		Иначе	
			Суффикс  = Суффикс  + НСтр("ru=' без ';uk=' без '",КодЯзыкаПечать);
		КонецЕсли;
		Суффикс = Суффикс  + НСтр("ru='НДС';uk='ПДВ'",КодЯзыкаПечать);
	КонецЕсли;
	ОбластьДанных.Параметры.Цена  = НСтр("ru='Цена';uk='Ціна'",КодЯзыкаПечать) + Суффикс;
	ТабДокумент.Присоединить(ОбластьДанных);
	Если ЕстьСкидки Тогда
		ТабДокумент.Присоединить(ОбластьСкидка);
	КонецЕсли;
	
	ОбластьСуммы.Параметры.Сумма = НСтр("ru='Сумма';uk='Сума'",КодЯзыкаПечать)+ Суффикс;
	ТабДокумент.Присоединить(ОбластьСуммы);
	//ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьКолонкаТовар = Макет.Область("Товар");
	Если Не ВыводитьКоды Тогда
		ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + 
											Макет.Область("КолонкаКодов").ШиринаКолонки;
	КонецЕсли;
	Если НЕ ЕстьСкидки Тогда
		ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + 
											Макет.Область("СуммаБезСкидки").ШиринаКолонки +
											Макет.Область("СуммаСкидки").ШиринаКолонки;
	КонецЕсли;
	
	СуммаБезСкидки	= 0;
	СуммаСкидки 	= 0;
	Сумма    		= 0;
	СуммаНДС 		= 0;
	
	ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть("Строка|КолонкаКодов");
	ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
	ОбластьСкидки = Макет.ПолучитьОбласть("Строка|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");

	Для каждого ВыборкаСтрокТовары Из ЗапросТовары Цикл 

		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			Сообщить(НСтр("ru='В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.';uk='В одному з рядків не заповнене значення номенклатури - рядок під час друку буде пропущений.'"), СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;


		ОбластьНомера.Параметры.НомерСтроки = ЗапросТовары.Индекс(ВыборкаСтрокТовары) + 1;
		ТабДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			Если Колонка = "Артикул" Тогда
				ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Артикул;
			Иначе
				ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Код;
			КонецЕсли;
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;

		ОбластьДанных.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьДанных.Параметры.Товар = СокрЛП(ВыборкаСтрокТовары.Товар);
		ТабДокумент.Присоединить(ОбластьДанных);

		Если ЕстьСкидки Тогда
			ОбластьСкидки.Параметры.Заполнить(ВыборкаСтрокТовары);
			ТабДокумент.Присоединить(ОбластьСкидки);
		КонецЕсли;

		ОбластьСуммы.Параметры.Заполнить(ВыборкаСтрокТовары);
		ТабДокумент.Присоединить(ОбластьСуммы);
		
		СуммаБезСкидки = СуммаБезСкидки + ВыборкаСтрокТовары.СуммаБезСкидки;
		СуммаСкидки    = СуммаСкидки    + ВыборкаСтрокТовары.СуммаСкидки;
		Сумма          = Сумма       	+ ВыборкаСтрокТовары.Сумма;
		СуммаНДС       = СуммаНДС    	+ ВыборкаСтрокТовары.СуммаНДС;

	КонецЦикла;

	// Вывести Итого
	ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть("Итого|КолонкаКодов");
	ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
	ОбластьСкидки = Макет.ПолучитьОбласть("Итого|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("Итого|Сумма");
	
	ТабДокумент.Вывести(ОбластьНомера);
	Если ВыводитьКоды Тогда
		ТабДокумент.Присоединить(ОбластьКодов);
	КонецЕсли;
	ТабДокумент.Присоединить(ОбластьДанных);
	
	Если ЕстьСкидки Тогда
		ОбластьСкидки.Параметры.ВсегоСуммаБезСкидки = ОбщегоНазначения.ФорматСумм(СуммаБезСкидки);		
		ОбластьСкидки.Параметры.ВсегоСуммаСкидки    = ОбщегоНазначения.ФорматСумм(СуммаСкидки);
		ТабДокумент.Присоединить(ОбластьСкидки);
	КонецЕсли;
	
	ОбластьСуммы.Параметры.Всего = ОбщегоНазначения.ФорматСумм(Сумма);
	ТабДокумент.Присоединить(ОбластьСуммы);

	// Вывести ИтогоНДС
	Если Шапка.УчитыватьНДС Тогда
		// НДС
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
		ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначения.ФорматСумм(СуммаНДС,,"""");
		ОбластьМакета.Параметры.НДС      = ?(Шапка.СуммаВключаетНДС, НСтр("ru='В том числе НДС:';uk='У тому числі ПДВ:'",КодЯзыкаПечать), НСтр("ru='Сумма НДС:';uk='Сума ПДВ:'",КодЯзыкаПечать));
		ТабДокумент.Вывести(ОбластьМакета);
		
		// всего с НДС (если сумма не включает НДС)
		Если НЕ Шапка.СуммаВключаетНДС Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
			ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначения.ФорматСумм(Сумма + СуммаНДС);
			ОбластьМакета.Параметры.НДС      = НСтр("ru='Всего с НДС:';uk='Всього із ПДВ:'",КодЯзыкаПечать);
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
	КонецЕсли;

	// выведем таблицу с возвратной тарой
	Если ЗапросТара.Количество() > 0 Тогда
		// сделаем отступ от основной таблицы
		ОбластьПробел = Макет.ПолучитьОбласть("Пробел");
		ТабДокумент.Вывести(ОбластьПробел);
		
		ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицыТара|НомерСтрокиТара");
		ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицыТара|КолонкаКодовТара");
		ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицыТара|ДанныеТара");
		
		ТабДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ОбластьКодов.Параметры.ИмяКолонкиКодов = Колонка;
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьДанных);
		
		ОбластьКолонкаТара = Макет.Область("Тара");
		Если Не ВыводитьКоды Тогда
			ОбластьКолонкаТара.ШиринаКолонки = ОбластьКолонкаТара.ШиринаКолонки + 
			Макет.Область("КолонкаКодовТара").ШиринаКолонки;
		КонецЕсли;
		
        ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТара|НомерСтрокиТара");
		ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТара|КолонкаКодовТара");
		ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТара|ДанныеТара");
		
		СуммаТара    = 0;
		
		Для каждого ВыборкаСтрокТара Из ЗапросТара Цикл 
			
			Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТара.Номенклатура) Тогда
				Сообщить(НСтр("ru='В одной из строк не заполнено значение тары - строка при печати пропущена.';uk='В одному з рядків не заповнене значення тари - рядок під час друку буде пропущений.'"), СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
			
			ОбластьНомера.Параметры.НомерСтроки = ЗапросТара.Индекс(ВыборкаСтрокТара) + 1;
			ТабДокумент.Вывести(ОбластьНомера);
			
			Если ВыводитьКоды Тогда
				Если Колонка = "Артикул" Тогда
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТара.Артикул;
				Иначе
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТара.Код;
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;
			
			ОбластьДанных.Параметры.Заполнить(ВыборкаСтрокТара);
			ОбластьДанных.Параметры.Товар = СокрЛП(ВыборкаСтрокТара.Товар);
			ТабДокумент.Присоединить(ОбластьДанных);
		
			СуммаТара = СуммаТара + ВыборкаСтрокТара.Сумма;
			
			
		КонецЦикла;
		
		// Вывести Итого
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТара");
		ОбластьМакета.Параметры.Всего = ОбщегоНазначения.ФорматСумм(СуммаТара);
		ТабДокумент.Вывести(ОбластьМакета);
		
		// сделаем отступ 
		ТабДокумент.Вывести(ОбластьПробел);
	КонецЕсли;
	
	// Вывести Сумму прописью
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	СуммаКПрописи = Сумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
	ОбластьМакета.Параметры.ИтоговаяСтрока = НСтр("ru='Всего наименований ';uk='Всього найменувань '",КодЯзыкаПечать) + ЗапросТовары.Количество() + "," +
											 НСтр("ru=' на сумму ';uk=' на суму '",КодЯзыкаПечать)  + ОбщегоНазначения.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента)
											 + ?(ЗапросТара.Количество() = 0, "",  НСтр("ru='; возвратная тара ';uk='; зворотна тара '",КодЯзыкаПечать) + ЗапросТара.Количество() + НСтр("ru=', на сумму ';uk=', на суму '",КодЯзыкаПечать) + ОбщегоНазначения.ФорматСумм(СуммаТара, Шапка.ВалютаДокумента)) + ".";
											 
	ОбластьМакета.Параметры.СуммаПрописью  = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента,КодЯзыкаПечать)
	 										 + ?(НЕ Шапка.УчитыватьНДС, "", Символы.ПС + НСтр("ru='В т.ч. НДС: ';uk='У т.ч. ПДВ: '",КодЯзыкаПечать) + ОбщегоНазначения.СформироватьСуммуПрописью(СуммаНДС, Шапка.ВалютаДокумента, КодЯзыкаПечать));

	ТабДокумент.Вывести(ОбластьМакета);

	// Вывести подписи
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
// Серна - Начало
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект.ПодписьРуководителя) и Не ЗначениеЗаполнено(СсылкаНаОбъект.ПодписьГлавногоБухгалтера) Тогда
		ОбластьМакета.Параметры.Виписал = "Виписал(а):_____________________________";
		ОбластьМакета.Параметры.Ответственный = СсылкаНаОбъект.Ответственный.ПолноеНаименование();
	Иначе
		ОбластьМакета.Параметры.Руководитель = "Директор___________________" + СсылкаНаОбъект.ПодписьРуководителя;
		ОбластьМакета.Параметры.ГлавныйБухгалтер = "Головний бухгалтер_________________" + СсылкаНаОбъект.ПодписьГлавногоБухгалтера;
	КонецЕсли;
// Серна - Конец
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;
	
	
///////////////////////////////////////////////////////////////////////	
	
	//лТмп = ггуОбщиеПроцедуры.ПроверкаРежимаОткрытия(СсылкаНаОбъект.ДоговорКонтрагента);
	//КодЯзыкаПечать = "uk"; // всегда на украинском
	//
	//Запрос = Новый Запрос();
	//Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Доверенность.ДатаВыдачи КАК ДатаДокумента,
	//|	Доверенность.Организация,
	//|	Доверенность.ФизЛицо,
	//|	Доверенность.ФизЛицо.Представление КАК КомуВыдана,
	//|	Доверенность.Контрагент КАК Поставщик,
	//|	Доверенность.НаПолучениеОт КАК ПоставщикПредставление,
	//|	Доверенность.ДатаДействия,
	//|	Доверенность.ПоДокументу,
	//|	Доверенность.НомерДоверенности,
	//|	Доверенность.СерияДоверенности
	//|ИЗ
	//|	Документ.Доверенность КАК Доверенность
	//|ГДЕ
	//|	Доверенность.Ссылка = &ТекущийДокумент";
	//Шапка = Запрос.Выполнить().Выбрать();
	//Шапка.Следующий();
	//
	//Запрос = Новый Запрос();
	//Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Доверенность.НомерСтроки КАК Номер,
	//|	Доверенность.НаименованиеТовара КАК Ценности,
	//|	Доверенность.ЕдиницаНаПечать КАК ЕдиницаИзмерения,
	//|	Доверенность.КоличествоНаПечать КАК Количество,
	//|	Доверенность.Количество КАК КоличествоЧисло
	//|ИЗ
	//|	Документ.Доверенность.Товары КАК Доверенность
	//|ГДЕ
	//|	Доверенность.Ссылка = &ТекущийДокумент
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Номер";
	//ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();

	//ТабДокумент = Новый ТабличныйДокумент;
	//ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Доверенность";

	//Макет = ПолучитьМакет("Макет");
	//
	//Если Шапка.Организация.код = "000000001" Тогда
	//	// для Серны после 16/03/2015 выбираем макет с печатью
	//	Если НачалоДня(Шапка.ДатаДокумента) >= '20150316' Тогда
	//		Если Вопрос("Ставить печать по умолчанию на форме?",РежимДиалогаВопрос.ДаНет,10,КодВозвратаДиалога.Да,"Мокрая печать") = КодВозвратаДиалога.Да Тогда
	//			Макет = ПолучитьМакет("МакетПечать");		
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;


	//ПаспортФизЛица        = ОбщегоНазначения.ПаспортныеДанные(Шапка.ФизЛицо, Шапка.ДатаДокумента);
	//СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);

	//ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//ОбластьМакета.Параметры.Заполнить(Шапка);
	//Если не ЗначениеЗаполнено(Шапка.ДатаДокумента) Тогда
	//	ОбластьМакета.Параметры.ДатаДокумента = "______________";
	//Иначе
	//	ОбластьМакета.Параметры.ДатаДокумента = формат(Шапка.ДатаДокумента, "Л=uk_UA; ДЛФ=DD");
	//КонецЕсли;	
	//
	//НомерДоверенности = СтрЗаменить(СокрЛП(Шапка.НомерДоверенности), Символы.НПП, "");
	//Если СтрДлина(НомерДоверенности)>3 Тогда
	//	НомерДоверенности = Лев(НомерДоверенности, СтрДлина(НомерДоверенности)-3) + "" + Прав(НомерДоверенности,3);		
	//КонецЕсли;
	//
	//ОбластьМакета.Параметры.НомерДоверенности = СокрЛП(Шапка.СерияДоверенности) + " " + НомерДоверенности; 
	//

	//ДанныеСотрудника     = ОбщегоНазначения.ДанныеФизЛица(Шапка.Организация, Шапка.ФизЛицо, Шапка.ДатаДокумента);
	//ФамилияИмяОтчествоДоверенного = ?(ДанныеСотрудника.Фамилия = Неопределено,"",ДанныеСотрудника.Фамилия + " ") + 
	//								?(ДанныеСотрудника.Имя = Неопределено,"",ДанныеСотрудника.Имя + " ") +
	//								?(ДанныеСотрудника.Отчество = Неопределено,"",ДанныеСотрудника.Отчество);
	//								
	//ДолжностьДоверенного = НРег(СокрЛП(ДанныеСотрудника.Должность));
	//КомуВыдана = ?(ЗначениеЗаполнено(ДолжностьДоверенного),ДолжностьДоверенного + " ","");
	//ОбластьМакета.Параметры.КомуВыдана 						 = КомуВыдана + ФамилияИмяОтчествоДоверенного;
	//
	//
	//ОбластьМакета.Параметры.НазваниеОрганизации		 		 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,", Ложь);
	//ОбластьМакета.Параметры.ЕДРПОУОрганизации	     		 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "КодПоЕДРПОУ,", Ложь);
	//ОбластьМакета.Параметры.ЮридическийАдрес         		 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ЮридическийАдрес,", Ложь);
	//ОбластьМакета.Параметры.НомерРасчетногоСчетаОрганизации  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НомерСчета,", Ложь);
	//ОбластьМакета.Параметры.МФОБанкаОрганизации   			 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "МФО,", Ложь);
	//ОбластьМакета.Параметры.БанкОрганизации   			     = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "Банк,", Ложь);
	//ОбластьМакета.Параметры.ПодтверждающийДокументВид     	 = ПаспортФизЛица.Вид;
	//ОбластьМакета.Параметры.ПодтверждающийДокументСерия      = ПаспортФизЛица.Серия;
	//ОбластьМакета.Параметры.ПодтверждающийДокументНомер      = ПаспортФизЛица.Номер;
	//ОбластьМакета.Параметры.ПодтверждающийДокументКемВыдан   = ПаспортФизЛица.Выдан;
	//ОбластьМакета.Параметры.ПодтверждающийДокументДатаВыдачи = ПаспортФизЛица.ДатаВыдачи;
	//
	//Если НачалоДня(Шапка.ДатаДокумента) < '20150115' Тогда
	//	ОбластьМакета.Параметры.ЮридическийАдрес = "01030, КИЇВСЬКА, м. КИЇВ, вул. Б.Хмельницького, б. 19-21 ""А"" 17-поверх";
	//КонецЕсли;
	//
	//
	//Если Шапка.Организация.код = "000000001" Тогда
	//	// для Серны до 16/03/2015 указываем старое наименование и р/с
	//	Если НачалоДня(Шапка.ДатаДокумента) < '20150316' Тогда
	//		НаименованиеОрганизации = ПолучитьЗначениеСвойства(Шапка.Организация, "НаименованиеСтарое");
	//		СчетСтарый = ПолучитьЗначениеСвойства(Шапка.Организация, "СчетСтарый");
	//		ОбластьМакета.Параметры.НазваниеОрганизации = НаименованиеОрганизации;
	//		ОбластьМакета.Параметры.НомерРасчетногоСчетаОрганизации  = СчетСтарый.НомерСчета;
	//		ОбластьМакета.Параметры.МФОБанкаОрганизации   			 = СчетСтарый.Банк.КОД;
	//		ОбластьМакета.Параметры.БанкОрганизации   			     = СчетСтарый.Банк.Наименование;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//
	//
	//ТабДокумент.Вывести(ОбластьМакета);

	//  	
	////Если ВыборкаСтрокТовары.Количество() > 6 Тогда
	//	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	////	Сообщить("Количество строк в табличной части больше шести.Типовая форма М-2 ""Доверенность"" рассчитана на шесть строк!", СтатусСообщения.Важное);
	////Иначе
	////	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВысокая");
	////КонецЕсли;
	//
	//Если ВыборкаСтрокТовары.Количество() = 0 Тогда
	//	Для нн = 1 по 7 Цикл
	//		ОбластьМакета.Параметры.Номер = нн;
	//		ТабДокумент.Вывести(ОбластьМакета);
	//	КонецЦикла;
	//Иначе	
	//	Пока ВыборкаСтрокТовары.Следующий() Цикл
	//		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
	//		
	//		лКоличествоЧисло = ВыборкаСтрокТовары.КоличествоЧисло;
	//		Если ВыборкаСтрокТовары.ЕдиницаИзмерения = "т" или ВыборкаСтрокТовары.ЕдиницаИзмерения = "тн" или ВыборкаСтрокТовары.ЕдиницаИзмерения = "тонна" Тогда
	//			лКоличествоПропись = ФормированиеПечатныхФорм.КоличествоПрописью(Цел(лКоличествоЧисло), КодЯзыкаПечать) + " тн" + ?(лКоличествоЧисло = Цел(лКоличествоЧисло), "", " " + Строка((лКоличествоЧисло - Цел(лКоличествоЧисло)) * 1000 ) + " кг");
	//		Иначе
	//			лКоличествоПропись = ВыборкаСтрокТовары.Количество;
	//		КонецЕсли;
	//		ОбластьМакета.Параметры.КоличествоПрописью = лКоличествоПропись;
	//		
	//		ТабДокумент.Вывести(ОбластьМакета);
	//	КонецЦикла;
	//КонецЕсли;
	//ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации
	//	|ИЗ
	//	|	РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
	//	|ГДЕ
	//	|	СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение = &Подразделение
	//	|	И СоответствиеПодразделенийИПодразделенийОрганизаций.Организация = &Организация";

	//Запрос.УстановитьПараметр("Организация", СсылкаНаОбъект.Организация);
	//Запрос.УстановитьПараметр("Подразделение", СсылкаНаОбъект.Подразделение);

	//РезультатЗапроса = Запрос.Выполнить();
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	Данные = Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо",ВыборкаДетальныеЗаписи.ПодразделениеОрганизации, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	// 	ОтвЛица = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(КонецДня(Шапка.ДатаДокумента), Данные);
	//	Результат = ОтвЛица.Найти(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);

	//	Если Результат <> Неопределено Тогда
	//		Попытка
	//			ОбластьМакета.Параметры.Руководитель = Результат.ФизическоеЛицо.Наименование;
	//			лНаименованиеДолжности = СокрЛП(Результат.Должность.Наименование);
	//			Если лНаименованиеДолжности = "FO director/deputy" Тогда
	//				Если (Результат.СтруктурнаяЕдиница.Наименование = "Киев") или (Результат.СтруктурнаяЕдиница.Наименование = "Администрация") Тогда
	//					лНаименованиеДолжности = "Директор";
	//				Иначе
	//					лНаименованиеДолжности = "Директор філії";
	//				КонецЕсли;
	//			КонецЕсли;
	//			ОбластьМакета.Параметры.ТекстРуководительПредприятия = лНаименованиеДолжности;
	//		Исключение
	//			ОбластьМакета.Параметры.Руководитель = "";
	//			ОбластьМакета.Параметры.ТекстРуководительПредприятия = "";
	//		КонецПопытки;
	//	КонецЕсли;
	//	
	//	
	//	Данные = Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо",ВыборкаДетальныеЗаписи.ПодразделениеОрганизации, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	// 	ОтвЛица = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(КонецДня(Шапка.ДатаДокумента), Данные);
	//	Результат = ОтвЛица.Найти(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);

	//	Если Результат <> Неопределено Тогда
	//		Попытка
	//			ОбластьМакета.Параметры.ГлавныйБухгалтер = Результат.ФизическоеЛицо.Наименование;
	//			
	//		Исключение
	//			ОбластьМакета.Параметры.ГлавныйБухгалтер = "";
	//			
	//		КонецПопытки;
	//	КонецЕсли;
	//	
	//	ЕСли (Результат = Неопределено) или Результат.ФизическоеЛицо.Наименование ="" Тогда
	//		ОбластьМакета.Параметры.ТекстГоловнийбухгалтер = "";
	//	Иначе
	//		ОбластьМакета.Параметры.ТекстГоловнийбухгалтер = "Головний бухгалтер";
	//    КонецЕсли;
	//	
	//КонецЕсли;

	//ТабДокумент.Вывести(ОбластьМакета);
	//
	//Возврат ТабДокумент;


	
КонецФункции

Функция ПолучитьЗначениеСвойства(Организация, ИмяСвойства)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЗначенияСвойствОбъектов.Объект,
	               |	ЗначенияСвойствОбъектов.Свойство,
	               |	ЗначенияСвойствОбъектов.Значение
	               |ИЗ
	               |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |ГДЕ
	               |	ЗначенияСвойствОбъектов.Объект = &Организация
	               |	И ЗначенияСвойствОбъектов.Свойство.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Наименование", ИмяСвойства);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат[0].Значение;
				   
КонецФункции

