
Процедура ОтправитьПисьмо(лТекстТут)
	лПисьмоОтправлено = Истина;
	
	лОтправитель = "Robot1C.Kyiv@glencore.com.ua";
	
	Почта = Новый ИнтернетПочта;
	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Тема = "В бухгалтерской базе 1С присутствуют отложенные движения!";
	Письмо.Отправитель = лОтправитель;
	Письмо.ИмяОтправителя = "Robot1C";
	
	Письмо.Получатели.Добавить("Aleksandr.Plyushchev@glencore.com.ua");
	Письмо.Получатели.Добавить("Dmytry.Kozenko@usilos.com.ua");
	
	Текст = Письмо.Тексты.Добавить(лТекстТут, ТипТекстаПочтовогоСообщения.HTML);
	
	лСписокАдресСервераSMTP = Новый СписокЗначений;
	лСписокАдресСервераSMTP.Добавить("smtp.emea.viterra.online","");
	лСписокАдресСервераSMTP.Добавить("10.31.6.16","");
	лСписокАдресСервераSMTP.Добавить("10.30.6.16","End");
	
	Для каждого лСтрока Из лСписокАдресСервераSMTP Цикл
		Профиль = СоздатьПочтовыйПрофиль(лСтрока.Значение);
		Попытка
			Почта.Подключиться(Профиль);
			Почта.Послать(Письмо);
			лПисьмоОтправлено = Истина;
		Исключение
			Сообщить("Не удалось отправить письмо по ip адресу: """ + Профиль.АдресСервераSMTP + """");   
			Если лСтрока.Представление = "End" Тогда 
				Сообщить(ОписаниеОшибки() + " по ip адресу: """ + Профиль.АдресСервераSMTP + """");   //Выводить только если это последний адрес из списка значений
			КонецЕсли;
			лПисьмоОтправлено = Ложь;
		КонецПопытки;
		Если лПисьмоОтправлено Тогда 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Почта.Отключиться();    
	
КонецПроцедуры

Функция СоздатьПочтовыйПрофиль(АдресСервераSMTP)
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	//Профиль.ИспользоватьSSLPOP3 = Истина;
	//Профиль.АдресСервераPOP3 = "pop3.emea.viterra.online";
	//Профиль.ПортPOP3 = 995;
	//Профиль.Пользователь = "RES-UA-IEV-ROBOT@omniaccess.net";
	//Профиль.Пароль = "GAUR0b1C";
	
	Профиль.ИспользоватьSSLSMTP = Ложь;
	Профиль.АдресСервераSMTP = АдресСервераSMTP;
	//Профиль.ПортSMTP = 587;
	Профиль.ПортSMTP = 25;
	Профиль.ПользовательSMTP = "RES-UA-IEV-ROBOT@omniaccess.net";
	Профиль.ПарольSMTP = "GAUR0b1C";   
	Профиль.ТолькоЗащищеннаяАутентификацияSMTP = Ложь;
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	Возврат Профиль;
	
КонецФункции

Процедура Инициализировать() Экспорт
	
	// Зарегистрируем документы для обмена в УПП
	лУзел = ПланыОбмена.ггуБухУПП.НайтиПоНаименованию( "УПП" );
	лЗапрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Рег.Документ КАК Документ ИЗ РегистрСведений.ггуВыгрузитьВУПП КАК Рег");
	лВыборка = лЗапрос.Выполнить().Выбрать();
	Пока лВыборка.Следующий() Цикл
		Попытка
			ПланыОбмена.ЗарегистрироватьИзменения(лУзел, лВыборка.Документ);
			лЗаписьТут = РегистрыСведений.ггуВыгрузитьВУПП.СоздатьМенеджерЗаписи();
			лЗаписьТут.Документ = лВыборка.Документ;
			лЗаписьТут.Прочитать();
			лЗаписьТут.Удалить();
			лЗаписьТут.Записать();
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки;
	КонецЦикла;
	
	// Отправим информацию о непроведенных документах
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Рег.УзелОбмена,
	|	Рег.Документ,
	|	Рег.ДатаДокумента,
	|	Рег.КоличествоНеудачныхПроведений,
	|	Рег.СообщениеОбОшибкеПроведения
	|ИЗ
	|	РегистрСведений.ОтложенныеДвиженияДокументов КАК Рег";
	
	тз = Запрос.Выполнить().Выгрузить();
	Если тз.Количество() = 0 тогда
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет("ОтложенныеДвижения");
	
	ШапкаТабл = Макет.ПолучитьОбласть("ШапкаТаб");
	Строка = Макет.ПолучитьОбласть("Строка");
	
	ТабД = Новый ТабличныйДокумент;
	ТабД.Вывести(ШапкаТабл);
	
	лНомСтр = 1;
	Для каждого лСтрока Из тз Цикл
		Строка.Параметры.НомерСтроки = лНомСтр;
		Строка.Параметры.УзелОбмена = лСтрока.УзелОбмена;
		Строка.Параметры.Документ = лСтрока.Документ;
		Строка.Параметры.ДатаДокумента = лСтрока.ДатаДокумента;
		Строка.Параметры.КоличествоНеудачныхПроведений = лСтрока.КоличествоНеудачныхПроведений;
		Строка.Параметры.СообщениеОбОшибкеПроведения = лСтрока.СообщениеОбОшибкеПроведения;
		лНомСтр = лНомСтр + 1;
		
		ТабД.Вывести(Строка);
	КонецЦикла;
	
	ИмяФайла = КаталогВременныхФайлов()+"\"+"Отложенные движения.htm";
	ТабД.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.HTML5);
	
	лТекстовыйДокумент = Новый ТекстовыйДокумент;
	лТекстовыйДокумент.Прочитать(ИмяФайла);
	лТекстТут = лТекстовыйДокумент.ПолучитьТекст();
	
	ОтправитьПисьмо(лТекстТут);
	
КонецПроцедуры
