Перем ТабДок;

Процедура КнопкаВыполнитьНажатие(Кнопка)
		
	ТабДок.Очистить();
	ТабДок.ТолькоПросмотр = Истина;
	ВыходнТабл.Строки.Очистить();
	Макет = ПолучитьМакет("Макет");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка"); 
	ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	ПриемникТаблица = ПолучитьТаблицуСобытий();
	
	
	Если СортировкаПоНаименованию = 1 Тогда
		ВыходнТабл.Строки.Сортировать("КоличествоДоб");
	ИначеЕсли СортировкаПоНаименованию = 2 Тогда
		ВыходнТабл.Строки.Сортировать("КоличествоИзм");
	Иначе
		ВыходнТабл.Строки.Сортировать("ИмяПользователя");
	КонецЕсли;	
	
	Состояние("Вывод отчета...");
	Если ВыводитьДокументы Тогда
		Для Каждого СтрК Из ВыходнТабл.Строки Цикл
			 ОбработкаПрерыванияПользователя();
			 ОбластьСтрока.Параметры.Заполнить(СтрК);
			 ТабДок.Вывести(ОбластьСтрока);
			 ТабДок.НачатьГруппуСтрок(,ложь);
			 Для Каждого Ст Из СтрК.Строки Цикл
			 	 ОбластьСтрока2.Параметры.Заполнить(Ст);
			     ТабДок.Вывести(ОбластьСтрока2);
			 КонецЦикла;
			 ТабДок.ЗакончитьГруппуСтрок();
	    КонецЦикла;
    Иначе	
		Для Каждого СтрК Из ВыходнТабл.Строки Цикл
			 ОбработкаПрерыванияПользователя();
			 ОбластьСтрока.Параметры.Заполнить(СтрК);
			 ТабДок.Вывести(ОбластьСтрока);
	    КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОткрытии()
	НачПериода = НачалоМесяца(ТекущаяДата());
	КонПериода = КонецДня(КонецМесяца(ТекущаяДата()));
	ВыводитьДокументы = Истина;
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Процедура СортироватьНажатие(Элемент)
	Если НЕ ЗначениеЗаполнено(ВыходнТабл) Тогда
		Возврат;
	КонецЕсли;
	ТабДок.Очистить();
	ТабДок.ТолькоПросмотр = Истина;
	Макет = ПолучитьМакет("Макет");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка"); 
	ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	
	Состояние("Обработка данных...");
	Если СортировкаПоНаименованию = 1 Тогда
		ВыходнТабл.Строки.Сортировать("КоличествоДоб");
	ИначеЕсли СортировкаПоНаименованию = 2 Тогда
		ВыходнТабл.Строки.Сортировать("КоличествоИзм");
	Иначе
		ВыходнТабл.Строки.Сортировать("ИмяПользователя");
	КонецЕсли;
	
	Состояние("Вывод отчета...");
	Если ВыводитьДокументы Тогда
		Для Каждого СтрК Из ВыходнТабл.Строки Цикл
			 ОбработкаПрерыванияПользователя();
			 ОбластьСтрока.Параметры.Заполнить(СтрК);
			 ТабДок.Вывести(ОбластьСтрока);
			 ТабДок.НачатьГруппуСтрок(,ложь);
			 Для Каждого Ст Из СтрК.Строки Цикл
			 	 ОбластьСтрока2.Параметры.Заполнить(Ст);
			     ТабДок.Вывести(ОбластьСтрока2);
			 КонецЦикла;
			 ТабДок.ЗакончитьГруппуСтрок();
	    КонецЦикла;
    Иначе	
		Для Каждого СтрК Из ВыходнТабл.Строки Цикл
			 ОбработкаПрерыванияПользователя();
			 ОбластьСтрока.Параметры.Заполнить(СтрК);
			 ТабДок.Вывести(ОбластьСтрока);
	    КонецЦикла;
	КонецЕсли;


	
КонецПроцедуры

ТабДок = ЭлементыФормы.Результат; 
ВыходнТабл.Колонки.Добавить("ИмяПользователя");
ВыходнТабл.Колонки.Добавить("ПредставлениеДанных");
ВыходнТабл.Колонки.Добавить("Данные");
ВыходнТабл.Колонки.Добавить("Событие");
ВыходнТабл.Колонки.Добавить("КоличествоИзм", Новый ОписаниеТипов("Число"));
ВыходнТабл.Колонки.Добавить("КоличествоДоб", Новый ОписаниеТипов("Число"));
