
Процедура КнопкаВыполнитьНажатие(Кнопка)
	xl         = Новый COMОбъект("Excel.Application");
	ОкноExcel     = xl.Application.Workbooks.Open(ИмяФайлаЭкспорт);
    Лист_5=ОкноExcel.WorkSheets(5);
	Лист_3=ОкноExcel.WorkSheets(3);
	Лист_2=ОкноExcel.WorkSheets(2); 
	Лист_4=ОкноExcel.WorkSheets(4);
	Лист_1=ОкноExcel.WorkSheets(1);
	
	//==========Заполним лист_1===============
	
	Яч_1=Лист_1.Cells(2,2);
	Яч_1.Value="5311";
	Яч_1=Лист_1.Cells(3,2);
	Яч_1.Value="SERNA"; 
	Яч_1=Лист_1.Cells(5,2);
	Яч_1.Value=ДатаКонца; 
	Состояние("To Excel Sheet_1");
	//==========Заполним лист5_28=============
	
	Запрос28 = Новый Запрос;
	Запрос28.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос28.УстановитьПараметр("Дата2", ДатаКонца);

	Запрос28.Текст = "ВЫБРАТЬ
	                 |	ХозрасчетныйОстатки.Субконто2,
	                 |	ХозрасчетныйОстатки.СуммаОстатокДт
	                 |ИЗ
	                 |	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата2, , , ) КАК ХозрасчетныйОстатки
	                 |ГДЕ
	                 |	ХозрасчетныйОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладе)"  ;
	
	
		Выборка28 = Запрос28.Выполнить().Выбрать();
	інд = 1;
	Пока Выборка28.Следующий()  Цикл
	Если (Число(Выборка28.СуммаОстатокДт)/(Курс/100))>=1 Тогда
	інд = інд + 1;
	Яч_5=Лист_5.Cells(інд,1);
	Яч_5.Value="53119"+Строка(Сред(Выборка28.Субконто2.код,5,5)); 
	Яч_5=Лист_5.Cells(інд,2);
	Яч_5.Value=Строка(Выборка28.Субконто2.Name);
	Яч_5=Лист_5.Cells(інд,3);
	Яч_5.Value="UKR" ;
	Яч_5=Лист_5.Cells(інд,4);
	Яч_5.Value="W" ;
	Состояние("To Excel Sheet_5/28: "+Строка(Выборка28.Субконто2.Name)) ; 
	КонецЕсли;
	КонецЦикла;
	
	//===============Лист5_37==============
	Запрос37 = Новый Запрос;
	Запрос37.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос37.УстановитьПараметр("Дата2", ДатаКонца);

	Запрос37.Текст = "ВЫБРАТЬ
	                 |	ХозрасчетныйОстаткиИОбороты.Счет,
	                 |	ХозрасчетныйОстаткиИОбороты.Субконто1,
	                 |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	                 |ИЗ
	                 |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&Дата1, &Дата2, , , , , ) КАК ХозрасчетныйОстаткиИОбороты
	                 |ГДЕ
	                 |	ХозрасчетныйОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоВыданнымАвансамВНациональнойВалюте)";	
	Выборка37 = Запрос37.Выполнить().Выбрать();
	
	Пока Выборка37.Следующий()  Цикл
	Если (Число(Выборка37.СуммаКонечныйОстаток)/(Курс/100))>=1 Тогда	
	інд = інд + 1;
	Яч_5=Лист_5.Cells(інд,1);
	Яч_5.Value="53117"+Строка(Сред(Выборка37.Субконто1.код,5,5));    
	Яч_5=Лист_5.Cells(інд,2);
	Яч_5.Value=Строка(Выборка37.Субконто1.Name);
	Яч_5=Лист_5.Cells(інд,3);
	Яч_5.Value="UKR" ;
	Яч_5=Лист_5.Cells(інд,4);
	Яч_5.Value="E" ;
	Состояние("To Excel Sheet_5/37: "+Строка(Выборка37.Субконто1.Name)) ;
	КонецЕсли;
	КонецЦикла;
//===============Лист5_36==============
	Запрос36 = Новый Запрос;
	Запрос36.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос36.УстановитьПараметр("Дата2", ДатаКонца);

	Запрос36.Текст = "ВЫБРАТЬ
	                 |	ХозрасчетныйОстаткиИОбороты.Счет,
	                 |	ХозрасчетныйОстаткиИОбороты.Субконто1,
	                 |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	                 |ИЗ
	                 |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&Дата1, &Дата2, , , , , ) КАК ХозрасчетныйОстаткиИОбороты
	                 |ГДЕ
	                 |	ХозрасчетныйОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСОтечественнымиПокупателями)";	
	Выборка36 = Запрос36.Выполнить().Выбрать();
	
	Пока Выборка36.Следующий()  Цикл
	Если (Число(Выборка36.СуммаКонечныйОстаток)/(Курс/100))>=1 Тогда	
	інд = інд + 1;
	Яч_5=Лист_5.Cells(інд,1);
	Яч_5.Value="53116"+Строка(Сред(Выборка36.Субконто1.код,5,5));
	Яч_5=Лист_5.Cells(інд,2);
	Яч_5.Value=Строка(Выборка36.Субконто1.Name);
	Яч_5=Лист_5.Cells(інд,3);
	Яч_5.Value="UKR" ;
	Яч_5=Лист_5.Cells(інд,4);
	Яч_5.Value="E" ;
	Состояние("To Excel Sheet_5/36: "+Строка(Выборка36.Субконто1.Name)) ;
	КонецЕсли;
	КонецЦикла;
//===============КонецЛист5==============
//===============Лист4===================
	Запрос281 = Новый Запрос;
	Запрос281.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос281.УстановитьПараметр("Дата2", ДатаКонца);

	Запрос281.Текст = "ВЫБРАТЬ
	                 |	ХозрасчетныйОстаткиИОбороты.Счет,
	                 |	ХозрасчетныйОстаткиИОбороты.Субконто2,
	                 |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	                 |ИЗ
	                 |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&Дата1, &Дата2, , , , , ) КАК ХозрасчетныйОстаткиИОбороты
	                 |ГДЕ
	                 |	ХозрасчетныйОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладе)";	
	Выборка281 = Запрос281.Выполнить().Выбрать();
	інд =1;
	Пока Выборка281.Следующий()  Цикл
	Если (Число(Выборка281.СуммаКонечныйОстаток)/(Курс/100))>=1 Тогда	
	інд = інд + 1;
	Яч_5=Лист_4.Cells(інд,1);
	Яч_5.Value="53119"+Строка(Сред(Выборка281.Субконто2.код,5,5));
	Яч_5=Лист_4.Cells(інд,2);
	Яч_5.Value=Строка(Выборка281.Субконто2.Name);
	Яч_5=Лист_4.Cells(інд,3);
	Яч_5.Value=ОКР((Число(Выборка281.СуммаКонечныйОстаток)/(Курс/100)),0,1) ;
	Состояние("To Excel Sheet_4:28 "+Строка(Выборка281.Субконто2.Name)) ;
	КонецЕсли;
	КонецЦикла;
	
//39
	Запрос39 = Новый Запрос;
	Запрос39.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос39.УстановитьПараметр("Дата2", ДатаКонца);
	
	Запрос39.Текст = "ВЫБРАТЬ
	                 |	ХозрасчетныйОстаткиИОбороты.Счет,
	                 |	ХозрасчетныйОстаткиИОбороты.Субконто1,
	                 |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	                 |ИЗ
	                 |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&Дата1, &Дата2, , , , , ) КАК ХозрасчетныйОстаткиИОбороты
	                 |ГДЕ
	                 |	ХозрасчетныйОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗатратыБудущихПериодов)";	
	Выборка39 = Запрос39.Выполнить().Выбрать();
	Пока Выборка39.Следующий()  Цикл
	Если (Число(Выборка39.СуммаКонечныйОстаток)/(Курс/100))>=1 Тогда	
	інд = інд + 1;
	Яч_5=Лист_4.Cells(інд,1);
	
	Яч_5.Value="53119"+Строка(Сред(Выборка39.Субконто1.код,5,5));
	Яч_5=Лист_4.Cells(інд,2);
	Яч_5.Value=Строка(Выборка39.Субконто1.Name);
	Яч_5=Лист_4.Cells(інд,3);
	Яч_5.Value=ОКР((Число(Выборка39.СуммаКонечныйОстаток)/(Курс/100)),0,1) ;
	Состояние("To Excel Sheet_4:39 "+Строка(Выборка39.Субконто1.Name)) ;
	КонецЕсли;
	КонецЦикла;
	//===============Лист3===================
	Запрос371 = Новый Запрос;
	Запрос371.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос371.УстановитьПараметр("Дата2", ДатаКонца);

	Запрос371.Текст = "ВЫБРАТЬ
	                  |	ХозрасчетныйОстаткиИОбороты.Счет,
	                  |	ХозрасчетныйОстаткиИОбороты.Субконто1,
	                  |	ХозрасчетныйОстаткиИОбороты.Субконто2,
	                  |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	                  |ИЗ
	                  |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&Дата1, &Дата2, , , , , ) КАК ХозрасчетныйОстаткиИОбороты
	                  |ГДЕ
	                  |	(ХозрасчетныйОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоВыданнымАвансамВНациональнойВалюте)
	                  |			ИЛИ ХозрасчетныйОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымВНациональнойВалюте))";	
	
	Выборка371 = Запрос371.Выполнить().Выбрать();
	інд =1;
	Пока Выборка371.Следующий()  Цикл
	Если Строка(Выборка371.Счет)="3711" ТОгда
	СуммаUSD=Число(Выборка371.СуммаКонечныйОстаток)/(Курс/100);
		Иначе
	СуммаUSD=-(Число(Выборка371.СуммаКонечныйОстаток)/(Курс/100));
	КонецЕсли;
	Если СуммаUSD >=1 Тогда	
	інд = інд + 1;
	Яч_5=Лист_3.Cells(інд,1);
	Яч_5.Value=Число(інд);
	Яч_5=Лист_3.Cells(інд,2);
	Яч_5.Value=Строка(Выборка371.Субконто2.Дата);
	Яч_5=Лист_3.Cells(інд,3);
	Яч_5.Value=Строка(ДобавитьМесяц(Выборка371.Субконто2.Дата,1));
	Яч_5=Лист_3.Cells(інд,4);
	Яч_5.Value="53117"+Строка(Сред(Выборка371.Субконто1.код,5,5));
	Яч_5=Лист_3.Cells(інд,5);
	Яч_5.Value=Строка(Выборка371.Субконто1.Name);
	Яч_5=Лист_3.Cells(інд,6);
	Яч_5.Value=ОКР(Число(Выборка371.СуммаКонечныйОстаток)/(Курс/100),0,1) ;
	Состояние("To Excel Sheet_:3 "+Строка(Выборка371.Счет)+" "+Строка(Выборка371.Субконто1.Name)) ;
	КонецЕсли;
	КонецЦикла;
	//===============Лист2===================
	ЗапросЛист2 = Новый Запрос;
	ЗапросЛист2.УстановитьПараметр("Дата1", ДатаНачала);
	ЗапросЛист2.УстановитьПараметр("Дата2", ДатаКонца);

	ЗапросЛист2.Текст = "ВЫБРАТЬ
	                    |	ХозрасчетныйОстаткиИОбороты.Счет,
	                    |	ХозрасчетныйОстаткиИОбороты.Субконто1,
	                    |	ХозрасчетныйОстаткиИОбороты.Субконто2,
	                    |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	                    |ИЗ
	                    |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&Дата1, &Дата2, , , , , ) КАК ХозрасчетныйОстаткиИОбороты
	                    |ГДЕ
	                    |	(ХозрасчетныйОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСОтечественнымиПокупателями)
	                    |			ИЛИ ХозрасчетныйОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками)
	                    |			ИЛИ ХозрасчетныйОстаткиИОбороты.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСДругимиДебиторамиВНациональнойВалюте))";	
	ВыборкаЛист2 = ЗапросЛист2.Выполнить().Выбрать();
	інд =1;
	Пока ВыборкаЛист2.Следующий()  Цикл
		Если Число(ВыборкаЛист2.СуммаКонечныйОстаток)/(Курс/100)>0 Тогда
		СуммаUSD=Число(ВыборкаЛист2.СуммаКонечныйОстаток)/(Курс/100);
	      Иначе
		СуммаUSD=-Число(ВыборкаЛист2.СуммаКонечныйОстаток)/(Курс/100);
		КонецЕсли;
	Если СуммаUSD >=1 Тогда	
	інд = інд + 1;
	Яч_5=Лист_2.Cells(інд,1);
	Яч_5.Value=Число(інд);
	Яч_5=Лист_2.Cells(інд,2);
	Яч_5.Value=Строка(ВыборкаЛист2.Субконто2.Дата);
	Яч_5=Лист_2.Cells(інд,3);
	Яч_5.Value=Строка(ДобавитьМесяц(ВыборкаЛист2.Субконто2.Дата,1));
	Яч_5=Лист_2.Cells(інд,4);
	Яч_5.Value="53116"+Строка(Сред(ВыборкаЛист2.Субконто1.код,5,5));
	Яч_5=Лист_2.Cells(інд,5);
	Яч_5.Value=Строка(ВыборкаЛист2.Субконто1.Name);
	Яч_5=Лист_2.Cells(інд,6);
	Яч_5.Value=ОКР(Число(ВыборкаЛист2.СуммаКонечныйОстаток)/(Курс/100),0,1) ;
	Состояние("To Excel Sheet_:2 "+Строка(ВыборкаЛист2.Счет)+" "+Строка(ВыборкаЛист2.Субконто1.Name)) ;
	КонецЕсли;
	КонецЦикла;


	
	
	xl.Visible=1;
   	КонецПроцедуры

Процедура ПриОткрытии()
	ДатаНачала = ДобавитьМесяц(НачалоМесяца(ТекущаяДата()),-1);
	ДатаКонца = КонецМесяца(ДатаНачала);
КонецПроцедуры

Процедура ИмяФайлаЭкспортНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = ИмяФайлаЭкспорт;
	ДиалогОткрытияФайла.Фильтр = "XLS (*.xls)|*.xls";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ИмяФайлаЭкспорт = ДиалогОткрытияФайла.ВыбранныеФайлы[0];
	КонецЕсли;

КонецПроцедуры


Процедура ВалютаПриИзменении(Элемент)
	ЗапросВалюта = Новый Запрос;
	ЗапросВалюта.УстановитьПараметр("Дата2", ДатаКонца);
	ЗапросВалюта.УстановитьПараметр("Валюта", Валюта);
	ЗапросВалюта.Текст = "ВЫБРАТЬ
	                     |	КурсыВалют.Валюта,
	                     |	КурсыВалют.Курс,
	                     |	КурсыВалют.Период
	                     |ИЗ
	                     |	РегистрСведений.КурсыВалют КАК КурсыВалют
	                     |ГДЕ
	                     |	КурсыВалют.Период = &Дата2
	                     |	И КурсыВалют.Валюта = &Валюта"  ;
						 
	Рез = ЗапросВалюта.Выполнить().Выбрать();
	Пока Рез.Следующий()Цикл 
	Курс = Рез.Курс;
	КонецЦикла ;
	ДатаКонца=КонецДня(ДатаКонца)+1;/////
КонецПроцедуры

Процедура ВалютаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	//МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, ДокументОбъект.Дата);
	КонецПроцедуры

