Перем мНоменклатура;

Процедура ЗаполнитьТЧПриложение2( лНоваяСтрока, лСтрока);
	лНоваяСтрока.ДоговорКонтрагента = лСтрока.ДоговорКонтрагента;
	лНоваяСтрока.Номенклатура = мНоменклатура;
	лНоваяСтрока.Содержание = "РК № " + СокрЛП(лСтрока.ВходящаяНН.НомерВходящегоДокумента) +" від " + Формат(лСтрока.ВходящаяНН.ДатаВходящегоДокумента, "ДФ=dd.MM.yy") + " до ПН № " + СокрЛП(лСтрока.ВходящаяНН.НомерКорректируемогоВходящегоДокумента) + " від " + Формат(лСтрока.ВходящаяНН.ДатаКорректируемогоВходящегоДокумента, "ДФ=dd.MM.yy") + ", ІПН " + СокрЛП(лСтрока.ВходящаяНН.Контрагент.ИНН);
	лНоваяСтрока.Количество = 1;
	лНоваяСтрока.Цена = -лСтрока.Сумма;
	лНоваяСтрока.Сумма = -лСтрока.Сумма;
	лНоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
	лНоваяСтрока.СуммаНДС = -лСтрока.СуммаНДС;
	лНоваяСтрока.ИзменениеКоличества = -1;
	лНоваяСтрока.ИзменениеСуммы = лСтрока.Сумма;
	лНоваяСтрока.ИзменениеСуммыНДС = лСтрока.СуммаНДС;
	лНоваяСтрока.Причина = "помилка";
	лНоваяСтрока.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОИзменениеСтоимости;
КонецПроцедуры

Процедура Приложение2(Кнопка)
	// Пробуем найти служебную номенклатуру
	мНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию("Умовний продаж", Истина);
	Если Не ЗначениеЗаполнено(мНоменклатура) Тогда Сообщить("Не нашли служебную номенклатуру 'Умовний продаж' !"); Возврат; КонецЕсли;
	
	лЗапрос = Новый Запрос;
	лЗапрос.УстановитьПараметр("Дата", ДатаПериода );
	лЗапрос.Текст =
	"ВЫБРАТЬ
	|	ДокТЧ.Ссылка КАК ВходящаяНН,
	|	ДокТЧ.ДоговорКонтрагента,
	|	СУММА(ДокТЧ.Сумма) КАК Сумма,
	|	СУММА(ДокТЧ.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	Документ.РегистрацияВходящегоНалоговогоДокумента.Товары КАК ДокТЧ
	|ГДЕ
	|	ДокТЧ.Ссылка.Проведен
	|	И НЕ ДокТЧ.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная)
	|	И НЕ ДокТЧ.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.ТоварныйЧек)
	|	И НЕ ДокТЧ.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.РаботыОтНерезидентаПрошлогоПериода)
	|	И ДокТЧ.Ссылка.Дата >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	|	И ДокТЧ.Ссылка.Дата <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	|	И ДокТЧ.ДляХозяйственнойДеятельности = &Хоз
	|	И ДокТЧ.ДляОперацийОблагаемыхНДС = &Облагаемые
	|	И ДокТЧ.ПропорциональныйНДС = &Пропорциональные
	|	И ДокТЧ.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокТЧ.Ссылка,
	|	ДокТЧ.ДоговорКонтрагента
	|
	|ИМЕЮЩИЕ
	|	(НЕ СУММА(ДокТЧ.Сумма) = 0
	|		ИЛИ НЕ СУММА(ДокТЧ.СуммаНДС) = 0)
	|";
	
	// Освобожденные
	Если ЗначениеЗаполнено(ОсвобожденныеКорректировка) Тогда
		лЗапрос.УстановитьПараметр("Хоз",				Истина);
		лЗапрос.УстановитьПараметр("Облагаемые",		Ложь);
		лЗапрос.УстановитьПараметр("Пропорциональные",	Ложь);
		лтзРез = лЗапрос.Выполнить().Выгрузить();
		лДокОбъект = ОсвобожденныеКорректировка.ПолучитьОбъект();
		лДокОбъект.Услуги.Очистить();
		Для каждого лСтрока Из лтзРез Цикл
			лНоваяСтрока = лДокОбъект.Услуги.Добавить();
			ЗаполнитьТЧПриложение2( лНоваяСтрока, лСтрока);
		КонецЦикла;
		лДокОбъект.Записать( РежимЗаписиДокумента.Запись );
	КонецЕсли;
	
	// Пропорциональные
	Если ЗначениеЗаполнено(ПропорциональныеКорректировка) Тогда
		лЗапрос.УстановитьПараметр("Хоз",				Истина);
		лЗапрос.УстановитьПараметр("Облагаемые",		Ложь);
		лЗапрос.УстановитьПараметр("Пропорциональные",	Истина);
		лтзРез = лЗапрос.Выполнить().Выгрузить();
		лДокОбъект = ПропорциональныеКорректировка.ПолучитьОбъект();
		лДокОбъект.Услуги.Очистить();
		Для каждого лСтрока Из лтзРез Цикл
			лНоваяСтрока = лДокОбъект.Услуги.Добавить();
			ЗаполнитьТЧПриложение2( лНоваяСтрока, лСтрока);
		КонецЦикла;
		лДокОбъект.Записать( РежимЗаписиДокумента.Запись );
	КонецЕсли;
	
	// Нехозяйственные
	Если ЗначениеЗаполнено(НехозяйственныеКорректировка) Тогда
		лЗапрос.УстановитьПараметр("Хоз",				Ложь);
		лЗапрос.УстановитьПараметр("Облагаемые",		Ложь);
		лЗапрос.УстановитьПараметр("Пропорциональные",	Ложь);
		лтзРез = лЗапрос.Выполнить().Выгрузить();
		лДокОбъект = НехозяйственныеКорректировка.ПолучитьОбъект();
		лДокОбъект.Услуги.Очистить();
		Для каждого лСтрока Из лтзРез Цикл
			лНоваяСтрока = лДокОбъект.Услуги.Добавить();
			ЗаполнитьТЧПриложение2( лНоваяСтрока, лСтрока);
		КонецЦикла;
		лДокОбъект.Записать( РежимЗаписиДокумента.Запись );
	КонецЕсли;
	
КонецПроцедуры

Процедура НалоговыеНакладные(Кнопка)
	// Пробуем найти служебную номенклатуру
	мНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию("Умовний продаж", Истина);
	Если Не ЗначениеЗаполнено(мНоменклатура) Тогда Сообщить("Не нашли служебную номенклатуру 'Умовний продаж' !"); Возврат; КонецЕсли;
	
	лЗапрос = Новый Запрос;
	лЗапрос.УстановитьПараметр("Дата", ДатаПериода );
	лЗапрос.Текст =
	"ВЫБРАТЬ
	|	ДокТЧ.Ссылка КАК ВходящаяНН,
	|	ДокТЧ.ДоговорКонтрагента,
	|	СУММА(ДокТЧ.Сумма) КАК Сумма,
	|	СУММА(ДокТЧ.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	Документ.РегистрацияВходящегоНалоговогоДокумента.Товары КАК ДокТЧ
	|ГДЕ
	|	ДокТЧ.Ссылка.Проведен
	|	И ДокТЧ.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРегистрацияВходящегоНалоговогоДокумента.НалоговаяНакладная)
	|	И ДокТЧ.Ссылка.Дата >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	|	И ДокТЧ.Ссылка.Дата <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	|	И ДокТЧ.ДляХозяйственнойДеятельности = &Хоз
	|	И ДокТЧ.ДляОперацийОблагаемыхНДС = &Облагаемые
	|	И ДокТЧ.ПропорциональныйНДС = &Пропорциональные
	|	И ДокТЧ.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокТЧ.Ссылка,
	|	ДокТЧ.ДоговорКонтрагента
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДокТЧ.Сумма) > 0
	|		ИЛИ СУММА(ДокТЧ.СуммаНДС) > 0)
	|";
	
	// Освобожденные
	Если ЗначениеЗаполнено(Освобожденные) Тогда
		лЗапрос.УстановитьПараметр("Хоз",				Истина);
		лЗапрос.УстановитьПараметр("Облагаемые",		Ложь);
		лЗапрос.УстановитьПараметр("Пропорциональные",	Ложь);
		лтзРез = лЗапрос.Выполнить().Выгрузить();
		лДокОбъект = Освобожденные.ПолучитьОбъект();
		лДокОбъект.Услуги.Очистить();
		лНомерСтрокиТекущий = 0;
		Для каждого лСтрока Из лтзРез Цикл
			лНоваяСтрока = лДокОбъект.Услуги.Добавить();
			лНомерСтрокиТекущий = лНомерСтрокиТекущий + 1;
			лНоваяСтрока.ДоговорКонтрагента = лСтрока.ДоговорКонтрагента;
			лНоваяСтрока.Номенклатура = мНоменклатура;
			лНоваяСтрока.Содержание = "ПН № " + СокрЛП(лСтрока.ВходящаяНН.НомерВходящегоДокумента) +" від " + Формат(лСтрока.ВходящаяНН.ДатаВходящегоДокумента, "ДФ=dd.MM.yy") + ", ІПН " + СокрЛП(лСтрока.ВходящаяНН.Контрагент.ИНН);
			лНоваяСтрока.Количество = 1;
			лНоваяСтрока.Цена = лСтрока.Сумма;
			лНоваяСтрока.Сумма = лСтрока.Сумма;
			лНоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
			лНоваяСтрока.СуммаНДС = лСтрока.СуммаНДС;
			лНоваяСтрока.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке20;
			лНоваяСтрока.НомерСтрокиНН = лНомерСтрокиТекущий;
		КонецЦикла;
		лДокОбъект.Записать( РежимЗаписиДокумента.Запись );
	КонецЕсли;
	
	// Пропорциональные
	Если ЗначениеЗаполнено(Пропорциональные) Тогда
		лЗапрос.УстановитьПараметр("Хоз",				Истина);
		лЗапрос.УстановитьПараметр("Облагаемые",		Ложь);
		лЗапрос.УстановитьПараметр("Пропорциональные",	Истина);
		лтзРез = лЗапрос.Выполнить().Выгрузить();
		лДокОбъект = Пропорциональные.ПолучитьОбъект();
		лДокОбъект.Услуги.Очистить();
		лНомерСтрокиТекущий = 0;
		Для каждого лСтрока Из лтзРез Цикл
			лНоваяСтрока = лДокОбъект.Услуги.Добавить();
			лНомерСтрокиТекущий = лНомерСтрокиТекущий + 1;
			лНоваяСтрока.ДоговорКонтрагента = лСтрока.ДоговорКонтрагента;
			лНоваяСтрока.Номенклатура = мНоменклатура;
			лНоваяСтрока.Содержание = "ПН № " + СокрЛП(лСтрока.ВходящаяНН.НомерВходящегоДокумента) +" від " + Формат(лСтрока.ВходящаяНН.ДатаВходящегоДокумента, "ДФ=dd.MM.yy") + ", ІПН " + СокрЛП(лСтрока.ВходящаяНН.Контрагент.ИНН);
			лНоваяСтрока.Количество = 1;
			лНоваяСтрока.Цена = лСтрока.Сумма;
			лНоваяСтрока.Сумма = лСтрока.Сумма;
			лНоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
			лНоваяСтрока.СуммаНДС = лСтрока.СуммаНДС;
			лНоваяСтрока.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке20;
			лНоваяСтрока.НомерСтрокиНН = лНомерСтрокиТекущий;
		КонецЦикла;
		лДокОбъект.Записать( РежимЗаписиДокумента.Запись );
	КонецЕсли;
	
	// Нехозяйственные
	Если ЗначениеЗаполнено(Нехозяйственные) Тогда
		лЗапрос.УстановитьПараметр("Хоз",				Ложь);
		лЗапрос.УстановитьПараметр("Облагаемые",		Ложь);
		лЗапрос.УстановитьПараметр("Пропорциональные",	Ложь);
		лтзРез = лЗапрос.Выполнить().Выгрузить();
		лДокОбъект = Нехозяйственные.ПолучитьОбъект();
		лДокОбъект.Услуги.Очистить();
		лНомерСтрокиТекущий = 0;
		Для каждого лСтрока Из лтзРез Цикл
			лНоваяСтрока = лДокОбъект.Услуги.Добавить();
			лНомерСтрокиТекущий = лНомерСтрокиТекущий + 1;
			лНоваяСтрока.ДоговорКонтрагента = лСтрока.ДоговорКонтрагента;
			лНоваяСтрока.Номенклатура = мНоменклатура;
			лНоваяСтрока.Содержание = "ПН № " + СокрЛП(лСтрока.ВходящаяНН.НомерВходящегоДокумента) +" від " + Формат(лСтрока.ВходящаяНН.ДатаВходящегоДокумента, "ДФ=dd.MM.yy") + ", ІПН " + СокрЛП(лСтрока.ВходящаяНН.Контрагент.ИНН);
			лНоваяСтрока.Количество = 1;
			лНоваяСтрока.Цена = лСтрока.Сумма;
			лНоваяСтрока.Сумма = лСтрока.Сумма;
			лНоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
			лНоваяСтрока.СуммаНДС = лСтрока.СуммаНДС;
			лНоваяСтрока.СтатьяДекларацииНДСНалоговыеОбязательства = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке20;
			лНоваяСтрока.НомерСтрокиНН = лНомерСтрокиТекущий;
		КонецЦикла;
		лДокОбъект.Записать( РежимЗаписиДокумента.Запись );
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиННпоСодержанию( пКомментарий )
	лЗапрос = Новый Запрос;
	лЗапрос.УстановитьПараметр("Комментарий", СокрЛП(пКомментарий) );
	лЗапрос.УстановитьПараметр("Дата", ДатаПериода );
	лЗапрос.Текст = "ВЫБРАТЬ Док.Ссылка ИЗ Документ.НалоговаяНакладная КАК Док ГДЕ Док.Комментарий ПОДОБНО &Комментарий И Док.Дата >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И Док.Дата <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)";
	лВыборка = лЗапрос.Выполнить().Выбрать();
	Если лВыборка.Следующий() Тогда
		Возврат лВыборка.Ссылка;
	Иначе
		Возврат Документы.НалоговаяНакладная.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция НайтиПриложение2поСодержанию( пКомментарий )
	лЗапрос = Новый Запрос;
	лЗапрос.УстановитьПараметр("Комментарий", СокрЛП(пКомментарий) );
	лЗапрос.УстановитьПараметр("Дата", ДатаПериода );
	лЗапрос.Текст = "ВЫБРАТЬ Док.Ссылка ИЗ Документ.Приложение2КНалоговойНакладной КАК Док ГДЕ Док.Комментарий ПОДОБНО &Комментарий И Док.Дата >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И Док.Дата <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)";
	лВыборка = лЗапрос.Выполнить().Выбрать();
	Если лВыборка.Следующий() Тогда
		Возврат лВыборка.Ссылка;
	Иначе
		Возврат Документы.НалоговаяНакладная.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Процедура ПриОткрытии()
	Если Не ЗначениеЗаполнено(ДатаПериода)	 	Тогда ДатаПериода	 	= НачалоМесяца(ТекущаяДата())-1; КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Освобожденные) 	Тогда Освобожденные 	= НайтиННпоСодержанию("Условная продажа - Освобожденные"); КонецЕсли;
	Если Не ЗначениеЗаполнено(Пропорциональные) Тогда Пропорциональные 	= НайтиННпоСодержанию("Условная продажа - Пропорциональные"); КонецЕсли;
	Если Не ЗначениеЗаполнено(Нехозяйственные) 	Тогда Нехозяйственные 	= НайтиННпоСодержанию("Условная продажа - Нехозяйственные"); КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОсвобожденныеКорректировка)	 Тогда ОсвобожденныеКорректировка	 = НайтиПриложение2поСодержанию("Условная продажа - Освобожденные"); КонецЕсли;
	Если Не ЗначениеЗаполнено(ПропорциональныеКорректировка) Тогда ПропорциональныеКорректировка = НайтиПриложение2поСодержанию("Условная продажа - Пропорциональные"); КонецЕсли;
	Если Не ЗначениеЗаполнено(НехозяйственныеКорректировка)	 Тогда НехозяйственныеКорректировка	 = НайтиПриложение2поСодержанию("Условная продажа - Нехозяйственные"); КонецЕсли;
КонецПроцедуры

Процедура ДатаПериодаПриИзменении(Элемент)
	Освобожденные 		= НайтиННпоСодержанию("Условная продажа - Освобожденные");
	Пропорциональные	= НайтиННпоСодержанию("Условная продажа - Пропорциональные");
	Нехозяйственные 	= НайтиННпоСодержанию("Условная продажа - Нехозяйственные");
	
	ОсвобожденныеКорректировка	  = НайтиПриложение2поСодержанию("Условная продажа - Освобожденные");
	ПропорциональныеКорректировка = НайтиПриложение2поСодержанию("Условная продажа - Пропорциональные");
	НехозяйственныеКорректировка  = НайтиПриложение2поСодержанию("Условная продажа - Нехозяйственные");
КонецПроцедуры
