// УстановитьОтбор
//
Процедура УстановитьОтбор(КомпоновщикНастроек, ИмяПараметра, ЗначениеПараметра)
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПараметра);
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ЗначениеПараметра;	
		Попытка
			лЭтоГруппа = ЗначениеПараметра.ЭтоГруппа;
			Если лЭтоГруппа Тогда
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
			Иначе
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
		Исключение
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецПопытки;
	Иначе
		ЭлементОтбора.Использование = Ложь;
	КонецЕсли;
КонецПроцедуры

// УстановитьПараметр
//
Процедура УстановитьПараметр(КомпоновщикНастроек, ИмяПараметра, ЗначениеПараметра)
	ПараметрДанныхТекущий = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	ПараметрДанныхТекущий.Значение = ЗначениеПараметра;
	ПараметрДанныхТекущий.Использование = ЗначениеЗаполнено(ЗначениеПараметра);
КонецПроцедуры

Процедура УстановитьПараметрыОтборы()
	УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", ДатаНачала );
	УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(ДатаКонца));
	УстановитьПараметр(КомпоновщикНастроек, "Счет",ПланыСчетов.МСФО.НайтиПоКоду(281));
	УстановитьПараметр(КомпоновщикНастроек, "КорСчет",ПланыСчетов.МСФО.НайтиПоКоду(231));
   		
КонецПроцедуры


Процедура ДатаНачалаПриИзменении(Элемент)
		УстановитьПараметрыОтборы();
КонецПроцедуры


Процедура ДатаКонцаПриИзменении(Элемент)
		УстановитьПараметрыОтборы();
КонецПроцедуры



Процедура ПриОткрытии()
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда ДатаНачала = НачалоМесяца(ТекущаяДата()); КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаКонца) Тогда ДатаКонца = КонецМесяца(КонецДня(ТекущаяДата())); КонецЕсли;

		
	УстановитьПараметрыОтборы();
КонецПроцедуры

