Функция ПолучитьТаблицуСобытий() Экспорт
	ПриемникТаблица = Новый ТаблицаЗначений;
	ФильтрСтруктура = Новый Структура;
	мМетаданных = Новый Массив;
	Для Каждого Метаданное Из Метаданные.Документы Цикл
		мМетаданных.Добавить(Метаданное);
	КонецЦикла;
	ФильтрСтруктура.Вставить("Метаданные", мМетаданных);
	мСобытий = Новый Массив;
	мСобытий.Добавить("_$Data$_.New");
	мСобытий.Добавить("_$Data$_.Update");

	
	Если ЗначениеЗаполнено(НачПериода) Тогда
	ФильтрСтруктура.Вставить("ДатаНачала", НачПериода); 
    КонецЕсли;
    Если ЗначениеЗаполнено(КонПериода) Тогда
    ФильтрСтруктура.Вставить("ДатаОкончания", КонецДня(КонПериода)); 
    КонецЕсли;
    ФильтрСтруктура.Вставить("Событие", мСобытий);
	
	Состояние("Подождите, идет запрос к данным...");
	ВыгрузитьЖурналРегистрации(ПриемникТаблица, ФильтрСтруктура, "ИмяПользователя, Событие, Данные, ПредставлениеДанных",,);  
    //  ВыгрузитьЖурналРегистрации(ПриемникТаблица, <Фильтр>, <Колонки>, <ИмяВходногоФайла>, <МаксимальноеКоличество>) 
	ПриемникТаблица.Свернуть("ИмяПользователя, ПредставлениеДанных, Данные, Событие");
	ПриемникТаблица.Сортировать("ИмяПользователя");
	Состояние("Обработка данных...");
	текПол = Неопределено;  НовСтр = Неопределено;
	Для Каждого Стр Из ПриемникТаблица Цикл
		Если СокрЛП(Стр.ИмяПользователя) = "" Тогда
			Продолжить;
		КонецЕсли;	
		ОбработкаПрерыванияПользователя();
		Если  текПол = Стр.ИмяПользователя Тогда
			Если Стр.Событие= "_$Data$_.New" Тогда
			НовСтрД = НовСтр.Строки.Добавить();
			НовСтрД.ПредставлениеДанных = Стр.ПредставлениеДанных;
			НовСтрД.Данные = Стр.Данные;
			НовСтрД.КоличествоДоб = 1;
			НовСтр.КоличествоДоб = НовСтр.КоличествоДоб + 1;
		    ИначеЕсли Стр.Событие = "_$Data$_.Update" Тогда
			НовСтрД = НовСтр.Строки.Добавить();
			НовСтрД.ПредставлениеДанных = Стр.ПредставлениеДанных;
			НовСтрД.Данные = Стр.Данные;
			НовСтрД.КоличествоИзм = 1;
			НовСтр.КоличествоИзм = НовСтр.КоличествоИзм + 1;
		    КонецЕсли;
		Иначе 
			НовСтр = ВыходнТабл.Строки.Добавить();
			НовСтр.ИмяПользователя = Стр.ИмяПользователя;
			текПол = Стр.ИмяПользователя;
		КонецЕсли;
	КонецЦикла;
	Возврат ПриемникТаблица;
КонецФункции