// УстановитьОтбор
//
Процедура УстановитьОтборПоБулевому(КомпоновщикНастроек, ИмяПараметра, Использовать, ЗначениеПараметра)
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПараметра);
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	Если Использовать Тогда
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ЗначениеПараметра;	
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Иначе
		ЭлементОтбора.Использование = Ложь;
	КонецЕсли;
КонецПроцедуры

// УстановитьОтбор
//
Процедура УстановитьОтбор(КомпоновщикНастроек, ИмяПараметра, ЗначениеПараметра)
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПараметра);
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ЗначениеПараметра;	
		Попытка
			лЭтоГруппа = ЗначениеПараметра.ЭтоГруппа;
			Если лЭтоГруппа Тогда
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
			Иначе
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
		Исключение
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецПопытки;
	Иначе
		ЭлементОтбора.Использование = Ложь;
	КонецЕсли;
КонецПроцедуры

// УстановитьПараметр
//
Процедура УстановитьПараметр(КомпоновщикНастроек, ИмяПараметра, ЗначениеПараметра)
	ПараметрДанныхТекущий = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	ПараметрДанныхТекущий.Значение = ЗначениеПараметра;
	ПараметрДанныхТекущий.Использование = ЗначениеЗаполнено(ЗначениеПараметра);
КонецПроцедуры

Процедура УстановитьПараметрыОтборы()
	УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", ?(ЗначениеЗаполнено(НачалоПериода), НачалоДня(НачалоПериода), НачалоПериода) );
	УстановитьПараметр(КомпоновщикНастроек, "КонецПериода",  ?(ЗначениеЗаполнено(КонецПериода),  КонецДня(КонецПериода), КонецПериода) );
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	УстановитьОтбор(КомпоновщикНастроек, "Номенклатура", 		Номенклатура );
	УстановитьОтбор(КомпоновщикНастроек, "ВидПоставщика",  		ВидПоставщика);
	УстановитьОтбор(КомпоновщикНастроек, "Контрагент",  		Контрагент);
	УстановитьОтбор(КомпоновщикНастроек, "ДоговорКонтрагента",	ДоговорКонтрагента);
	УстановитьОтбор(КомпоновщикНастроек, "ВидДеятельностиНДС",	ВидДеятельностиНДС);
	УстановитьОтбор(КомпоновщикНастроек, "СтавкаНДС",  			СтавкаНДС);
	УстановитьОтбор(КомпоновщикНастроек, "ТипДоговора",  		ТипДоговора);
	УстановитьОтборПоБулевому(КомпоновщикНастроек, "ОсвобожденоОтНДС", ФильтрПоОсвобожденным, ОсвобожденоОтНДС);
КонецПроцедуры

Процедура ПриОткрытии()
	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда НачалоПериода = НачалоМесяца( ТекущаяДата() ); КонецЕсли;
	Если Не ЗначениеЗаполнено(КонецПериода) Тогда КонецПериода = КонецМесяца(НачалоПериода); КонецЕсли;
	
	ФильтрПоОсвобожденнымПриИзменении( Неопределено );
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура НачалоПериодаПриИзменении(Элемент)
	Если НачалоПериода = НачалоМесяца(НачалоПериода) Тогда КонецПериода = КонецМесяца(НачалоПериода); КонецЕсли;
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура ФильтрПоОсвобожденнымПриИзменении(Элемент)
	ЭлементыФормы.ОсвобожденоОтНДС.Видимость = ФильтрПоОсвобожденным;
	Если ФильтрПоОсвобожденным Тогда
		ЭлементыФормы.ОсвобожденоОтНДС.Заголовок = ?(ОсвобожденоОтНДС, "освобожденные", "облагаемые");
	КонецЕсли;
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура ОсвобожденоОтНДСПриИзменении(Элемент)
	Если ФильтрПоОсвобожденным Тогда
		ЭлементыФормы.ОсвобожденоОтНДС.Заголовок = ?(ОсвобожденоОтНДС, "освобожденные", "облагаемые");
	КонецЕсли;
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура НоменклатураПриИзменении(Элемент)
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура КонецПериодаПриИзменении(Элемент)
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура ВидПоставщикаПриИзменении(Элемент)
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура КонтрагентПриИзменении(Элемент)
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура ВидДеятельностиНДСПриИзменении(Элемент)
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура СтавкаНДСПриИзменении(Элемент)
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура ТипДоговораПриИзменении(Элемент)
	УстановитьПараметрыОтборы();
КонецПроцедуры
