
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Инициализировать();
КонецПроцедуры

Процедура ПриОткрытии()
	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда НачалоПериода = НачалоМесяца( ДобавитьМесяц(ТекущаяДата(), -1) ); КонецЕсли;
	Если Не ЗначениеЗаполнено(КонецПериода) Тогда КонецПериода = ТекущаяДата(); КонецЕсли;
КонецПроцедуры

// процедура обработчик события изменения периода
Процедура КнопкаНастройкаПериодаНажатие(Элемент)
	БИТ_МСФО_БухгалтерскиеОтчеты.ОбработчикНастройкаПериодаНажатиеМСФО(НачалоПериода, КонецПериода);
КонецПроцедуры
