
Процедура Заполнить(Кнопка)
	
	лЗапрос = Новый Запрос;
	лЗапрос.УстановитьПараметр("Контрагент", Контрагент);
	лЗапрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	лЗапрос.УстановитьПараметр("ДатаКонца", ДатаКонца);
	лЗапрос.Текст =
	"ВЫБРАТЬ
	|	Док.Контрагент КАК Контрагент,
	|	Док.Дата КАК ДатаДокумента,
	|	Док.Ссылка КАК Документ,
	|	Док.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Док.ДоговорКонтрагента.ВидПосредника КАК ВидПосредника,
	|	Док.ДоговорКонтрагента.ТипДоговора КАК ТипДоговора,
	|	Док.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	Док.СуммаДокумента КАК Сумма,
	|	Док.ЕстьПервичныйДокумент КАК ЕстьПервичныйДокумент
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК Док
	|ГДЕ
	|	НЕ Док.ЕстьПервичныйДокумент
	|	И НЕ Док.ПометкаУдаления
	|	И Док.Дата >= ДАТАВРЕМЯ(2015, 7, 1)
	|	И (Док.Контрагент = &Контрагент
	|			ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|	И (Док.Дата >= НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (Док.Дата <= КОНЕЦПЕРИОДА(&ДатаКонца, ДЕНЬ)
	|			ИЛИ &ДатаКонца = ДАТАВРЕМЯ(1, 1, 1))
	|";
	лтзРез = лЗапрос.Выполнить().Выгрузить();
	
	Приходы.Очистить();
	Приходы.Загрузить( лтзРез );
			
КонецПроцедуры

Процедура ОсновныеДействияФормыЗаписать(Кнопка)
	Для каждого лСтрока Из Приходы Цикл
		Если Не лСтрока.ЕстьПервичныйДокумент Тогда Продолжить; КонецЕсли;
		лДокОбъект = лСтрока.Документ.ПолучитьОбъект();
		лДокОбъект.ЕстьПервичныйДокумент = Истина;
		лДокОбъект.ОбменДанными.Загрузка = Истина;
		лДокОбъект.Записать( РежимЗаписиДокумента.Запись );
	КонецЦикла;
	Заполнить( "" );
КонецПроцедуры

Процедура ПриОткрытии()
	Заполнить( "" );
КонецПроцедуры

Процедура КонтрагентПриИзменении(Элемент)
	Заполнить( "" );
КонецПроцедуры

Процедура ДатаНачалаПриИзменении(Элемент)
	Заполнить( "" );
КонецПроцедуры

Процедура ДатаКонцаПриИзменении(Элемент)
	Заполнить( "" );
КонецПроцедуры
