
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Если Значение = "" Тогда
		ЭлементыФормы.Результат.Очистить();
	Иначе
		ВывестиШтрихКод();
	КонецЕсли;	
КонецПроцедуры


Процедура ВывестиШтрихКод()
	ВыборПринтеров.Очистить(); // список значений
    принтеры =  Новый COMОбъект ("WScript.Network");
    prn =  принтеры.EnumPrinterConnections();
    i = 0; 
    Пока i < prn.Count()-1 Цикл
        ВыборПринтеров.Добавить(prn.Item(i+1));
		НужныйПринтер=ВыборПринтеров.НайтиПоЗначению(prn.Item(i+1)); 
		//ЕСли Сред(НужныйПринтер,1,17)= "Brother PT-9700PC" Тогда   //Принтер для печати этикеток штрихкода.    \\pugach-hpi5\Brother PT-9700PC
		//	Принтер=НужныйПринтер;	
		//КонецЕсли;
		Если Найти(НужныйПринтер.Значение, "Brother PT-9700PC") > 0 Тогда
			Принтер=НужныйПринтер;
			Прервать;
		КонецЕсли;
        i = i + 2; 
	КонецЦикла;
	//
	//ЕСли Сред(Принтер,15,17)<> "Brother PT-9700PC" Тогда 
	//		Сообщить("Принтер для печати этикеток штрихкода не установлен. Печать не возможна!");
	//	Возврат;
	//КонецЕсли;
	
	ТабДок = ЭлементыФормы.Результат;
	ТабДок.Очистить();
	ТАбДок.ИмяПринтера=Принтер;
	ТабДок.РазмерКолонтитулаСверху=0;
	ТабДок.РазмерКолонтитулаСнизу=0;
	ТабДок.ПолеСверху=0;
	ТабДок.ПолеСлева=0;
	ТабДок.ПолеСнизу=0;
	ТабДок.ПолеСправа=0;
	ТабДок.АвтоМасштаб=Истина;
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТАбДок.РазмерСтраницы="Windows:317";  //Format 1C-"Windows:317" 
	ТАбДок.Защита=Истина;
	Макет = ЭтотОбъект.ПолучитьМакет("Шаблон");
	РезультатТекст=КодОС ;
	Результат = КодОС;//ЭтотОбъект.code128(КодОС);
	Макет.Область("Рис2").Текст= "GGU:"+Значение.Наименование;

	
Область=Макет.Область("Рис1");
Макет.Область("Рис1").Объект.ТекстКода=Результат;
Макет.Область("Рис1").Объект.Сообщение=РезультатТекст;
ТабДок.Вывести(Макет);


КонецПроцедуры

Процедура ПриОткрытии()
	Значение ="";
	Размер = 40;
	Макет = ЭтотОбъект.ПолучитьМакет("Шаблон");
		
КонецПроцедуры


Процедура ЗначениеПриИзменении(Элемент)
	ЭлементыФормы.Результат.Очистить();
	КодОС=Значение.Код;
КонецПроцедуры



