// УстановитьОтбор
//
Процедура УстановитьОтбор(КомпоновщикНастроек, ИмяПараметра, ЗначениеПараметра, ВидСравнения)
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПараметра);
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ЗначениеПараметра;	
		ЭлементОтбора.ВидСравнения = ВидСравнения;
	Иначе
		ЭлементОтбора.Использование = Ложь;
	КонецЕсли;
КонецПроцедуры

// УстановитьПараметр
//
Процедура УстановитьПараметр(КомпоновщикНастроек, ИмяПараметра, ЗначениеПараметра)
	ПараметрДанныхТекущий = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	ПараметрДанныхТекущий.Значение = ЗначениеПараметра;
	ПараметрДанныхТекущий.Использование = Истина;
КонецПроцедуры

Процедура УстановитьПараметрыОтборы()
	КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		УстановитьОтбор(КомпоновщикНастроек, "ДатаДокумента", НачалоДня(ДатаНачала),  ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаКонца) Тогда
		УстановитьОтбор(КомпоновщикНастроек, "ДатаДокумента", КонецДня(ДатаКонца),  ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытии()
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура ДатаНачалаПриИзменении(Элемент)
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура ДатаКонцаПриИзменении(Элемент)
	УстановитьПараметрыОтборы();
КонецПроцедуры
