
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	СоединениеСРабочимПроцессом.AddAuthentication(Пользователь,Пароль);
	УстановитьБазу();
	Если ИнформационнаяБаза<>Неопределено Тогда
		Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	УстановитьБазу();
	Отказ = (ИнформационнаяБаза<>Неопределено);
КонецПроцедуры

Процедура УстановитьБазу()
	
	ИнформационныеБазы = СоединениеСРабочимПроцессом.GetInfoBases().Выгрузить();
	Для Каждого ИБ Из ИнформационныеБазы Цикл
		
		Если ВРег(ИБ.Name) <> ВРег(ИмяБазы) Тогда
			Продолжить;
		ИначеЕсли ПустаяСтрока(ИБ.dbName) Тогда
		ИначеЕсли ИБ.DBMS<>"MSSQLServer" Тогда
			Сообщить("Информационная база не является базой SQL",СтатусСообщения.Внимание);
		Иначе
			ИнформационнаяБаза = ИБ;
		КонецЕсли;
		
		Прервать;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриОткрытии()
	Пользователь = ИмяПользователя();
КонецПроцедуры


