Процедура ЗаполнитьАдресаИзСтроки(Список, СтрокаСРазделителями)
	СтрокаАдресов = СтрокаСРазделителями;
	Пока не ПустаяСтрока(СтрокаАдресов) Цикл
		ПозицияЗапятой = Найти(СтрокаАдресов ,",");
		Если ПозицияЗапятой = 0 Тогда
			Адрес = СтрокаАдресов;
		Иначе
			Адрес = Лев(СтрокаАдресов,ПозицияЗапятой-1);			
		КонецЕсли;
		Список.Добавить(СокрЛП(Адрес));
		Если Адрес = СтрокаАдресов Тогда
			Прервать;
		КонецЕсли;
		СтрокаАдресов = Сред(СтрокаАдресов,ПозицияЗапятой+1);
	КонецЦикла;
КонецПроцедуры

Процедура Инициализировать() Экспорт
	ТЗ_Адресаты = Новый ТаблицаЗначений;
	ТЗ_Адресаты.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	ТЗ_Адресаты.Колонки.Добавить("TO", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	ТЗ_Адресаты.Колонки.Добавить("CC", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));	
	
	МакетАдресов = ПолучитьМакет("Адресаты");
	
	Область = МакетАдресов.ПолучитьОбласть("Адреса");
	//Область = МакетАдресов.ПолучитьОбласть("АдресаТест");
	
	Для Н = 1 По Область.ВысотаТаблицы Цикл
		НовСтр = ТЗ_Адресаты.Добавить();	
		НовСтр.Подразделение = СокрЛП(Область.Область(Н,1).Текст);
		НовСтр.TO = СокрЛП(Область.Область(Н,2).Текст);
		НовСтр.CC = СокрЛП(Область.Область(Н,3).Текст);
	КонецЦикла;
	
	Если ТЗ_Адресаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	лОтправитель = "Robot1C.Kyiv@glencore.com.ua";
	
	Если ТЗ_Адресаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокТЧ.Ссылка
	|ПОМЕСТИТЬ АктыЭкспедирования
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ДокТЧ
	|ГДЕ
	|	ИСТИНА
	|	И ДокТЧ.Ссылка.Проведен
	|	И НЕ ДокТЧ.Ссылка.ЕстьПервичныйДокумент
	|	И ДокТЧ.ДоговорКонтрагента.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипДоговора.ЭкспедиторскиеУслуги)
	|	И ДокТЧ.Ссылка.Дата >= ДАТАВРЕМЯ(2017, 5, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокТЧ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДокументыПоставщиков.ДоговорКонтрагента.Номер ПОДОБНО ""%%OP%%""
	|			ТОГДА ""OP""
	|		КОГДА ДокументыПоставщиков.ДоговорКонтрагента.Номер ПОДОБНО ""%%MP%%""
	|			ТОГДА ""MP""
	|		КОГДА ДокументыПоставщиков.ДоговорКонтрагента.Номер ПОДОБНО ""%%CP%%""
	|			ТОГДА ""CP""
	|		КОГДА ДокументыПоставщиков.ДоговорКонтрагента.Номер ПОДОБНО ""%%VP%%""
	|			ТОГДА ""VP""
	|		КОГДА ДокументыПоставщиков.ДоговорКонтрагента.Номер ПОДОБНО ""%%IP%%""
	|			ТОГДА ""IP""
	|		КОГДА НЕ АктыЭкспедирования.Ссылка ЕСТЬ NULL
	|			ТОГДА ""ZP""
	|		ИНАЧЕ ДокументыПоставщиков.ДоговорКонтрагента.Номер
	|	КОНЕЦ КАК Подразделение,
	|	НАЧАЛОПЕРИОДА(ДокументыПоставщиков.Дата, ДЕНЬ) КАК Дата,
	|	ДокументыПоставщиков.Ссылка.Представление КАК Документ,
	|	ДокументыПоставщиков.Номер,
	|	ДокументыПоставщиков.Контрагент.Представление КАК Контрагент,
	|	ДокументыПоставщиков.ДоговорКонтрагента.Представление КАК Договор,
	|	ДокументыПоставщиков.СуммаДокумента КАК Сумма,
	|	ДокументыПоставщиков.Ссылка.Склад КАК Склад,
	|	ДокументыПоставщиков.Ссылка.Склад.Родитель КАК Область
	|ИЗ
	|	ЖурналДокументов.ДокументыПоставщиков КАК ДокументыПоставщиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГраницыЗапретаИзмененияДанных КАК ГраницыЗапретаИзмененияДанных
	|		ПО ДокументыПоставщиков.Организация = ГраницыЗапретаИзмененияДанных.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктыЭкспедирования КАК АктыЭкспедирования
	|		ПО ДокументыПоставщиков.Ссылка = АктыЭкспедирования.Ссылка
	|ГДЕ
	|	ДокументыПоставщиков.Номер ПОДОБНО ""SR%%""
	|	И НЕ ДокументыПоставщиков.ПометкаУдаления
	|	И ДокументыПоставщиков.Проведен
	|	И ДокументыПоставщиков.Дата >= ДАТАВРЕМЯ(2017, 1, 1)
	|	И НЕ ЕСТЬNULL(ДокументыПоставщиков.Ссылка.ЕстьПервичныйДокумент, ЛОЖЬ)
	|	И ГраницыЗапретаИзмененияДанных.Пользователь = НЕОПРЕДЕЛЕНО
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение,
	|	Контрагент,
	|	Дата,
	|	Документ
	|ИТОГИ ПО
	|	Подразделение";
	
	ВыборкаПоПодразделениям = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоПодразделениям.Следующий() Цикл 
		Подразделение = ВыборкаПоПодразделениям.Подразделение;
		
		АдресаTO = Новый СписокЗначений; АдресаCC = Новый СписокЗначений;
		Адреса = ТЗ_Адресаты.НайтиСтроки(Новый Структура("Подразделение", Подразделение));
		Для каждого СтрокаАдресат Из Адреса Цикл
			ЗаполнитьАдресаИзСтроки(АдресаTO, СокрЛП(СтрокаАдресат.TO));
			ЗаполнитьАдресаИзСтроки(АдресаCC, СокрЛП(СтрокаАдресат.CC));
		КонецЦикла;
		
		Если (АдресаTO.Количество()=0) и (АдресаCC.Количество()=0) Тогда
			Продолжить; // некуда отправить
		КонецЕсли;
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Письмо.Тема = "Перечень отсутствующих первичных документов на бумажных носителях на " + ТекущаяДата(); 
		
		Письмо.Отправитель = лОтправитель;
		Письмо.ИмяОтправителя = "Робот 1С";
		
		Для каждого АдресTO Из АдресаTO Цикл
			Письмо.Получатели.Добавить(АдресTO.Значение);		
		КонецЦикла;
		
		Для каждого АдресCC Из АдресаCC Цикл
			Письмо.Копии.Добавить(АдресCC.Значение);		
		КонецЦикла;
		
		Письмо.СлепыеКопии.Добавить("Aleksandr.Plyushchev@glencore.com.ua");	
		
		ТекстПисьма = "<!DOCTYPE HTML PUBLIC ""-//W3C//DTD HTML 4.01//EN""" + Символы.ПС;
		ТекстПисьма=ТекстПисьма+"""http://www.w3.org/TR/html4/strict.dtd"">"+ Символы.ПС;
		ТекстПисьма=ТекстПисьма+"<html><head> <meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">"+Символы.ПС;
		ТекстПисьма=ТекстПисьма+"<title>Перечень отсутствующих первичных документов на бумажных носителях</title>"+Символы.ПС;
		ТекстПисьма=ТекстПисьма+"<style type=""text/css""> table {border-collapse: collapse;} th {background: #aaa;text-align: left;}td, th {border: 1px solid #800; padding: 4px;} </style></head><body>"+Символы.ПС;
		ТекстПисьма=ТекстПисьма+"<B>Перечень отсутствующих первичных документов на бумажных носителях</B><br>"+Символы.ПС;
		
		ТекстПисьма=ТекстПисьма+"<br><i>Дата формирования отчета "+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy")+"  </i>"+Символы.ПС;
		ТекстПисьма=ТекстПисьма+"<br><i>Направление "+Подразделение+"  </i>"+Символы.ПС;
		
		ТекстПисьма=ТекстПисьма+"<TABLE width=""100%"" cellspacing=""0"" border=""1"">";
		
		ТекстПисьма=ТекстПисьма+"<tr><TH>Документ</TH><TH>Контрагент</TH><TH>Договор</TH><TH>Сумма с НДС, грн</TH><TH>Склад</TH><TH>Область</TH></tr>"+Символы.ПС;
		
		Детализация = ВыборкаПоПодразделениям.Выбрать();
		#Если Клиент Тогда
			Сообщить("По подразделению "+Подразделение +" получено " + Детализация.Количество() + " документов.");
		#КонецЕсли
		Пока Детализация.Следующий() Цикл 
			ТекстПисьма=ТекстПисьма+"<TR><TD>"+ Детализация.Документ +"</TD><TD>"+ Детализация.Контрагент +"</TD><TD>"+ Детализация.Договор +"</TD><TD>"+ Детализация.Сумма+"</TD><TD>"+ Детализация.Склад+"</TD><TD>"+ Детализация.Область+"</TD></TR>";		
		КонецЦикла;
		
		ТекстПисьма=ТекстПисьма+"</TABLE>";
		ТекстПисьма = ТекстПисьма+"</BODY></HTML>";
		Текст = Письмо.Тексты.Добавить(ТекстПисьма, ТипТекстаПочтовогоСообщения.HTML);
		
		Почта = Новый ИнтернетПочта;
		
		лСписокАдресСервераSMTP = Новый СписокЗначений;
		//"smtp2.nl.glencore.net";
		лСписокАдресСервераSMTP.Добавить("10.40.99.123","");
		лСписокАдресСервераSMTP.Добавить("10.40.99.122","");
		лСписокАдресСервераSMTP.Добавить("10.40.98.121","");
		лСписокАдресСервераSMTP.Добавить("10.40.98.120","End");
		Для каждого лСтрока Из лСписокАдресСервераSMTP Цикл
			Профиль = СоздатьПочтовыйПрофиль(лСтрока.Значение);
			Попытка
				Почта.Подключиться(Профиль);
				Почта.Послать(Письмо);
				лПисьмоОтправлено = Истина;
			Исключение
				Сообщить("Не удалось отправить письмо по ip адресу: """ + Профиль.АдресСервераSMTP + """");   
				Если лСтрока.Представление = "End" Тогда 
					Сообщить(ОписаниеОшибки() + " по ip адресу: """ + Профиль.АдресСервераSMTP + """");   //Выводить только если это последний адрес из списка значений
				КонецЕсли;
				лПисьмоОтправлено = Ложь;
			КонецПопытки;
			
			Если лПисьмоОтправлено Тогда Прервать; КонецЕсли;
		КонецЦикла;
		
		Почта.Отключиться();   
	КонецЦикла;
	#Если Клиент Тогда
		Сообщить("Готово.");
	#КонецЕсли
КонецПроцедуры

// СоздатьПочтовыйПрофиль
//
Функция СоздатьПочтовыйПрофиль( АдресСервераSMTP )
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	
	Профиль.ИспользоватьSSLPOP3 = Истина;
	Профиль.АдресСервераPOP3 = "10.40.20.119";
	Профиль.ПортPOP3 = 995;
	Профиль.Пользователь = "RES-UA-IEV-ROBOT@anyaccess.net";
	Профиль.Пароль = "GAUR0b1C";
	
	Профиль.ИспользоватьSSLSMTP = Ложь;
	Профиль.АдресСервераSMTP = АдресСервераSMTP;
	Профиль.ПортSMTP = 587;
	Профиль.ПользовательSMTP = "RES-UA-IEV-ROBOT@anyaccess.net";
	Профиль.ПарольSMTP = "GAUR0b1C";   
	Профиль.ТолькоЗащищеннаяАутентификацияSMTP = Ложь;
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	
	Возврат Профиль;
	
КонецФункции // СоздатьПочтовыйПрофиль
