
Процедура Заполнить(Кнопка)
	
	лЗапрос = Новый Запрос;
	лЗапрос.УстановитьПараметр("Контрагент", Контрагент);
	лЗапрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	лЗапрос.УстановитьПараметр("ДатаКонца", ДатаКонца);
	лЗапрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка.Контрагент КАК Контрагент,
	|	Док.Ссылка.Дата КАК ДатаДокумента,
	|	Док.Ссылка КАК Документ,
	|	СУММА(Док.Количество) КАК Количество,
	|	Док.Ссылка.ЕстьПервичныйДокумент КАК ЕстьПервичныйДокумент
	|ИЗ
	|	Документ.ДоверенностьОтПокупателя.Товары КАК Док
	|ГДЕ
	|	НЕ Док.Ссылка.ЕстьПервичныйДокумент
	|	И Док.Ссылка.Дата >= ДАТАВРЕМЯ(2015, 7, 1)
	|	И (Док.Ссылка.Контрагент = &Контрагент
	|			ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|	И (Док.Ссылка.Дата >= НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)
	|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
	|	И (Док.Ссылка.Дата < КОНЕЦПЕРИОДА(&ДатаКонца, ДЕНЬ)
	|			ИЛИ &ДатаКонца = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.Ссылка,
	|	Док.Ссылка.Контрагент,
	|	Док.Ссылка.Дата,
	|	Док.Ссылка.ЕстьПервичныйДокумент
	|";
	лтзРез = лЗапрос.Выполнить().Выгрузить();
	
	СписокДокументов.Очистить();
	СписокДокументов.Загрузить( лтзРез );
			
КонецПроцедуры

Процедура ОсновныеДействияФормыЗаписать(Кнопка)
	Для каждого лСтрока Из СписокДокументов Цикл
		Если Не лСтрока.ЕстьПервичныйДокумент Тогда Продолжить; КонецЕсли;
		лДокОбъект = лСтрока.Документ.ПолучитьОбъект();
		лДокОбъект.ЕстьПервичныйДокумент = Истина;
		лДокОбъект.ОбменДанными.Загрузка = Истина;
		лДокОбъект.Записать( РежимЗаписиДокумента.Запись );
	КонецЦикла;
	Заполнить( "" );
КонецПроцедуры

Процедура ПриОткрытии()
	Заполнить( "" );
КонецПроцедуры

Процедура КонтрагентПриИзменении(Элемент)
	Заполнить( "" );
КонецПроцедуры

Процедура ДатаНачалаПриИзменении(Элемент)
	Заполнить( "" );
КонецПроцедуры

Процедура ДатаКонцаПриИзменении(Элемент)
	Заполнить( "" );
КонецПроцедуры
