// УстановитьОтбор
//
Процедура УстановитьОтбор(КомпоновщикНастроек, ИмяПараметра, ЗначениеПараметра, пВидСравнения = Неопределено)
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПараметра);
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ЗначениеПараметра;	
		Если пВидСравнения = Неопределено Тогда
			Попытка
				лЭтоГруппа = ЗначениеПараметра.ЭтоГруппа;
				Если лЭтоГруппа Тогда
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
				Иначе
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				КонецЕсли;
			Исключение
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			КонецПопытки;
		Иначе
			ЭлементОтбора.ВидСравнения = пВидСравнения;
		КонецЕсли;
	Иначе
		ЭлементОтбора.Использование = Ложь;
	КонецЕсли;
КонецПроцедуры

// УстановитьПараметр
//
Процедура УстановитьПараметр(КомпоновщикНастроек, ИмяПараметра, ЗначениеПараметра)
	ПараметрДанныхТекущий = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	ПараметрДанныхТекущий.Значение = ЗначениеПараметра;
	ПараметрДанныхТекущий.Использование = ЗначениеЗаполнено(ЗначениеПараметра);
КонецПроцедуры

Процедура УстановитьПараметрыОтборы()
	КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		УстановитьОтбор(КомпоновщикНастроек, "ДатаНН", НачалоДня(НачалоПериода), ВидСравненияКомпоновкиДанных.БольшеИлиРавно );
	КонецЕсли;
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		УстановитьОтбор(КомпоновщикНастроек, "ДатаНН", КонецДня(КонецПериода), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно );
	КонецЕсли;
КонецПроцедуры

Процедура НачалоПериодаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(НачалоПериода) Тогда КонецПериода = КонецМесяца(НачалоПериода); КонецЕсли;
	
	УстановитьПараметрыОтборы();
КонецПроцедуры

Процедура КонецПериодаПриИзменении(Элемент)
	УстановитьПараметрыОтборы();
КонецПроцедуры
