// (С) АБИ Украина 2004

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура отправляет регистрационную информацию почтой
// 
// Параметры:
// 	 Нет
//
Процедура ОтправитьРегИнфо() 
	// проверяем заполненность рег. информации
	
	Если сзФайлы.Количество() = 0 Тогда
		Предупреждение(НСтр("ru='Список файлов пуст!';uk='Список файлів порожній!'"));	
		Возврат;
	КонецЕсли;
	
	стрНеЗаполненРегНомер = НСтр("ru='Не заполнен регистрационный номер!';uk='Не заповнений реєстраційний номер!'");
	
	Если ПустаяСтрока(РегНомер2) Тогда
		Предупреждение(стрНеЗаполненРегНомер);	
		ЭтаФорма.ТекущийЭлемент = ЭлементыФормы.РегНомер2; 
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(РегНомер3) Тогда
		Предупреждение(стрНеЗаполненРегНомер);	
		ЭтаФорма.ТекущийЭлемент = ЭлементыФормы.РегНомер3; 
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(РегНомер4) Тогда
		Предупреждение(стрНеЗаполненРегНомер);	
		ЭтаФорма.ТекущийЭлемент = ЭлементыФормы.РегНомер4; 
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(НазваниеОрганизации) Тогда
		Предупреждение(НСтр("ru='Не заполнено название организации!';uk='Не заповнена назва організації!'"));
		ЭтаФорма.ТекущийЭлемент = ЭлементыФормы.НазваниеОрганизации; 
		Возврат;
	КонецЕсли;
	
	
	// записуем рег. информацию
	
	РегИнфо.РегНомер1 = РегНомер1;
	РегИнфо.РегНомер2 = РегНомер2;
	РегИнфо.РегНомер3 = РегНомер3;
	РегИнфо.РегНомер4 = РегНомер4;
	
	РегИнфо.НазваниеОрганизации = НазваниеОрганизации;
	
	ЗаписатьРегИнфо();
	
	// отправляем по почте файл с запросом
	
	Рез = СформироватьФайлЗапроса(сзФайлы);
	Если Не Рез Тогда
		Предупреждение(НСтр("ru='Не удалось сформировать файл запроса!';uk='Не вдалося сформувати файл запиту!'"));	
		Возврат;
	КонецЕсли; 
	
	
	Если НастройкиОбработки.РаботаСПочтой = "1С" Тогда
		Рез = ОтправитьПисьмоЗапрос();
	Иначе
		Рез = ОтправитьПисьмоЗапросЛук();
	КонецЕсли;
	
	
	Если Не Рез Тогда
		Возврат;
	КонецЕсли; 
	
	Предупреждение(НСтр("ru='Письмо успешно сформировано. Если это необходимо, отправьте почту в почтовой программе. После получения ответного письма скопируйте все вложения этого письма в каталог обработки.';uk='Лист успішно сформовано. Якщо це необхідно, відправте пошту в поштовій програмі. Після одержання листа-відповіді скопіюйте усі вкладення цього листа в каталог обробки.'"));
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии()
	
	// читаем рег. инфо
	ПрочитатьРегИнфо();
	
	РегНомер1 = РегИнфо.РегНомер1;
	РегНомер2 = РегИнфо.РегНомер2;
	РегНомер3 = РегИнфо.РегНомер3;
	РегНомер4 = РегИнфо.РегНомер4;
	
	НазваниеОрганизации = РегИнфо.НазваниеОрганизации;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура-обработчик нажатия на кнопку "Отправить"
//
Процедура КнопкаВыполнитьНажатие(Элемент)
	
	ОтправитьРегИнфо();
	
	Закрыть();
	
КонецПроцедуры
